{\rtf1\ansi\ansicpg1252\cocoartf1347\cocoasubrtf570
{\fonttbl\f0\fswiss\fcharset0 Helvetica;\f1\fnil\fcharset134 STHeitiSC-Light;}
{\colortbl;\red255\green255\blue255;}
\margl1440\margr1440\vieww25100\viewh13320\viewkind0
\pard\tx720\tx1440\tx2160\tx2880\tx3600\tx4320\tx5040\tx5760\tx6480\tx7200\tx7920\tx8640\pardirnatural

\f0\fs24 \cf0 /* 0 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3053"),\
    "id" : "2822",\
    "shortName" : "matlab",\
    "name" : "Introduction to Programming with MATLAB",\
    "url" : "https://www.coursera.org/course/matlab",\
    "about" : [ \
        "<div><div>MATLAB is a special-purpose language that is an excellent choice for writing moderate-size programs that solve problems involving the manipulation of numbers. The design of the language makes it possible to write a powerful program in a few lines. The problems may be relatively complex, while the MATLAB programs that solve them are relatively simple: relative, that is, to the equivalent program written in a general-purpose language, such as C++ or Java. As a result, MATLAB is being used in a wide variety of domains from the natural sciences through all disciplines of engineering to finance and beyond, and it is heavily used in industry. Hence, a solid background in MATLAB is an indispensable skill in today\'92s job market.</div><div><br></div><div>Nevertheless, this course is not a MATLAB tutorial. It is an introductory programming course that happens to use MATLAB to illustrate general concepts in computer science and programming.&nbsp;</div><div><br></div><div>Students who successfully complete this course will:</div><div><ul><li>become familiar with general concepts in computer science<br></li><li>gain an understanding of the general concepts of programming<br></li><li>obtain a solid foundation in the use of MATLAB<br></li></ul></div><div>\\t</div><div>This is an introductory college-level course in computer science for engineering and science students. However, it is also suitable for high school students who are interested in programming. The material assumes no background in mathematics beyond the standard high school curriculum. Students taking the course will get a MATLAB license free of charge for a three-month period.&nbsp;<br></div></div>"\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "matlab"\
    ],\
    "level" : 1\
\}\
\
/* 1 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3058"),\
    "id" : "677",\
    "shortName" : "ni",\
    "name" : "Networks Illustrated: Principles without Calculus",\
    "url" : "https://www.coursera.org/course/ni",\
    "about" : [ \
        "<p>Networks are\\neverywhere. From the social connections we make on platforms like Facebook, to\\nthe technology behind the Internet upon which these sites run, they have become\\nan integral part of our daily lives.</p>\\n\\n<p>In this course,\\nwe will study these networks. Specifically, we will focus on understanding the\\nfundamental principles that guide their designs and sustainability. We will see\\nhow the simplest phrases like \'93sharing is hard\'94 and \'93crowds are wise\'94 can\\nsummarize a vast amount of network theory, that goes into answering questions\\nlike \'93how does 3G work on your smartphone?\'94 and \'93when can you trust an average\\nrating on Amazon?\'94. &nbsp;And rather than using heavy math, this course will only\\nrequire basic arithmetic such as addition and multiplication. We rely on\\nanimations, analogies, and anecdotes as our pedagogical tools, in lieu of\\ndetailed equations.</p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "networking", \
        "network design"\
    ]\
\}\
\
/* 2 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305d"),\
    "id" : "24",\
    "shortName" : "comparch",\
    "name" : "Computer Architecture",\
    "url" : "https://www.coursera.org/course/comparch",\
    "about" : [ \
        "This course forms a strong foundation in the understanding and design of modern computing systems. Building on a computer organization base, this course explores techniques that go into designing a modern microprocessor. Fundamental understanding of computer architecture is key not only for students interested in hardware and processor design, but is a foundation for students interested in compilers, operating systems, and high performance programming. This course will explore how the computer architect can utilize the increasing number of transistors available to improve the performance of a processor. Focus will be given to architectures that can exploit different forms of parallelism, whether they be implicit or explicit. This course covers architectural techniques such as multi-issue superscalar processors, out-of-order processors, Very Long Instruction Word (VLIW) processors, advanced caching, and multiprocessor systems."\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "computer architecture"\
    ],\
    "level" : 1\
\}\
\
/* 3 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3057"),\
    "id" : "88",\
    "shortName" : "interactivepython",\
    "name" : "An Introduction to Interactive Programming in Python",\
    "url" : "https://www.coursera.org/course/interactivepython",\
    "about" : [ \
        "<b>Note that this course is currently being offered in two consecutive parts. You may access part 1 of this split version <a href = \\"https://www.coursera.org/course/interactivepython1\\">here</a></b>.\\n<p><p>\\nThis course is designed to help students with very little or no computing background learn the basics of building simple interactive applications.  Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera.  To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple.  These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse.\\n <p></p><p>\\nThe primary method for learning the course material will be to work through multiple \\"mini-projects\\" in Python.  To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you\'92ve finished our course, we can\'92t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you\'92re doing it.</p>"\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "python"\
    ],\
    "level" : 1\
\}\
\
/* 4 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305c"),\
    "id" : "1001",\
    "shortName" : "cloudcomputing",\
    "name" : "Cloud Computing Concepts",\
    "url" : "https://www.coursera.org/course/cloudcomputing",\
    "about" : [ \
        "<p>Cloud computing systems today, whether open-source or used inside companies, are built using a common set of <strong>core techniques, algorithms, and design philosophies</strong>\'97all centered around distributed systems. Learn about such fundamental distributed computing \\"concepts\\" for cloud computing. </p>\\n\\n<p>Some of these concepts include:</p>\\n<ul>\\n<li>Clouds, MapReduce, key-value stores</li>\\n<li>Classical precursors</li>\\n<li>Widely-used algorithms</li>\\n<li>Classical algorithms </li>\\n<li>Scalability</li>\\n<li>Trending areas</li>\\n<li>And more!</li></ul><p>Understand&nbsp;<strong>how these techniques work</strong>&nbsp;inside today\'92s most widely-used cloud computing systems. Get your hands dirty using these concepts with provided homework exercises. In the&nbsp;<strong>optional programming track</strong>, implement some of these concepts in template assignments provided in C++ programming language.</p><p>You will also watch interviews with leading managers and researchers, from both industry and academia.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "cloud computing", \
        "c++"\
    ]\
\}\
\
/* 5 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3061"),\
    "id" : "1875",\
    "shortName" : "intropoojava",\
    "name" : "Introduction \'e0 la programmation orient\'e9e objet (en Java)",\
    "url" : "https://www.coursera.org/course/intropoojava",\
    "about" : [ \
        "Pr\'e9sentation et mise en pratique en Java des concepts de base de la programmation orient\'e9e objet&nbsp;: objets, classes, m\'e9thodes, encapsulation, polymorphisme, ...<br>Bien que nous vous garantissons les bases pour programmer de fa\'e7on autonome<br>dans le langage Java, ce cours&nbsp; se concentre avant tout sur les concepts de programmation, plut\'f4t que sur les d\'e9tails du langage lui-m\'eame.&nbsp;&nbsp;<br>Ainsi, apr\'e8s avoir suivi ce cours, vous devriez \'e9galement pouvoir<br>facilement aborder par vous-m\'eames de nouveaux langages de<br>programmation.<br><br><br>Il est la continuation logique du cours d'introduction&nbsp;<a href=\\"https://www.coursera.org/course/initprogjava\\">\'abInitiation \'e0 la programmation (en Java)\'bb</a>.<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 6 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3055"),\
    "id" : "2295",\
    "shortName" : "cloudnetworking",\
    "name" : "Cloud Networking",\
    "url" : "https://www.coursera.org/course/cloudnetworking",\
    "about" : [ \
        "<p>In the cloud networking course, we will see what the network needs to do to enable cloud computing. We will explore current practice by <strong>talking to leading industry experts</strong>, as well as looking into <strong>interesting new research</strong> that might shape the cloud network\'92s future.</p>\\n\\n<p>This course will allow us to explore <strong>in-depth the challenges for cloud networking</strong>\'97how do we build a network infrastructure that provides the agility to deploy virtual networks on a shared infrastructure, that enables both efficient transfer of big data and low latency communication, and that enables applications to be federated across countries and continents? Examining how these objectives are met will set the stage for the rest of the course. </p>\\n\\n<p>This course places an emphasis on both <strong>operations and design rationale</strong>\'97i.e., how things work and why they were designed this way. We're excited to start the course with you and take a look inside what has become the <strong>critical communications infrastructure</strong> for many applications today.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "cloud computing", \
        "cloud networking", \
        "networking"\
    ]\
\}\
\
/* 7 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305a"),\
    "id" : "1872",\
    "shortName" : "initprogcpp",\
    "name" : "Initiation \'e0 la programmation (en C++)",\
    "url" : "https://www.coursera.org/course/initprogcpp",\
    "about" : [ \
        "Ce cours pr\'e9sente des concepts de base de la programmation tels que&nbsp;&nbsp; : variables, expressions, structures de contr\'f4le, fonctions/m\'e9thodes, ...<br>en les illustrant dans la syntaxe du langage C++.<br><br>Ces notions simples seront pratiqu\'e9es de fa\'e7on intensive pour vous faire r\'e9aliser de fa\'e7on de plus en plus autonome&nbsp; les \'e9tapes allant de la conception d'un programme (algorithme) \'e0 sa mise en oeuvre concr\'e8te.<br><br>Ce cours est con\'e7u pour \'eatre prolong\'e9 par les aspects orient\'e9-objet, pr\'e9sent\'e9s dans le cours&nbsp;&nbsp;<a href=\\"https://www.coursera.org/course/intropoocpp\\">\'abIntroduction \'e0 la programmation orient\'e9e objet (en C++)\'bb</a>.&nbsp;<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 8 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305b"),\
    "id" : "1354",\
    "shortName" : "pythonlearn",\
    "name" : "Programming for Everybody (Python)",\
    "url" : "https://www.coursera.org/course/pythonlearn",\
    "about" : [ \
        "This course is specifically designed to be a first programming course using the popular Python programming language. The pace of the course is designed to lead to mastery of each of the topics in the class. We will use simple data analysis as the programming exercises through the course. Understanding how to process data is valuable for everyone regardless of your career. This course might kindle an interest in more advanced programming courses or courses in web design and development or just provide skills when you are faced with a bunch of data that you need to analyze.&nbsp;You can do the programming assignments for the class using a web browser or using your personal computer. All required software for the course is free.&nbsp;"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "python"\
    ]\
\}\
\
/* 9 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3060"),\
    "id" : "228",\
    "shortName" : "digitalmedia",\
    "name" : "Creative Programming for Digital Media & Mobile Apps",\
    "url" : "https://www.coursera.org/course/digitalmedia",\
    "about" : [ \
        "This course will teach you how to develop and apply programming skills to creative work. This is an important skill within the development of creative mobile applications, digital music and video games. It will teach technical skills needed to write software that make use of images, audio and graphics, and will concentrate on the\'a0application of these skills to creative projects.\'a0  Additional resources will be provided for students with no programming background.<br><br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "mobile development"\
    ]\
\}\
\
/* 10 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3059"),\
    "id" : "3049",\
    "shortName" : "clustering",\
    "name" : "Clustering Biological Data (Bioinformatics V)",\
    "url" : "https://www.coursera.org/course/clustering",\
    "about" : [ \
        "One of the first organisms to be domesticated by humans was yeast. Saccharomyces&nbsp;yeast is remarkable because it can not only convert the glucose in grapes into ethanol (which we then consume as wine), but it can also invert its own metabolism, consuming the ethanol it just produced in a process called the diauxic shift. &nbsp;To find genes implicated in the diauxic shift, we will learn about&nbsp;<strong>clustering algorithms </strong>that will divide&nbsp;yeast genes into distinct groups based on their patterns of regulatory behavior.<br><br>A similar method can be applied to distinguish normal and tumor cells, an approach that led to diagnostic tests like MammaPrint for predicting the return of cancer after chemotherapy.<br><br>We can also apply clustering algorithms to identify the genetic foundation of human population structure and discover which populations have contributed to your own genome. To do so, we will need to power up the clustering algorithms we encounter using a powerful computational approach called&nbsp;<strong>principal component analysis</strong>.<div><br></div><br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "bioinformatics", \
        "data mining"\
    ]\
\}\
\
/* 11 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3066"),\
    "id" : "2058",\
    "shortName" : "surveillance",\
    "name" : "Surveillance Law",\
    "url" : "https://www.coursera.org/course/surveillance",\
    "about" : [ \
        "<p>It\'92s easy to be\\ncynical about government surveillance. In recent years, a parade of Orwellian\\ndisclosures have been making headlines. The FBI, for example, is <a href=\\"http://www.wired.com/2013/09/freedom-hosting-fbi/\\">hacking into\\ncomputers</a> <a href=\\"http://www.wired.com/2014/08/operation_torpedo/\\">that run anonymizing software</a>. The NSA is <a href=\\"http://www.theguardian.com/world/2013/jun/06/nsa-phone-records-verizon-court-order\\">vacuuming up domestic phone\\nrecords</a>. Even local police departments are getting in on the act, <a href=\\"http://www.usatoday.com/story/news/nation/2013/12/08/cellphone-data-spying-nsa-police/3902809/\\">tracking cellphone location history and intercepting signals in realtime</a>.</p>\\n\\n<p>Perhaps 2014 is\\nnot quite 1984, though. This course explores how American law facilitates electronic\\nsurveillance\'97but also substantially constrains it. You will learn the legal\\nprocedures that police and intelligence agencies have at their disposal, as well as the security\\nand privacy safeguards built into those procedures. The material also provides\\nbrief, not-too-geeky technical explanations of some common surveillance\\nmethods.</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "security", \
        "cyber security"\
    ]\
\}\
\
/* 12 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3065"),\
    "id" : "1383",\
    "shortName" : "cryptography",\
    "name" : "Cryptography",\
    "url" : "https://www.coursera.org/course/cryptography",\
    "about" : [ \
        "<span><p>Historically, cryptography was used to ensure private communication between two people with some prior relationship. More recently, its scope has expanded to include things as diverse as data integrity, secure internet-wide communication, electronic cash, secure distributed computation, and more.</p><p>Cryptography has also become ubiquitous. Perhaps unknowingly, we have all encountered applications of cryptography in our daily lives---whether by logging in using a password, making a web purchase over a secure connection, or applying a software update that is digitally signed.</p>This course will introduce you to the foundations of modern cryptography, with an eye toward practical applications. We will learn the importance of carefully defining security; of relying on a set of well-studied \'93hardness assumptions\'94 (e.g., the hardness of factoring large numbers); and of the possibility of proving security of complicated constructions based on low-level primitives. We will not only cover these ideas in theory, but will also explore their real-world impact. You will learn about cryptographic primitives in wide use today, and see how these can be combined to develop modern protocols for secure communication.</span>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "security", \
        "cyber security", \
        "computer security"\
    ]\
\}\
\
/* 13 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306a"),\
    "id" : "60",\
    "shortName" : "programming1",\
    "name" : "Learn to Program: The Fundamentals",\
    "url" : "https://www.coursera.org/course/programming1",\
    "about" : [ \
        "A computer program is a set of instructions for a computer to follow, just as a recipe is a set of instructions for a chef. Laptops, kitchen appliances, MP3 players, and many other electronic devices all run computer programs. Programs have been written to manipulate sound and video, write poetry, run banking systems, predict the weather, and analyze athletic performance. This course is intended for people who have never seen a computer program. It will give you a better understanding of how computer applications work and teach you how to write your own applications. More importantly, you\'92ll start to learn computational thinking, which is a fundamental approach to solving real-world problems. Computer programming languages share common fundamental concepts, and this course will introduce you to those concepts using the Python programming language. By the end of this course, you will be able to write your own programs to process data from the web and create interactive text-based games."\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "python"\
    ],\
    "level" : 1\
\}\
\
/* 14 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3064"),\
    "id" : "106",\
    "shortName" : "datasci",\
    "name" : "Introduction to Data Science",\
    "url" : "https://www.coursera.org/course/datasci",\
    "about" : [ \
        "Commerce and research are being transformed by data-driven discovery and\\nprediction. Skills required for data analytics at massive levels \'96 scalable\\ndata management on and off the cloud, parallel algorithms, statistical\\nmodeling, and proficiency with a complex ecosystem of tools and platforms\\n\'96 span a variety of disciplines and are not easy to obtain through conventional\\ncurricula. Tour the basic techniques of data science, including both SQL\\nand NoSQL solutions for massive data management (e.g., MapReduce and contemporaries),\\nalgorithms for data mining (e.g., clustering and association rule mining),\\nand basic statistical modeling (e.g., linear and non-linear regression).<br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "nosql", \
        "databases", \
        "sql"\
    ]\
\}\
\
/* 15 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306e"),\
    "id" : "2396",\
    "shortName" : "hcidesign",\
    "name" : "Human-Computer Interaction Design",\
    "url" : "https://www.coursera.org/course/hcidesign",\
    "about" : [ \
        "In this course, you will learn how to design technologies that bring people joy, rather than frustration. You'll learn several techniques for rapidly prototyping and evaluating multiple interface alternatives -- and why rapid prototyping and comparative evaluation are essential to excellent interaction design. You'll learn how to conduct fieldwork with people to help you get design ideas. How to make paper prototypes and low-fidelity mock-ups that are interactive -- and how to use these designs to get feedback from other stakeholders like your teammates, clients, and users. You'll learn principles of visual design so that you can effectively organize and present information with your interfaces. You'll learn principles of perception and cognition that inform effective interaction design. And you'll learn how to perform and analyze controlled experiments online. In many cases, we'll use Web design as the anchoring domain. A lot of the examples will come from the Web, and we'll talk just a bit about Web technologies in particular. When we do so, it will be to support the main goal of this course, which is helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology."\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "machine learning", \
        "databases", \
        "sql"\
    ]\
\}\
\
/* 16 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306f"),\
    "id" : "2758",\
    "shortName" : "principlescomputing1",\
    "name" : "Principles of Computing (Part 1)",\
    "url" : "https://www.coursera.org/course/principlescomputing1",\
    "about" : [ \
        "This two-part course (part 2 is available <a href=\\"https://www.coursera.org/course/principlescomputing2\\">here</a>) introduces the basic mathematical and programming principles that underlie much of Computer Science. Understanding these principles is crucial to the process of creating efficient and well-structured solutions for computational problems.\\n<p></p><p>\\nTo get hands-on experience working with these concepts, we will use the Python programming language. The main focus of the class will be weekly mini-projects that build upon the mathematical and programming principles that are taught in the class. To keep the class fun and engaging, many of the projects will involve working with strategy-based games.</p><p></p><p>\\nAfter completing this course, you will have a much stronger background in Computer Science and be capable of writing Python programs that are both efficient and well-structured. You will also have a better understanding of how to approach more complex computational problems. As always, our goal is to teach these principles of computing in a fun and exciting way. We look forward to seeing you in class!</p>"\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "python"\
    ]\
\}\
\
/* 17 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306b"),\
    "id" : "117",\
    "shortName" : "proglang",\
    "name" : "Programming Languages",\
    "url" : "https://www.coursera.org/course/proglang",\
    "about" : [ \
        "<p>Learn many of the concepts that underlie all programming languages. Use functional programming and contrast it with\\nobject-oriented programming. Through experience writing programs and studying\\nthree different languages, learn the key issues in designing and using\\nprogramming languages, such as modularity and the complementary benefits\\nof static and dynamic typing. This course is neither particularly theoretical\\nnor just about programming specifics \'96 it will give you a framework for\\nunderstanding how to use language constructs effectively and how to design\\ncorrect and elegant programs. By using different languages, you learn to\\nthink more deeply than in terms of the particular syntax of one language.\\nThe emphasis on functional programming is essential for learning how to\\nwrite robust, reusable, composable, and elegant programs \'96 in any language.\\n</p>\\n<p>\\nBeginning with the Fall 2014 offering, verified certificates are available for this course.  The certificates look slightly different than for courses from other institutions.  <a href=\\"https://drive.google.com/file/d/0B5sUgbs6aDNpbE1DQXV2MVdUS1k/view?usp=sharing\\">Here is an example.</a>\\n</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "ruby"\
    ]\
\}\
\
/* 18 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3070"),\
    "id" : "2820",\
    "shortName" : "ads1",\
    "name" : "Algorithms for DNA Sequencing",\
    "url" : "https://www.coursera.org/course/ads1",\
    "about" : [ \
        "DNA sequencing is now a ubiquitous tool in life science. You can observe this trend&nbsp;<a href=\\"http://www.newyorker.com/magazine/2014/07/21/one-of-a-kind-2\\">just</a>&nbsp;<a href=\\"http://www.nytimes.com/2014/10/23/science/research-humans-interbred-with-neanderthals.html\\">by</a>&nbsp;<a href=\\"http://www.nytimes.com/2013/06/27/science/studying-tumors-differently-in-hopes-of-outsmarting-them.html\\">reading</a>&nbsp;<a href=\\"http://www.economist.com/node/21560523\\">the</a>&nbsp;<a href=\\"http://phenomena.nationalgeographic.com/2013/02/06/you-have-46-chromsomes-this-pond-creature-has-15600/\\">news</a>. This course examines the computational problems that come with this onslaught of DNA sequencing data. How do we take a huge collection of DNA \\"puzzle pieces\\" and assemble them into a genome? How do we make it quick and easy to find a DNA \\"needle\\" in an enormous genomic \\"haystack\\"? We will spend the bulk of the course understanding the algorithms and data structures that underlie software tools for analyzing sequencing data. The course is also an opporunity to practice programming skills and gain exposure to basic algorithms and data structures."\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "data mining", \
        "python"\
    ]\
\}\
\
/* 19 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3075"),\
    "id" : "2858",\
    "shortName" : "assembly",\
    "name" : "Assembling Genomes and Sequencing Antibiotics (Bioinformatics II)",\
    "url" : "https://www.coursera.org/course/assembly",\
    "about" : [ \
        "In \\"<a href=\\"http://coursera.org/course/bioinformatics\\" target=\\"_blank\\">Finding Hidden Messages in DNA</a>\\", we discussed how to separate some of the signal from the apparent noise of DNA sequences. &nbsp;But how do we know what the DNA sequence making up a genome is in the first place? &nbsp;After all, DNA nucleotides are far too small to view with a normal microscope, and biologists still do not possess technology that would read all the nucleotides of your genome from beginning to end.<br><br>In the first chapter of this course, we will see that entire genomes are assembled from millions of short overlapping pieces of DNA. &nbsp;The scale of this problem (the human genome is 3 billion nucleotides long!) implies that computers must be involved. Yet the problem is even more complex than it may appear ... to solve it, we will need to travel back in time to meet three famous mathematicians, and learn about algorithms based on <strong>graph theory</strong>.<br><br>In the second chapter of the course, we will consider antibiotics, which are mini-proteins engineered by bacteria to fight each other. Determining the sequence of amino acids making up an antibiotic is an important problem for medical research, but the practical barriers to sequencing an antibiotic containing just 10 amino acids are often more substantial than the limitations when assembling a genome with 10 million nucleotides! To decode the amino acid sequence of an antibiotic, biologist must blast many copies of this antibiotic into pieces and use an expensive molecular scale to weigh the resulting fragments. It may not seem possible that we can determine an antibiotic just from the masses of these fragments, but we will see that <strong>brute force algorithms</strong> will often succeed.<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 20 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3078"),\
    "id" : "2505",\
    "shortName" : "cloudcomputing2",\
    "name" : "Cloud Computing Concepts: Part 2",\
    "url" : "https://www.coursera.org/course/cloudcomputing2",\
    "about" : [ \
        "<p>Cloud computing systems today, whether open-source or used inside companies, are built using a common set of <strong>core techniques, algorithms, and design philosophies</strong>\'97all centered around distributed systems. Learn about such fundamental distributed computing \\"concepts\\" for cloud computing. </p>\\n\\n<p>Some of these concepts include:</p>\\n<ul>\\n<li>Clouds, MapReduce, key-value stores</li>\\n<li>Classical precursors</li>\\n<li>Widely-used algorithms</li>\\n<li>Classical algorithms </li>\\n<li>Scalability</li>\\n<li>Trending areas</li>\\n<li>And more!</li></ul><p>Understand&nbsp;<strong>how these techniques work</strong>&nbsp;inside today\'92s most widely-used cloud computing systems. Get your hands dirty using these concepts with provided homework exercises. In the&nbsp;<strong>optional programming track</strong>, implement some of these concepts in template assignments provided in C++ programming language.<br></p><p>You will also watch interviews with leading managers and researchers, from both industry and academia.</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "cloud computing", \
        "virtualization"\
    ]\
\}\
\
/* 21 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3074"),\
    "id" : "9",\
    "shortName" : "crypto",\
    "name" : "Cryptography I",\
    "url" : "https://www.coursera.org/course/crypto",\
    "about" : [ \
        "<p>Cryptography is an indispensable tool for protecting information in computer systems. This course explains the inner workings of cryptographic primitives and how to correctly use them. Students will learn how to reason about the security of cryptographic constructions and how to apply this knowledge to real-world applications. The course begins with a detailed discussion of how two parties who have a shared secret key can communicate securely when a powerful adversary eavesdrops and tampers with traffic. We will examine many deployed protocols and analyze mistakes in existing systems. The second half of the course discusses public-key techniques that let two or more parties generate a shared secret key. We will cover the relevant number theory and discuss public-key encryption and basic key-exchange.&nbsp;Throughout the course students will be exposed to many exciting open problems in the field.</p>\\n<p>The course will include written homeworks and programming labs. The course is self-contained, however it will be helpful to have a basic understanding of discrete probability theory.</p><p>A preview of the course, including lectures and homework assignments, is available at this <a href=\\"https://class.coursera.org/crypto-preview\\" target=\\"_blank\\">preview site</a>.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "cryptography", \
        "security", \
        "cyber security"\
    ]\
\}\
\
/* 22 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3067"),\
    "id" : "116",\
    "shortName" : "progfun",\
    "name" : "Functional Programming Principles in Scala",\
    "url" : "https://www.coursera.org/course/progfun",\
    "about" : [ \
        "This course introduces the cornerstones of functional programming using the Scala programming language. Functional programming has become more and more popular in recent years because it promotes code that\'92s safe, concise, and elegant. Furthermore, functional programming makes it easier to write parallel code for today\'92s and tomorrow\'92s multiprocessors by replacing mutable variables and loops with powerful ways to define and compose functions. <br><br> Scala is a language that fuses functional and object-oriented programming in a practical package. It interoperates seamlessly with Java and its tools. Scala is now used in a rapidly increasing number of open source projects and companies. It provides the core infrastructure for sites such as Twitter, LinkedIn, Foursquare, Tumblr, and Klout. <br><br> In this course you will discover the elements of the functional programming style and learn how to apply them usefully in your daily programming tasks. You will also develop a solid foundation for reasoning about functional programs, by touching upon proofs of invariants and the tracing of execution symbolically. <br><br> The course is hands on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series of assignments, most of which are also programming projects."\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "scala"\
    ]\
\}\
\
/* 23 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306c"),\
    "id" : "1306",\
    "shortName" : "devdataprod",\
    "name" : "Developing Data Products",\
    "url" : "https://www.coursera.org/course/devdataprod",\
    "about" : [ \
        "A data product is the production output from a statistical analysis. Data products automate complex analysis tasks or use technology to expand the utility of a data informed model, algorithm or inference. This course covers the basics of creating data products using Shiny, R packages, and interactive graphics. The course will focus on the statistical fundamentals of creating a data product that can be used to tell a story about data to a mass audience."\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "data mining", \
        "r"\
    ]\
\}\
\
/* 24 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307a"),\
    "id" : "129",\
    "shortName" : "hetero",\
    "name" : "Heterogeneous Parallel Programming",\
    "url" : "https://www.coursera.org/course/hetero",\
    "about" : [ \
        "<p>All computing\\nsystems, from mobile to supercomputers, are becoming heterogeneous, massively\\nparallel&nbsp;computers for higher power efficiency and&nbsp;computation\\nthroughput. While the computing community is racing to build tools and\\nlibraries to&nbsp;ease the use of these systems, effective and confident\\nuse&nbsp;of these systems will always require knowledge about low-level\\nprogramming&nbsp;in these systems. This course is designed for students to\\nlearn the essence&nbsp;of low-level programming interfaces and how to use these\\ninterfaces to achieve application goals. CUDA C, with its good balance between\\nuser control and verboseness, will serve as the teaching vehicle for the first\\nhalf of the course. Students will then extend their learning into closely\\nrelated programming interfaces such as OpenCL, OpenACC, and C++AMP.</p>\\n\\n<p><span><br>\\nThe course is unique in that it is application oriented and only introduces the\\nnecessary&nbsp;underlying computer science and computer engineering knowledge for\\nunderstanding.&nbsp;It covers the concept of data parallel execution models,\\nmemory models for managing locality, tiling techniques for reducing bandwidth\\nconsumption, parallel algorithm patterns,&nbsp;overlapping computation with\\ncommunication, and a variety of\\nheterogeneous parallel programming interfaces. The concepts learned in this\\ncourse form a strong foundation for learning other types of parallel\\nprogramming systems.</span></p>\\n\\n<br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "c", \
        "c++"\
    ]\
\}\
\
/* 25 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3079"),\
    "id" : "13",\
    "shortName" : "cs101",\
    "name" : "Computer Science 101",\
    "url" : "https://www.coursera.org/course/cs101",\
    "about" : [ \
        "<p><strong>UPDATE</strong>: we're doing a live, updated MOOC of this course at stanford-online July-2014 (not this Coursera version). See here: <a title=\\"Link: http://cs101.class.stanford.edu\\" target=\\"_blank\\" href=\\"http://cs101.class.stanford.edu\\">http://cs101.class.stanford.edu/</a> <br></p><p>CS101 teaches the essential ideas of Computer Science for a zero-prior-experience audience. Computers can appear very complicated, but in reality, computers work within just a few, simple patterns. CS101 demystifies and brings those patterns to life, which is useful for anyone using computers today.</p>\\n<p>In CS101, students play and experiment with short bits of \\"computer code\\" to bring to life to the power and limitations of computers. Everything works within the browser, so there is no extra software to download or install. CS101 also provides a general background on computers today: what is a computer, what is hardware, what is software, what is the internet. No previous experience is required other than the ability to use a web browser.</p>\\n<p>Here is&nbsp;<a target=\\"_blank\\" href=\\"http://www.youtube.com/watch?v=A9pMbRKq8Ro\\">another video</a>&nbsp;Nick created for this class.<strong></strong></p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "computer software"\
    ]\
\}\
\
/* 26 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305e"),\
    "id" : "2755",\
    "shortName" : "interactivepython1",\
    "name" : "An Introduction to Interactive Programming in Python (Part 1)",\
    "url" : "https://www.coursera.org/course/interactivepython1",\
    "about" : [ \
        "This two-part course (part 2 is available <a href=\\"https://www.coursera.org/course/interactivepython2\\">here</a>)  is designed to help students with very little or no computing background learn the basics of building simple interactive applications. Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera. To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple. These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse.<p></p><p>The primary method for learning the course material will be to work through multiple \\"mini-projects\\" in Python. To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you\'92ve finished our course, we can\'92t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you\'92re doing it.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "python"\
    ]\
\}\
\
/* 27 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3063"),\
    "id" : "443",\
    "shortName" : "chuck101",\
    "name" : "Introduction to Programming for Musicians and Digital Artists",\
    "url" : "https://www.coursera.org/course/chuck101",\
    "about" : [ \
        "<p>The course, lecture, and examples build on each other to teach the fundamentals\\n    of programming in general (logic, loops, functions, objects, classes) and\\n    also deals with advanced topics including multi-threading, events and signals.\\n    \'a0Throughout the course, students create meaningful and rewarding expressive\\n    digital \'93instruments\'94 that make sound and music in direct response to program\\n    logic.\'a0 The ChucK language provides precise high-level control over\\n    time, audio computation, and user interface elements (track pad, joysticks,\\n    etc.). \'a0ChucK is used (unknowingly in most cases, via SMule Apps)\\n    by millions of users throughout the world, and is the backbone of dozens\\n    of academic programs and laptop orchestras. \'a0Learning to program using\\n    ChucK, through the musical examples provided in this course, will prepare\\n    students to program in C++, Java, and other languages. There will be special\\n    guest lectures from creators of the ChucK language, Dr.\'a0Ge Wang (Stanford\\n    University) and Dr. Perry R.\'a0Cook (Princeton University).</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "c++"\
    ]\
\}\
\
/* 28 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3068"),\
    "id" : "2954",\
    "shortName" : "sdn1",\
    "name" : "Software Defined Networking",\
    "url" : "https://www.coursera.org/course/sdn1",\
    "about" : [ \
        "<p>This course introduces software defined networking, an emerging paradigm in computer networking that allows a logically centralized software program to control the behavior of an entire network. &nbsp;</p><p>Separating a network's control logic from the underlying physical routers and switches that forward traffic allows network operators to write high-level control programs that specify the behavior of an entire network, in contrast to conventional networks, whereby network operators must codify functionality in terms of low-level device configuration. &nbsp;</p><p>Logically centralized network control makes it possible for operators to specify more complex tasks that involve integrating many disjoint network functions (e.g., security, resource control, prioritization) into a single control framework, allowing network operators to create more sophisticated policies, and making network configurations easier to configure, manage, troubleshoot, and debug.&nbsp;</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "c++"\
    ]\
\}\
\
/* 29 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b306d"),\
    "id" : "2307",\
    "shortName" : "cloudapplications",\
    "name" : "Cloud Computing Applications",\
    "url" : "https://www.coursera.org/course/cloudapplications",\
    "about" : [ \
        "<p>Learn of \\"<strong>cloudonomics</strong>,\\" the underlying economic reasons that we are creating the cloud. Learn the <strong>basic concepts underlying cloud services</strong> and be able to use services like AWS or OpenStack Dashboard to construct cloud services or applications. <strong>Demonstrate your ability</strong> to create web services, massively parallel data intensive computations using Map/Reduce, NoSQL databases, and real-time processing of real-time data streams. Use machine learning tools to solve simple problems.</p>\\n\\n<p>This course serves as an introduction to building applications for cloud computing based on <strong>emerging OpenStack</strong> and other platforms. The course includes concepts of:</p>\\n<ul>\\n<li>Baremetal provisioning</li>\\n<li>Neutron networking</li>\\n<li>Identity service</li>\\n<li>Image service</li>\\n<li>Orchestration</li>\\n<li>Infrastructure as a service</li>\\n<li>Software as a service</li>\\n<li>Platform as a service</li>\\n<li>MapReduce</li>\\n<li>Big data</li>\\n<li>Analytics</li>\\n<li>Privacy and legal issues</li>\\n</ul>\\n\\n<p>The course will also include example problems and solutions to cloud computing, including <strong>hands-on laboratory experiments</strong> (Load Balancing and Web Services, MapReduce, Hive, Storm, and Mahout). <strong>Case studies</strong> will be drawn from Yahoo, Google, Twitter, Facebook, data mining, analytics, and machine learning.<br></p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "cloud computing"\
    ]\
\}\
\
/* 30 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3072"),\
    "id" : "2300",\
    "shortName" : "clusteranalysis",\
    "name" : "Cluster Analysis in Data Mining",\
    "url" : "https://www.coursera.org/course/clusteranalysis",\
    "about" : [ \
        "<p>Discover the <strong>basic concepts of cluster analysis</strong>, and then study a set of typical clustering methodologies, algorithms, and applications. This includes <strong>partitioning methods</strong> such as k-means, <strong>hierarchical methods</strong> such as BIRCH, <strong>density-based methods</strong> such as DBSCAN/OPTICS, probabilistic models, and the EM algorithm. Learn clustering and methods for clustering high dimensional data, streaming data, graph data, and networked data. Explore concepts and methods for constraint-based clustering and semi-supervised clustering. Finally, see <strong>examples of cluster analysis in applications</strong>.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "data mining"\
    ]\
\}\
\
/* 31 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307c"),\
    "id" : "1874",\
    "shortName" : "intropoocpp",\
    "name" : "Introduction \'e0 la programmation orient\'e9e objet (en C++)",\
    "url" : "https://www.coursera.org/course/intropoocpp",\
    "about" : [ \
        "Pr\'e9sentation et mise en pratique en C++ des concepts de base de la programmation orient\'e9e objet&nbsp;: objets, classes, m\'e9thodes, encapsulation, polymorphisme, ...<br><br>Bien que nous vous garantissons les bases pour programmer de fa\'e7on autonome dans le langage C++, ce cours&nbsp; se concentre avant tout sur les concepts de programmation, plut\'f4t que sur les d\'e9tails du langage lui-m\'eame.&nbsp;&nbsp;<br>Ainsi, apr\'e8s avoir suivi ce cours, vous devriez \'e9galement pouvoir<br>facilement aborder par vous-m\'eames de nouveaux langages de<br>programmation.<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 32 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3071"),\
    "id" : "3050",\
    "shortName" : "mutations",\
    "name" : "Finding Mutations in DNA and Proteins (Bioinformatics VI)",\
    "url" : "https://www.coursera.org/course/mutations",\
    "about" : [ \
        "Although biologists assembled a reference human genomes in 2001, your own genome differs from this reference genome by millions of mutations. In this chapter, we will learn <strong>combinatorial pattern matching</strong> algorithms for finding these mutations, something that future doctors will be able to do within minutes in order to find disease genes.<strong><br></strong><br>We will then examine the problem of detecting subtle similarities that evade the traditional sequence comparison algorithms that we studied in \\"<a href=\\"http://coursera.org/course/comparinggenomes\\" target=\\"_blank\\" title=\\"Link: http://coursera.org/course/comparinggenomes\\">Comparing Genes, Genomes, and Proteins</a>\\".&nbsp;Having efficient algorithms for comparing highly diverged sequences is important, since a single misaligned nucleotide can misclassify a protein and prevent biologists from inferring its function. &nbsp;We will consider a popular approach to sequence comparison based on an abstract machine called a <strong>Hidden Markov Model</strong>.<strong><br></strong><strong></strong>"\
    ],\
    "__v" : 0\
\}\
\
/* 33 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307e"),\
    "id" : "1616",\
    "shortName" : "bioinformatics2",\
    "name" : "Bioinformatics Algorithms (Part 2) ",\
    "url" : "https://www.coursera.org/course/bioinformatics2",\
    "about" : [ \
        "<p>This course is the second in a two-part series that begins with <a href=\\"http://coursera.org/course/bioinformatics\\" target=\\"_blank\\">Bioinformatics Algorithms (Part 1)</a>. &nbsp;It will build upon the biological and computational material covered in the first course to cover additional topics in modern computational biology.</p><p>The format for this course will be the same as that of Part 1. Each chapter of course material will cover a single biological question and slowly build the algorithmic knowledge required to address this challenge. &nbsp;Along the way, coding challenges and exercises (many of which ask you to apply your skills to real&nbsp;genetic data) will be directly integrated into the text at the exact moment they are needed.</p>"\
    ],\
    "__v" : 0\
\}\
\
/* 34 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3083"),\
    "id" : "1371",\
    "shortName" : "nand2tetris1",\
    "name" : "From Nand to Tetris / Part I",\
    "url" : "https://www.coursera.org/course/nand2tetris1",\
    "about" : [ \
        "<strong>This course is a fascinating 7-week voyage of discovery</strong>&nbsp;in which you will go all the way from Boolean algebra and elementary logic gates to building a central processing unit, a memory system, and a hardware platform, leading up to a general-purpose computer that can run any program that you fancy. In the process of building this computer you will become familiar with many important hardware abstractions, and you will implement them, hands on. But most of all, you will enjoy the tremendous thrill of building a complex and useful system from the ground up.<br><strong><br>You will build all the&nbsp;hardware modules</strong>&nbsp;on your home&nbsp;computer, using a Hardware Description Language&nbsp;(HDL), learned in the course, and a&nbsp;hardware simulator, supplied by us. A hardware simulator is a software system that enables building and simulating gates and chips before actually committing them to silicon. This is exactly what hardware engineers do in practice: they build and test computers in simulation, using HDL and hardware simulators."\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "computer architecture"\
    ]\
\}\
\
/* 35 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3088"),\
    "id" : "39",\
    "shortName" : "digitaldemocracy",\
    "name" : "Securing Digital Democracy",\
    "url" : "https://www.coursera.org/course/digitaldemocracy",\
    "about" : [ \
        "Computer technology has transformed how we participate in democracy. The way we cast our votes, the way our votes are counted, and the way we choose who will lead are increasingly controlled by invisible computer software. Most U.S. states have adopted electronic voting, and countries around the world are starting to collect votes over the Internet. However, computerized voting raises startling security risks that are only beginning to be understood outside the research lab, from voting machine viruses that can silently change votes to the possibility that hackers in foreign countries could steal an election. This course will provide the technical background and public policy foundation that 21st century citizens need to understand the electronic voting debate. You'll learn how electronic voting and Internet voting technologies work, why they're being introduced, and what problems they aim to solve. You'll also learn about the computer- and Internet-security risks these systems face and the serious vulnerabilities that recent research has demonstrated. We'll cover widely used safeguards, checks, and balances \'97 and why they are often inadequate. Finally, we'll see how computer technology has the potential to improve election security, if it's applied intelligently. Along the way, you'll hear stories from the lab and from the trenches on a journey that leads from Mumbai jail cells to the halls of Washington, D.C. You'll come away from this course understanding why you can be confident your own vote will count \'97 or why you should reasonably be skeptical."\
    ],\
    "__v" : 0\
\}\
\
/* 36 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308d"),\
    "id" : "103",\
    "shortName" : "inforiskman",\
    "name" : "Information Security and Risk Management in Context",\
    "url" : "https://www.coursera.org/course/inforiskman",\
    "about" : [ \
        "Explore the latest techniques for securing information and its systems, from policies and&nbsp;procedures to technologies and audit. Learn from leading experts who share proven practices&nbsp;in areas such as mobile workforce safety, security metrics, electronic evidence oversight and coping with e-crime and e-discovery. Study the protection of Cloud computing information. Discover&nbsp;how to foster the development of future information security leaders.<br><br>Topics covered include:<br>\\n<ul>\\n<li>Information security strategies and individual privacy</li>\\n<li>Legal security implications</li>\\n<li>Medical health record confidentiality and integrity</li>\\n<li>Cutting-edge technologies</li>\\n</ul>\\n<br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "security"\
    ]\
\}\
\
/* 37 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307d"),\
    "id" : "105",\
    "shortName" : "comnetworks",\
    "name" : "Computer Networks",\
    "url" : "https://www.coursera.org/course/comnetworks",\
    "about" : [ \
        "Computer networks from ISPs to WiFi and cellular networks are a key part\\nof the information economy. These networks are the foundation for the Web,\\nand they enable companies such as Google, Facebook and Amazon. This course\\nintroduces the fundamental problems of computer networking, from sending\\nbits over wires to running distributed applications. For each problem,\\nwe explore the design strategies that have proven valuable in practice.\\nTopics include error detection and correction, multiple-access, bandwidth\\nallocation, routing, internetworking, reliability, quality of service,\\nnaming, content delivery, and security. As we cover these topics, you will\\nlearn how the internals of the Internet work to support the Web and other\\nnetworked applications. You will develop a detailed understanding of widely-used\\nnetworking technologies such as TCP/IP, HTTP, 802.11, Ethernet, and DNS."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "networking", \
        "network design"\
    ]\
\}\
\
/* 38 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3082"),\
    "id" : "12",\
    "shortName" : "db",\
    "name" : "Introduction to Databases",\
    "url" : "https://www.coursera.org/course/db",\
    "about" : [ \
        "\\"Introduction to Databases\\" was one of Stanford's three inaugural massive open online courses in the fall of 2011; it was offered again in MOOC format in 2013 and 2014. Materials from the MOOC offerings have been available for self-study on Coursera as well as on other platforms. <strong>Starting in summer 2014, the materials are now being offered on the OpenEdX platform as a set of smaller self-paced \\"mini-courses\\", which can be assembled in a variety of ways to learn about different aspects of databases.</strong> All of the mini-courses are based around video lectures and/or video demos. Many of them include in-video quizzes to check understanding, in-depth standalone quizzes, and/or a variety of automatically-checked interactive programming exercises. Each mini-course also includes a discussion forum and pointers to readings and resources. Taught by Professor Jennifer Widom, the overall curriculum draws from Stanford's popular Databases course. <strong>To explore and enroll in the new Databases mini-courses, please visit</strong> <a title=\\"Link: https://class.stanford.edu/courses/DB/2014/SelfPaced/about\\" href=\\"https://class.stanford.edu/courses/DB/2014/SelfPaced/about\\">https://class.stanford.edu/courses/DB/2014/SelfPaced/about</a>."\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "databases", \
        "sql"\
    ]\
\}\
\
/* 39 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3089"),\
    "id" : "2856",\
    "shortName" : "hiddenmessages",\
    "name" : "Finding Hidden Messages in DNA (Bioinformatics I)",\
    "url" : "https://www.coursera.org/course/hiddenmessages",\
    "about" : [ \
        "<p>A genome may look like an incomprehensible string of the letters A, C, G, and T. Yet hidden in the three billion nucleotides of your genome is a secret language. This course offers an introduction to how we can start to understand this language by using algorithms to find hidden messages in DNA.<br></p><p>What do these hidden messages say? &nbsp;In the first chapter of the course, hidden DNA messages indicate where a bacterium starts replicating its genome, a problem with applications in bioengineering and beyond. In the second chapter, hidden DNA messages tell us how organisms know whether it is day or night as well as how the bacterium causing tuberculosis is able to hide from antibiotics. We will see how<strong> randomized algorithms</strong>, which toss coins\\nand roll dice, can be used to find these messages.</p>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nEach of the two central topics in the course builds the algorithmic knowledge required to address this challenge. Along the way, coding challenges and exercises, many of which ask you to apply your skills to real&nbsp;genetic data, will be directly integrated into the text at the exact moment they are needed."\
    ],\
    "__v" : 0\
\}\
\
/* 40 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308e"),\
    "id" : "2757",\
    "shortName" : "interactivepython2",\
    "name" : "An Introduction to Interactive Programming in Python (Part 2)",\
    "url" : "https://www.coursera.org/course/interactivepython2",\
    "about" : [ \
        "This two-part course (part 1 is available <a href=\\"https://www.coursera.org/course/interactivepython1\\">here</a>) is designed to help students with very little or no computing background learn the basics of building simple interactive applications. Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera. To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple. These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse.<p></p><p>The primary method for learning the course material will be to work through multiple \\"mini-projects\\" in Python. To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you\'92ve finished our course, we can\'92t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you\'92re doing it.</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "python"\
    ]\
\}\
\
/* 41 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3085"),\
    "id" : "2759",\
    "shortName" : "principlescomputing2",\
    "name" : "Principles of Computing (Part 2)",\
    "url" : "https://www.coursera.org/course/principlescomputing2",\
    "about" : [ \
        "This two-part course (part 1 is available <a href=\\"https://www.coursera.org/course/principlescomputing1\\">here</a>) introduces the basic mathematical and programming principles that underlie much of Computer Science. Understanding these principles is crucial to the process of creating efficient and well-structured solutions for computational problems.\\n<p></p><p>\\nTo get hands-on experience working with these concepts, we will use the Python programming language. The main focus of the class will be weekly mini-projects that build upon the mathematical and programming principles that are taught in the class. To keep the class fun and engaging, many of the projects will involve working with strategy-based games.</p><p></p><p>\\nAfter completing this course, you will have a much stronger background in Computer Science and be capable of writing Python programs that are both efficient and well-structured. You will also have a better understanding of how to approach more complex computational problems. As always, our goal is to teach these principles of computing in a fun and exciting way. We look forward to seeing you in class!</p>"\
    ],\
    "__v" : 0,\
    "skills" : [ \
        "python"\
    ],\
    "level" : 2\
\}\
\
/* 42 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308a"),\
    "id" : "2802",\
    "shortName" : "os",\
    "name" : "
\f1 \'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'d4\'ad\'c0\'ed\'a3\'a8
\f0 Operating Systems
\f1 \'a3\'a9
\f0 ",\
    "url" : "https://www.coursera.org/course/os",\
    "about" : [ \
        "<p>
\f1 \'c8\'ce\'ba\'ce\'bc\'c6\'cb\'e3\'bb\'fa\'b6\'bc\'b1\'d8\'d0\'eb\'d4\'da\'bc\'d3\'d4\'d8\'cf\'e0\'d3\'a6\'b5\'c4\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'d6\'ae\'ba\'f3\'a3\'ac\'b2\'c5\'c4\'dc\'b9\'b9\'b3\'c9\'d2\'bb\'b8\'f6\'bf\'c9\'d2\'d4\'d4\'cb\'d7\'aa\'b5\'c4\'a1\'a2\'cd\'ea\'d5\'fb\'b5\'c4\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'a1\'a3\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b5\'c4\'b9\'a6\'c4\'dc\'ca\'c7\'b7\'f1\'c7\'bf\'b4\'f3\'a3\'ac\'be\'f6\'b6\'a8\'c1\'cb\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'b5\'c4\'d7\'db\'ba\'cf\'c4\'dc\'c1\'a6\'a3\'bb\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b5\'c4\'d0\'d4\'c4\'dc\'b8\'df\'b5\'cd\'a3\'ac\'be\'f6\'b6\'a8\'c1\'cb\'d5\'fb\'b8\'f6\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'b5\'c4\'d0\'d4\'c4\'dc\'a3\'bb\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b1\'be\'c9\'ed\'b5\'c4\'b0\'b2\'c8\'ab\'bf\'c9\'bf\'bf\'b3\'cc\'b6\'c8\'a3\'ac\'be\'f6\'b6\'a8\'c1\'cb\'d5\'fb\'b8\'f6\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'b5\'c4\'b0\'b2\'c8\'ab\'d0\'d4\'ba\'cd\'bf\'c9\'bf\'bf\'d0\'d4\'a1\'a3\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'ca\'c7\'c8\'ed\'bc\'fe\'bc\'bc\'ca\'f5\'b5\'c4\'ba\'cb\'d0\'c4\'ba\'cd\'bb\'f9\'b4\'a1\'d4\'cb\'d0\'d0\'c6\'bd\'cc\'a8\'a1\'a3\'d2\'f2\'b4\'cb\'a3\'ac\'bc\'c6\'cb\'e3\'bb\'fa\'bf\'c6\'d1\'a7\'bc\'bc\'ca\'f5\'d7\'a8\'d2\'b5\'b5\'c4\'d1\'a7\'c9\'fa\'d0\'e8\'d2\'aa\'d1\'a7\'cf\'b0\'ba\'cd\'d5\'c6\'ce\'d5\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b5\'c4\'bb\'f9\'b1\'be\'d4\'ad\'c0\'ed\'ba\'cd\'d7\'a8\'d2\'b5\'d6\'aa\'ca\'b6\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'b5\'c4\'bd\'cc\'d1\'a7\'c4\'bf\'b1\'ea\'ca\'c7\'a3\'ba
\f0 </p>\\n\\n<p>1
\f1 \'a3\'ae\'d5\'c6\'ce\'d5\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b5\'c4\'bb\'f9\'b1\'be\'b8\'c5\'c4\'ee\'a1\'a2\'b9\'a6\'c4\'dc\'d7\'e9\'b3\'c9\'a1\'a2\'cf\'b5\'cd\'b3\'bd\'e1\'b9\'b9\'bc\'b0\'d4\'cb\'d0\'d0\'bb\'b7\'be\'b3\'a3\'bb
\f0 </p>\\n\\n<p>2
\f1 \'a3\'ae\'ca\'ec\'cf\'a4\'b2\'a2\'d4\'cb\'d3\'c3\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b9\'a4\'d7\'f7\'d4\'ad\'c0\'ed\'a1\'a2\'c9\'e8\'bc\'c6\'b7\'bd\'b7\'a8\'ba\'cd\'ca\'b5\'cf\'d6\'bc\'bc\'ca\'f5\'a3\'ac\'c0\'ed\'bd\'e2\'d3\'d0\'b4\'fa\'b1\'ed\'d0\'d4\'a1\'a2\'b5\'e4\'d0\'cd\'b5\'c4\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'ca\'b5\'c0\'fd\'a3\'a8\'c8\'e7
\f0 UNIX
\f1 \'a1\'a2
\f0 Linux
\f1 \'ba\'cd
\f0 Windows
\f1 \'a3\'a9\'a3\'bb
\f0 </p>\\n\\n3
\f1 \'a3\'ae\'c1\'cb\'bd\'e2\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b5\'c4\'d1\'dd\'bb\'af\'b9\'fd\'b3\'cc\'a1\'a2\'b7\'a2\'d5\'b9\'d1\'d0\'be\'bf\'b6\'af\'cf\'f2\'a1\'a2\'d0\'c2\'bc\'bc\'ca\'f5\'d2\'d4\'bc\'b0\'d0\'c2\'cb\'bc\'cf\'eb\'a3\'ac\'ce\'aa\'ba\'f3\'d0\'f8\'cf\'e0\'b9\'d8\'bf\'ce\'b3\'cc\'b5\'c4\'d1\'a7\'cf\'b0\'b4\'f2\'cf\'c2\'c1\'bc\'ba\'c3\'bb\'f9\'b4\'a1\'a3\'ac\'ce\'aa\'ba\'f3\'d0\'f8\'d6\'b0\'d2\'b5\'b7\'a2\'d5\'b9\'b5\'ec\'b6\'a8\'bb\'f9\'ca\'af\'a1\'a3
\f0 <br>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "operating system"\
    ]\
\}\
\
/* 43 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3091"),\
    "id" : "130",\
    "shortName" : "vlsicad",\
    "name" : "VLSI CAD:  Logic to Layout",\
    "url" : "https://www.coursera.org/course/vlsicad",\
    "about" : [ \
        "<div>A modern VLSI chip is a remarkably complex beast: &nbsp;billions of transistors, millions of logic gates deployed for computation and control, big blocks of memory, embedded blocks of pre-designed functions designed by third parties (called \'93intellectual property\'94 or IP blocks). &nbsp;How do people manage to design these complicated chips? &nbsp;Answer: &nbsp;a sequence of computer aided design (CAD) tools takes an abstract description of the chip, and refines it step-wise to a final design. This class focuses on the major design tools used in the creation of an Application Specific Integrated Circuit (ASIC) or System on Chip (SoC) design. &nbsp;Our focus is on the key representations that make it possible to synthesize, and to verify, these designs, as they move from logic to layout. &nbsp; <br><br>Our goal is for students to understand how the tools themselves work, at the level of their fundamental algorithms and data structures. You should be taking this course if (1) you are interested in building VLSI design tools; &nbsp;(2) you are interested in designing VLSI chips, and you want to know why the tools do what they do; &nbsp;(3) you just like cool algorithms, that work on big cool problems that involve bits, and gates, and geometry, and graphs, and matrices, and time, and...</div>"\
    ],\
    "__v" : 0\
\}\
\
/* 44 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3096"),\
    "id" : "1467",\
    "shortName" : "hciucsd",\
    "name" : "Human-Computer Interaction",\
    "url" : "https://www.coursera.org/course/hciucsd",\
    "about" : [ \
        "In this course, you will learn how to design technologies that bring people joy, rather than frustration. You'll learn several techniques for rapidly prototyping and evaluating multiple interface alternatives -- and why rapid prototyping and comparative evaluation are essential to excellent interaction design. You'll learn how to conduct fieldwork with people to help you get design ideas. How to make paper prototypes and low-fidelity mock-ups that are interactive -- and how to use these designs to get feedback from other stakeholders like your teammates, clients, and users. You'll learn principles of visual design so that you can effectively organize and present information with your interfaces. You'll learn principles of perception and cognition that inform effective interaction design. And you'll learn how to perform and analyze controlled experiments online. In many cases, we'll use Web design as the anchoring domain. A lot of the examples will come from the Web, and we'll talk just a bit about Web technologies in particular. When we do so, it will be to support the main goal of this course, which is helping you build human-centered design skills, so that you have the principles and methods to create excellent interfaces with any technology."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "machine learning", \
        "data mining"\
    ]\
\}\
\
/* 45 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3092"),\
    "id" : "1775",\
    "shortName" : "webgl",\
    "name" : "Interactive Computer Graphics with WebGL",\
    "url" : "https://www.coursera.org/course/webgl",\
    "about" : [ \
        "<p>OpenGL is the standard application programming interface\\n(API) to graphics systems for\\nboth education and industry. Recent advances in hardware and software have focussed application\\ndevelopment on the Web and for mobile devices such as smart phones. Over the past year there\\nhas been enormous interest in WebGL, the version of OpenGL that runs within Web browsers and even\\non newer smart phones. Consequently, for the first time both students and practitioners can\\ndevelop exciting three-dimensional interactive applications that are\\nindependent of the particular\\nplatform and can be accessed like any other Web application.</p>\\n\\n\\n\\n<p>In this course, we\\nwill learn how to create three-dimensional, interactive applications using\\nWebGL that run within the\\nlatest web browsers. By the end of the course, every student will have written\\nand tested a complete\\ninteractive three-dimensional application. Because WebGL is the JavaScript implementation of\\nOpenGL ES 2.0, all code will be developed in JavaScript. No prior knowledge of JavaScript is\\nrequired as long as participants can program in C++, C# or Java. The content of the\\ncourse will be based on the instructor's recent textbook (not required) and\\ncourse which is the first\\nuniversity course to use WebGL as the API.</p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "html", \
        "javascript", \
        "c++", \
        "c"\
    ]\
\}\
\
/* 46 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309b"),\
    "id" : "409",\
    "shortName" : "cplusplus4c",\
    "name" : "C++ For C Programmers",\
    "url" : "https://www.coursera.org/course/cplusplus4c",\
    "about" : [ \
        "The course provides an overview of C++ for the experienced C programmer. You will learn how C++ is more powerful than C. The C++ STL library will be featured. This library allows C++ programmers to code generically, efficiently and at a high level. You will learn how to write basic graph algorithms such as the shortest path algorithm. You'll then put this skill to use in a programming assignment aimed at producing an intelligent hex player.<br>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "c++", \
        "c"\
    ]\
\}\
\
/* 47 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3098"),\
    "id" : "2298",\
    "shortName" : "patterndiscovery",\
    "name" : "Pattern Discovery in Data Mining",\
    "url" : "https://www.coursera.org/course/patterndiscovery",\
    "about" : [ \
        "<p>Learn the <strong>general concepts of data mining</strong> along with basic methodologies and applications. Then dive into one subfield in data mining: <strong>pattern discovery</strong>. Learn in-depth concepts, methods, and applications of pattern discovery in data mining. We will also introduce methods for pattern-based classification and some interesting applications of pattern discovery. This course provides you the opportunity to learn skills and content to practice and engage in <strong>scalable pattern discovery methods</strong> on massive transactional data, discuss <strong>pattern evaluation measures</strong>, and study <strong>methods for mining</strong> diverse kinds of patterns, sequential patterns, and sub-graph patterns. </p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "data mining"\
    ]\
\}\
\
/* 48 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3097"),\
    "id" : "3048",\
    "shortName" : "molecularevolution",\
    "name" : "Deciphering Molecular Evolution (Bioinformatics IV)",\
    "url" : "https://www.coursera.org/course/molecularevolution",\
    "about" : [ \
        "Two landmark bioinformatics-related discoveries made headlines in 2003.&nbsp;<br><div><br></div><div>First, the deadly Severe Acute Respiratory Syndrome (SARS) virus caused panic as it swept around the globe in a few weeks. But where did SARS come from? By constructing an <strong>evolutionary tree</strong> of the unknown virus as well as viruses taken from other species, we can not only understand which animal gave us SARS, but also reconstruct its path around the globe. This is just one of many problems in modern biology related to constructing evolutionary trees.</div><div><br></div><div>Second, a team of biologists announced that some proteins had miraculously survived within a 68 million year old dinosaur fossil. Moreover, they concluded that the amino acid sequences of these dinosaur proteins were nearly identical to sequences in modern-day chickensl. Based on this discovery, famed paleontologist Jack Horner (who partly inspired the character of Dr. Grant from <em>Jurassic Park</em>) hopes to resurrect dinosaurs by genetically re-engineering a chicken. &nbsp;But did these peptides really come from T. rex, or do they represent statistical artifacts or contamination? To answer this question, we will need to explore the field of <strong>computational proteomics</strong>.</div>"\
    ],\
    "__v" : 0\
\}\
\
/* 49 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a0"),\
    "id" : "1504",\
    "shortName" : "interactivegraphics",\
    "name" : "Interactive Computer Graphics",\
    "url" : "https://www.coursera.org/course/interactivegraphics",\
    "about" : [ \
        "<div>Computer graphics can be a powerful tool for supporting visual problem solving, and interactivity plays a central role in harnessing the users' creativity. This course will introduce various interactive tools developed in computer graphics research field with their design rationales and algorithms. Examples include enhancements to graphical user interfaces, authoring tools for 2D drawings and 3D animations, and interactive computer-aided design systems. Rich live demonstrations and course assignments will give you insights and skills to design and implement such tools for your own problems.</div>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "css", \
        "html"\
    ]\
\}\
/* 0 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3094"),\
    "id" : "1250",\
    "shortName" : "career",\
    "name" : "Enhance Your Career and Employability Skills",\
    "url" : "https://www.coursera.org/course/career",\
    "about" : [ \
        "<p>This course is different to others. Unlike many\'a0Coursera courses\'a0which are discipline-specific,\\nthis MOOC would be complementary to any additional course of study as it\\nenables\'a0you to recognise your own strengths and skills and understand how\\nto best articulate those preferences and achievements to future employers or\\nacademic institutions in the future.</p><p>By the end of this course, you will be able to:</p>\\n\\n<ul>\\n <li>Understand\\n     the drivers behind your career preferences and choices</li>\\n <li>Identify\\n     the skills which you can offer and know your current skills gaps</li>\\n <li>Recognise\\n     opportunities for your career enhancement both within and beyond your\\n     current employer</li>\\n <li>Summarise\\nyour achievements and skills in appropriate formats for future employers\\n     or academic institutions</li>\\n <li>Perform\\n     effectively in a face-to-face encounter such as an interview or during a\\n     presentation</li><li>Extend and make most effective use of your professional\\nnetwork both on and off line</li></ul><span><br>Whichever stage you are at in your career development, you will learn more about yourself and how to manage your career in the future by joining us on this course!</span>"\
    ],\
    "__v" : 0\
\}\
\
/* 1 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3099"),\
    "id" : "48",\
    "shortName" : "friendsmoneybytes",\
    "name" : "Networks: Friends, Money, and Bytes",\
    "url" : "https://www.coursera.org/course/friendsmoneybytes",\
    "about" : [ \
        "You pick up your iPhone while waiting in line at a coffee shop. You google a not-so-famous actor, get linked to a Wikipedia entry listing his recent movies and popular YouTube clips of several of them. You check out user reviews on Amazon and pick one,\\ndownload that movie on BitTorrent or stream that in Netflix. But suddenly the WiFi logo on your phone is gone and you're on 3G. Video quality starts to degrade, but you don't know if it's the server getting crowded or the Internet is congested somewhere.\\nIn any case, it costs you $10 per Gigabyte, and you decide to stop watching the movie, and instead multitask between sending tweets and calling your friend on Skype, while songs stream from iCloud to your phone. You're happy with the call quality, but\\nget a little irritated when you see there're no new followers on Twitter. You may wonder how they all kind of work, and why sometimes they don't. Take a look at the list of 20 questions below. Each question is selected not just for its relevance to our\\ndaily lives, but also for the core concepts in the field of networking illustrated by its answers. This course is about formulating and answering some of these 20 questions.\\n<br>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "networking", \
        "data mining"\
    ]\
\}\
\
/* 2 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a1"),\
    "id" : "1617",\
    "shortName" : "algobioprogramming",\
    "name" : "Algorithms, Biology, and Programming for Beginners",\
    "url" : "https://www.coursera.org/course/algobioprogramming",\
    "about" : [ \
        "<p>The sequencing of the&nbsp;human genome fueled a computational revolution in biology. As a result, modern biology produces as many new&nbsp;algorithms as any other fundamental realm of&nbsp;science.</p><p>Genome sequencing is just one of hundreds of biological problems that have become inextricable from the computational methods required to solve them. In this course, we will uncover some of the algorithmic ideas that are&nbsp;fundamental to an&nbsp;understanding of modern biology.&nbsp; Computational concepts like dynamic programming and graph theory&nbsp;will help us explore algorithms applied to&nbsp;a wide range of biological topics, from finding regulatory motifs&nbsp;to determining whether the human genome has \\"fragile\\" regions.&nbsp; Throughout the process, we will apply&nbsp;bioinformatics algorithms to&nbsp;<i>real</i>&nbsp;genetic data.</p><p>Each chapter in the&nbsp;<a href=\\"http://bioinformaticsalgorithms.com\\" target=\\"_blank\\">course textbook</a>&nbsp;covers a single biological question and slowly builds the algorithmic knowledge required to address this challenge. &nbsp;Along the way, coding challenges and exercises will be integrated into the text at the exact moment they are needed.</p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "computer software", \
        "c"\
    ]\
\}\
\
/* 3 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30ab"),\
    "id" : "300",\
    "shortName" : "startup",\
    "name" : "Startup Engineering",\
    "url" : "https://www.coursera.org/course/startup",\
    "about" : [ \
        "<b></b>\\n<div><b></b>Spiritual sequel to Peter Thiel's <a href=\\"http://blakemasters.tumblr.com/peter-thiels-cs183-startup\\">CS183</a> course\\n    on startups. Bridges the gap between academic computer science and production\\n    softwar<b></b>e engineering. Fast-paced introduction to key tools and techniques\\n    (command line, dotfiles, text editor, distributed version control, debugging,\\n    testing, documentation, reading code, deployments), featuring guest appearances\\n    by senior engineers from successful startups and large-scale academic projects.\\n    Over the course of the class, students will build a command line application,\\n    expose it as a web service, and then link other students' applications\\n    and services together to build an HTML5 mobile app. General principles\\n    are illustrated through modern Javascript and the latest web technologies,\\n    including Node, Backbone, Coffeescript, Bootstrap, Git, and Github.&nbsp;<b></b><b></b><b></b>\\n</div>"\
    ],\
    "__v" : 0\
\}\
\
/* 4 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a5"),\
    "id" : "26",\
    "shortName" : "algs4partI",\
    "name" : "Algorithms, Part I",\
    "url" : "https://www.coursera.org/course/algs4partI",\
    "about" : [ \
        "An introduction to fundamental data types, algorithms, and data structures,\\nwith emphasis on applications and scientific performance analysis of Java\\nimplementations. Specific topics covered include: union-find algorithms;\\nbasic iterable data types (stack, queues, and bags); sorting algorithms\\n(quicksort, mergesort, heapsort) and applications; priority queues; binary\\nsearch trees; red-black trees; hash tables; and symbol-table applications."\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "java", \
        "c"\
    ]\
\}\
\
/* 5 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309d"),\
    "id" : "127",\
    "shortName" : "crypto2",\
    "name" : "Cryptography II",\
    "url" : "https://www.coursera.org/course/crypto2",\
    "about" : [ \
        "Cryptography is an indispensable tool for protecting information in computer systems. &nbsp;This course is a continuation of <a href=\\"https://www.coursera.org/course/crypto\\">Crypto I</a> and explains the inner workings of public-key systems and cryptographic protocols. &nbsp; Students will learn how to reason about the security of cryptographic constructions and how to apply this knowledge to real-world applications. The course begins with constructions for digital signatures and their applications. &nbsp; We will then discuss protocols for user authentication and zero-knowledge protocols. &nbsp; &nbsp;Next we will turn to privacy applications of cryptography supporting anonymous credentials and private database lookup. &nbsp;We will conclude with more advanced topics including multi-party computation and elliptic curve cryptography. &nbsp;Throughout the course students will be exposed to many exciting open problems in the field. &nbsp; The course will include written homeworks and optional programming labs. &nbsp;The material is self-contained, but the course assumes knowledge of the topics covered in <a href=\\"https://www.coursera.org/course/crypto\\">Crypto I</a> as well as a basic understanding of discrete probability theory."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "cryptography", \
        "security"\
    ]\
\}\
\
/* 6 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3095"),\
    "id" : "1873",\
    "shortName" : "initprogjava",\
    "name" : "Initiation \'e0 la programmation (en Java)",\
    "url" : "https://www.coursera.org/course/initprogjava",\
    "about" : [ \
        "Ce cours pr\'e9sente des concepts de base de la programmation tels que&nbsp;&nbsp; : variables, expressions, structures de contr\'f4le, fonctions/m\'e9thodes, ...<br>en les illustrant dans la syntaxe du langage Java.<br><br>Ces notions simples seront pratiqu\'e9es de fa\'e7on intensive pour vous faire r\'e9aliser de fa\'e7on de plus en plus autonome&nbsp; les \'e9tapes allant de la conception d'un programme (algorithme) \'e0 sa mise en oeuvre concr\'e8te.<br><br>Ce cours de base&nbsp; est con\'e7u pour \'eatre prolong\'e9 par les aspects orient\'e9-objet, pr\'e9sent\'e9s dans le cours&nbsp;&nbsp;<a href=\\"https://www.coursera.org/course/intropoojava\\">\'abIntroduction \'e0 la programmation orient\'e9e objet (en Java)\'bb</a>.&nbsp;<br>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "java"\
    ]\
\}\
\
/* 7 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30af"),\
    "id" : "987",\
    "shortName" : "reactive",\
    "name" : "Principles of Reactive Programming",\
    "url" : "https://www.coursera.org/course/reactive",\
    "about" : [ \
        "<p>This is a follow-on for the Coursera class \'93Principles of Functional Programming in Scala\'94, which so far had more than 100\'92000 inscriptions over two iterations of the course, with some of the highest completion rates of any massive open online course worldwide.</p><p>The aim of the second course is to teach the principles of reactive programming. Reactive programming is an emerging discipline which combines concurrency and event-based and asynchronous systems. It is essential for writing any kind of web-service or distributed system and is also at the core of many high-performance concurrent systems. Reactive programming can be seen as a natural extension of higher-order functional programming to concurrent systems that deal with distributed state&nbsp;by coordinating and orchestrating asynchronous data streams exchanged by actors.</p><p>In this course you will discover key elements for writing reactive programs in a composable way. You will find out how to apply these building blocks in the construction of message-driven systems that are scalable and resilient.</p>The course is hands on; most units introduce short programs that serve as illustrations of important concepts and invite you to play with them, modifying and improving them. The course is complemented by a series of assignments, which are also programming projects.<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 8 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a7"),\
    "id" : "781",\
    "shortName" : "gameprogramming",\
    "name" : "Beginning Game Programming with C#",\
    "url" : "https://www.coursera.org/course/gameprogramming",\
    "about" : [ \
        "<p>The Beginning Game\\nProgramming with C# course is all about learning how to develop video games\\nusing the C# programming language. Why use C# instead of C++, Java,\\nActionScript, or some other programming language you may have heard of? First,\\nusing C# lets us use the Microsoft XNA and open-source MonoGame frameworks,\\nwhich help us quickly develop games for Windows, Android, iOS, Mac OS, and\\nothers. Second, the Unity game engine is very popular with indie game\\ndevelopers, and C# is one of the programming languages you can use in the Unity\\nenvironment. And finally, C# is a really good language for learning how to\\nprogram.</p>\\n\\n\\n\\n<p>That learning how to program\\ncomment is important because this course doesn't assume you have any previous programming\\nexperience. Don't worry if you've never written code before; we'll start at the\\nvery beginning and work our way up to building a small, complete game by the\\nend of the course. Throughout the course you'll learn core programming concepts\\nthat apply to lots of programming languages, including C#, and you'll also\\nlearn how to apply those concepts when you develop games: drawing all the\\nentities in the game world, updating the game world based on user input and\\nsimple physics, playing music and sound effects in your games, and so on.</p>\\n\\n\\n\\nComputer programming is really fun in general,\\nand programming games is even better!<br>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "c#", \
        "c#"\
    ]\
\}\
\
/* 9 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309a"),\
    "id" : "95",\
    "shortName" : "inforisk",\
    "name" : "Building an Information Risk Management Toolkit",\
    "url" : "https://www.coursera.org/course/inforisk",\
    "about" : [ \
        "<div>In this course, you will explore several structured, risk management approaches that guide information security decision-making. Course topics include: developing and maintaining risk assessments (RA); developing and maintaining risk management plans (RM); regulatory and legal compliance issues affecting risk plans; developing a control framework for mitigating risks; risk transfer; business continuity and disaster recovery planning from the information security perspective.<br><br><p>Consider\\nupgrading to an enhanced, more rigorous version of this course offered online\\nat the <a href=\\"http://www.pce.uw.edu/courses/building-information-risk-management-toolkit-coursera/online-winter-2013/\\">University of Washington</a>. You\'92ll gain access to\\nmeaningful interaction with instructors and additional assignments, readings\\nand multimedia material, as well as earn a valuable University of Washington\\ncredential.</p></div>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "security"\
    ]\
\}\
\
/* 10 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309e"),\
    "id" : "1830",\
    "shortName" : "sjtumia",\
    "name" : "
\f1 \'d2\'bd\'d1\'a7\'cd\'bc\'cf\'f1\'b4\'a6\'c0\'ed\'bc\'bc\'ca\'f5
\f0  Medical Image Analysis",\
    "url" : "https://www.coursera.org/course/sjtumia",\
    "about" : [ \
        "<div>
\f1 \'cb\'e6\'d7\'c5\'d0\'c5\'cf\'a2\'bc\'bc\'ca\'f5\'bc\'b0\'d2\'bd\'d1\'a7\'d3\'b0\'cf\'f1\'b3\'c9\'cf\'f1\'bc\'bc\'ca\'f5\'b5\'c4\'b7\'a2\'d5\'b9\'a3\'ac\'d2\'bd\'d1\'a7\'cd\'bc\'cf\'f1\'b4\'a6\'c0\'ed\'d4\'da\'d2\'bd\'d1\'a7\'c1\'d9\'b4\'b2\'a1\'a2\'bd\'cc\'d1\'a7\'ba\'cd\'bf\'c6\'d1\'d0\'d6\'d0\'b7\'a2\'bb\'d3\'d7\'c5\'d4\'bd\'c0\'b4\'d4\'bd\'d6\'d8\'d2\'aa\'b5\'c4\'d7\'f7\'d3\'c3\'a3\'ac\'d3\'d0\'c1\'a6\'b5\'d8\'cd\'c6\'b6\'af\'d7\'c5\'d2\'bd\'d1\'a7\'bf\'c6\'d1\'a7\'d1\'d0\'be\'bf\'ba\'cd\'c1\'d9\'b4\'b2\'d2\'bd\'c1\'c6\'b5\'c4\'bd\'f8\'b2\'bd\'a1\'a3\'c8\'e7\'ba\'ce\'d3\'d0\'d0\'a7\'b5\'d8\'d3\'a6\'d3\'c3\'cd\'bc\'cf\'f1\'d4\'f6\'c7\'bf\'a1\'a2\'b7\'d6\'b8\'ee\'a1\'a2\'c5\'e4\'d7\'bc\'a1\'a2\'c8\'da\'ba\'cf\'d2\'d4\'bc\'b0\'c8\'fd\'ce\'ac\'d6\'d8\'bd\'a8\'b5\'c8\'ca\'fd\'d7\'d6\'cd\'bc\'cf\'f1\'b7\'d6\'ce\'f6\'d3\'eb\'b4\'a6\'c0\'ed\'bc\'bc\'ca\'f5\'a3\'ac\'b6\'d4\'c8\'cb\'cc\'e5\'bd\'e2\'c6\'ca\'bd\'e1\'b9\'b9\'ba\'cd\'b2\'a1\'b1\'e4\'c7\'f8\'d3\'f2\'bd\'f8\'d0\'d0\'b6\'a8\'ce\'bb\'a1\'a2\'cc\'e1\'c8\'a1\'a1\'a2\'c8\'fd\'ce\'ac\'d4\'d9\'cf\'d6\'b2\'a2\'c1\'bf\'bb\'af\'b7\'d6\'ce\'f6\'ca\'c7\'ca\'b9\'b5\'c3\'d2\'bd\'d1\'a7\'d3\'b0\'cf\'f1\'ca\'fd\'be\'dd\'d3\'a6\'d3\'c3\'bc\'db\'d6\'b5\'d7\'ee\'b4\'f3\'bb\'af\'b5\'c4\'c7\'b0\'cc\'e1\'ba\'cd\'b1\'a3\'d6\'a4\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'d5\'eb\'b6\'d4\'d2\'bd\'d1\'a7\'cd\'bc\'cf\'f1\'b5\'c4\'cc\'d8\'d5\'f7\'a3\'ac\'bd\'e1\'ba\'cf\'c1\'d9\'b4\'b2\'d0\'e8\'c7\'f3\'a3\'ac\'d3\'c9\'c7\'b3\'c8\'eb\'c9\'ee\'b5\'d8\'bd\'b2\'bd\'e2\'d2\'bd\'d1\'a7\'cd\'bc\'cf\'f1\'b5\'c4\'d6\'d6\'c0\'e0\'a1\'a2\'cc\'d8\'d5\'f7\'a1\'a2\'d3\'a6\'d3\'c3\'c1\'ec\'d3\'f2\'a1\'a2\'ca\'fd\'d7\'d6\'bb\'af\'b4\'e6\'b4\'a2\'d0\'ce\'ca\'bd\'a3\'ac\'b2\'a2\'b7\'d6\'c0\'e0\'bd\'b2\'bd\'e2\'cd\'bc\'cf\'f1\'b4\'a6\'c0\'ed\'b5\'c4\'c0\'ed\'c2\'db\'ba\'cd\'cb\'e3\'b7\'a8\'a3\'ac\'bd\'e1\'ba\'cf\'d3\'a6\'d3\'c3\'b0\'b8\'c0\'fd\'ba\'cd\'bf\'ce\'b3\'cc\'ca\'b5\'bc\'f9\'ca\'b9\'d1\'a7\'c9\'fa\'ca\'ec\'c1\'b7\'d5\'c6\'ce\'d5\'cf\'e9\'b9\'e2\'c1\'ec\'d3\'f2\'b5\'c4\'d6\'aa\'ca\'b6\'ba\'cd\'bc\'bc\'c4\'dc\'a3\'ac\'b2\'a2\'be\'df\'b1\'b8\'d2\'bb\'b6\'a8\'b5\'c4\'b6\'af\'ca\'d6\'c4\'dc\'c1\'a6\'a3\'ac\'ce\'aa\'bd\'f8\'d2\'bb\'b2\'bd\'d1\'a7\'cf\'b0\'d2\'bd\'d1\'a7\'cd\'bc\'cf\'f1\'c1\'ec\'d3\'f2\'b5\'c4\'c6\'e4\'cb\'fb\'bf\'ce\'b3\'cc\'b5\'ec\'b6\'a8\'bb\'f9\'b4\'a1\'a1\'a3
\f0 </div><div>The medical image analysis plays an important role in clinical application. The people who want to learn advance theory, algorithms and its applications on the digital image processing area is most suitable. The contents may include image acquiring, image filtering, image segmentation, image understanding and visualization. It could help students to review the history, current status and development of the research area, and could help them to apply them to their own research field. The students are required to understand the basic theory, algorithms and its applications on the digital image processing area.</div><div><br></div>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "data mining"\
    ]\
\}\
\
/* 11 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b4"),\
    "id" : "122",\
    "shortName" : "hwswinterface",\
    "name" : "The Hardware/Software Interface",\
    "url" : "https://www.coursera.org/course/hwswinterface",\
    "about" : [ \
        "This course examines key computational abstraction levels below modern\\nhigh-level languages; number representation, assembly language, introduction\\nto C, memory management, the operating-system process model, high-level\\nmachine architecture including the memory hierarchy, and how high-level\\nlanguages are implemented. We will develop students\'92 sense of \'93what really\\nhappens\'94 when software runs \'97 and that this question can be answered at\\nseveral levels of abstraction, including the hardware architecture level,\\nthe assembly level, the C programming level and the Java programming level.\\nThe core around which the course is built is C, assembly, and low-level\\ndata representation, but this is connected to higher levels (roughly how\\nbasic Java could be implemented), lower levels (the general structure of\\na processor and the memory hierarchy), and the role of the operating system\\n(but not how the operating system is implemented)."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "computer software"\
    ]\
\}\
\
/* 12 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30ac"),\
    "id" : "2302",\
    "shortName" : "datavisualization",\
    "name" : "Data Visualization",\
    "url" : "https://www.coursera.org/course/datavisualization",\
    "about" : [ \
        "<p>Learn to <strong>present data</strong> to an observer in a way that yields insight and understanding. The first week focuses on the <strong>infrastructure for data visualization</strong>. It introduces elementary graphics programming, focusing primarily on two-dimensional vector graphics and the programming platforms for graphics. This infrastructure will also include lessons on the <strong>human side of visualization</strong>, studying human perception and cognition to gain a better understanding of the target of the data visualization.</p>\\n \\n<p>The second week will utilize the knowledge of graphics programming and human perception in the <strong>design and construction of visualizations</strong>, starting with simple charts and graphs and incorporating animation and user interactivity. The third week expands the data visualization vocabulary with more sophisticated methods, including <strong>hierarchical layouts and networks</strong>. The final week focuses on visualization of database and data mining processes, with methods specifically focused on <strong>visualization of unstructured information</strong>, such as text, and systems for visual analytics that provide decision support.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "data mining", \
        "html"\
    ]\
\}\
\
/* 13 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b5"),\
    "id" : "232",\
    "shortName" : "malsoftware",\
    "name" : "Malicious Software and its Underground Economy: Two Sides to Every Story",\
    "url" : "https://www.coursera.org/course/malsoftware",\
    "about" : [ \
        "Cybercrime has become both more widespread and harder to battle. Researchers and anecdotal\\nexperience show that the cybercrime scene is becoming increasingly organized\\nand consolidated, with strong links also to traditional criminal networks.\\nModern attacks are indeed stealthy and often profit oriented.\\n\\n<br><br>Malicious software (malware) is the traditional way in which cybercriminals infect user\\nand enterprise hosts to gain access to their private, financial, and\\nintellectual property data. Once stolen, such information can enable more\\nsophisticated attacks, generate illegal revenue, and allow for cyber-espionage.\\n<br><br>By mixing a practical, hands-on approach with the theory and techniques behind the scene, the course discusses the current academic and underground research in the\\nfield, trying to answer the foremost question about malware and underground\\neconomy, namely, \\"Should we care?\\".<br><br>\'a0Students will learn how traditional and mobile malware work, how they are analyzed and\\ndetected, peering through the underground ecosystem that drives this profitable\\nbut illegal business.\\n\\nUnderstanding how malware operates is of paramount importance to form knowledgeable experts, teachers, researchers, and practitioners able to fight back.  Besides, it allows us to gather intimate knowledge of the systems and the threats, which is a necessary step to successfully devise novel, effective, and practical mitigation techniques."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "cyber security", \
        "security"\
    ]\
\}\
\
/* 14 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a8"),\
    "id" : "2294",\
    "shortName" : "fog",\
    "name" : "Fog Networks and the Internet of Things",\
    "url" : "https://www.coursera.org/course/fog",\
    "about" : [ \
        "<p>Pushing computation, control and storage into the \'93cloud\'94 has been a key trend in\\nnetworking in the past decade. The cloud is now \'93descending\'94 to the network\\nedge and often diffused among the client devices in both mobile and wireline\\nnetworks. The cloud is becoming the \'93fog.\'94 Empowered by the latest chips,\\nradios, and sensors, each client device today is powerful in computation, in\\nstorage, in sensing and in communication. Yet client devices are still limited\\nin battery power, global view of the network, and mobility support. Most\\ninterestingly, the collection of many clients in a crowd presents a highly\\ndistributed, under-organized, and possibly dense network. </p>\\n\\n<p>Fog Networking is an architecture that will also support the Internet of Things, IoT, such as the \'93connected wearables.\'94 Bold, new user interfaces are getting close to affordable price points for the mass, begging questions on the \'93architectural choices for the glasses and watches,\'94 from naming to billing, and from session management to resource optimization. Fog Networking leverages past experience in sensor networks, P2P and MANET research, and incorporates the latest advances in devices, network systems, and data science to reshape the \'93balance of power\'94 in the ecosystem of computing and networking.&nbsp;</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "cloud computing", \
        "virtualization"\
    ]\
\}\
\
/* 15 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30ad"),\
    "id" : "19",\
    "shortName" : "security",\
    "name" : "Computer Security",\
    "url" : "https://www.coursera.org/course/security",\
    "about" : [ \
        "<p>In this class you will learn how to design secure systems and write secure code. You will learn how to find vulnerabilities in code and how to design software systems that limit the impact of security vulnerabilities. We will focus on principles for building secure systems and give many real world examples. In addition, the course will cover topics such as:</p><ul><li>memory safety vulnerabilities</li><li>techniques and tools for vulnerability detection and defense</li><li>security principles such as sandboxing, isolation and least privilege</li><li>mobile platform and application security</li><li>basic crypto concepts</li><li>web security</li><li>network security</li><li>malware detection and defense</li></ul><p>Course homework and labs will help students practice the concepts and techniques learned in class, such as how to find vulnerabilities and how to fix them. The labs and projects are designed to help students practice the principles of secure system design.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "security", \
        "cyber security"\
    ]\
\}\
\
/* 16 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a4"),\
    "id" : "896",\
    "shortName" : "mmds",\
    "name" : "Mining Massive Datasets",\
    "url" : "https://www.coursera.org/course/mmds",\
    "about" : [ \
        "We introduce the participant to modern distributed file systems and MapReduce, including what distinguishes good MapReduce algorithms from good algorithms in general. &nbsp;The rest of the course is devoted to algorithms for extracting models and information from large datasets. &nbsp;Participants will learn how Google's PageRank algorithm models importance of Web pages and some of the many extensions that have been used for a variety of purposes. &nbsp;We'll cover locality-sensitive hashing, a bit of magic that allows you to find similar items in a set of items so large you cannot possibly compare each pair. &nbsp;When data is stored as a very large, sparse matrix, dimensionality reduction is often a good way to model the data, but standard approaches do not scale well; we'll talk about efficient approaches. &nbsp;Many other large-scale algorithms are covered as well, as outlined in the course syllabus."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "data mining"\
    ]\
\}\
\
/* 17 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b6"),\
    "id" : "100",\
    "shortName" : "infosec",\
    "name" : "Designing and Executing Information Security Strategies",\
    "url" : "https://www.coursera.org/course/infosec",\
    "about" : [ \
        "<p>This course provides you with opportunities to integrate and\\napply your information security knowledge.</p>\\n\\n<p>This course provides you with opportunities to integrate and\\napply your information security knowledge. Following the case-study approach,\\nyou will be introduced to current, real-world cases developed and presented by\\nthe practitioner community. You will design and execute information assurance\\nstrategies to solve these cases.</p>\\n\\n<p>Topics explored include: <br>\\nAnalysis and problem solving using\\ncases&nbsp;contracted&nbsp;from real world problems in Information Assurance\\nincluding: </p>\\n\\n<ul><li>Selection and application of controls</li><li>Construction of security policies</li><li>Understanding and application of regulatory\\n     requirements</li><li>Understanding and application of business\\n     constraints&nbsp;</li><li>Communication of risk to non-information assurance\\n     professionals</li><li>Identification and remediation of new threats</li><li>Analysis and performance of incident response</li><li>Communication of Information Assurance\\nprinciples and concepts \\n\\n</li></ul><ul><li>Peer reviewed analysis of each case</li><li>Reading and class explanation of good and bad examples\\n     (from news and public sources)</li><li>Reading and peer discussion of current events in\\n     Information Assurance</li></ul>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "security", \
        "cyber security"\
    ]\
\}\
\
/* 18 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a9"),\
    "id" : "2494",\
    "shortName" : "softwaretesting",\
    "name" : "
\f1 \'c8\'ed\'bc\'fe\'b2\'e2\'ca\'d4
\f0  (Software Testing)",\
    "url" : "https://www.coursera.org/course/softwaretesting",\
    "about" : [ \
        "
\f1 \'b4\'d3\'c8\'cf\'ca\'b6\'ba\'cd\'c0\'ed\'bd\'e2\'c8\'ed\'bc\'fe
\f0 Bug
\f1 \'bf\'aa\'ca\'bc\'a3\'ac\'bd\'e9\'c9\'dc\'c8\'ed\'bc\'fe\'b2\'e2\'ca\'d4\'b5\'c4\'bb\'f9\'b1\'be\'c0\'ed\'c2\'db\'a3\'ac\'b2\'fb\'ca\'f6\'c8\'ed\'bc\'fe\'b2\'e2\'ca\'d4\'c9\'e8\'bc\'c6\'b5\'c4\'b6\'e0\'d1\'f9\'d0\'d4\'d4\'ad\'c0\'ed\'a1\'a3\'bb\'f9\'d3\'da\'b6\'e0\'d1\'f9\'d0\'d4\'d4\'ad\'c0\'ed\'a3\'ac\'bd\'e9\'c9\'dc\'c3\'e6\'cf\'f2\'bf\'aa\'b7\'a2\'d5\'df\'ba\'cd\'c3\'e6\'cf\'f2\'d3\'c3\'bb\'a7\'b5\'c4\'b2\'e2\'ca\'d4\'d3\'c3\'c0\'fd\'c9\'e8\'bc\'c6\'b7\'bd\'b7\'a8\'a3\'ac\'be\'df\'cc\'e5\'b0\'fc\'c0\'a8\'cb\'e6\'bb\'fa\'b2\'e2\'ca\'d4\'a1\'a2\'b5\'c8\'bc\'db\'c0\'e0\'b2\'e2\'ca\'d4\'a1\'a2\'bd\'e1\'b9\'b9\'bb\'af\'b2\'e2\'ca\'d4\'a1\'a2\'ca\'fd\'be\'dd\'c1\'f7\'b2\'e2\'ca\'d4\'ba\'cd\'c2\'df\'bc\'ad\'b2\'e2\'ca\'d4\'a3\'bb\'d1\'fb\'c7\'eb\'d2\'b5\'bd\'e7\'d7\'a8\'bc\'d2\'bd\'b2\'bd\'e2\'b9\'a6\'c4\'dc\'b2\'e2\'ca\'d4\'a1\'a2\'d0\'d4\'c4\'dc\'b2\'e2\'ca\'d4\'a1\'a2\'d2\'c6\'b6\'af\'d3\'a6\'d3\'c3\'b2\'e2\'ca\'d4\'b5\'c8\'d7\'a8\'cf\'ee\'b2\'e2\'ca\'d4\'bc\'bc\'ca\'f5\'a1\'a3
\f0 "\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "testing", \
        "software testing"\
    ]\
\}\
\
/* 19 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b2"),\
    "id" : "1378",\
    "shortName" : "usablesec",\
    "name" : "Usable Security",\
    "url" : "https://www.coursera.org/course/usablesec",\
    "about" : [ \
        "<span><p>In many systems, human users are a critical part of the security process. They create passwords, follow security protocols, and share information that can maintain or destroy the security of a system. However, many secure systems are designed with little to no attention paid to people's cognitive abilities, workflow, or tasks. As a result, people find ways around the security obstacles that get in the way of their work.<br></p><p>This course focuses on how to design and build secure systems with a human-centric focus. We will look at basic principles of human-computer interaction, including the basics of humans' cognitive abilities, principles of usability, design techniques, and evaluation methods. We will then apply these insights to the design of secure systems with the goal of developing security measures that respect human performance and their goals within a system.</p><p>Through hands-on exercises designing, building, evaluating, and critiquing systems, students will learn how to integrate usability into secure software. The course will specifically focus on authentication mechanisms, browsing security, privacy and social media, and mobile security.</p></span>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "testing", \
        "software testing"\
    ]\
\}\
\
/* 20 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3081"),\
    "id" : "27",\
    "shortName" : "algs4partII",\
    "name" : "Algorithms, Part II",\
    "url" : "https://www.coursera.org/course/algs4partII",\
    "about" : [ \
        "Part II covers graph-processing algorithms, including minimum spanning tree and shortest paths algorithms, and string processing algorithms, including string sorts, tries, substring search, regular expressions, and data compression, and concludes with an overview placing the contents of the course in a larger context."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "java", \
        "algorithms", \
        "java", \
        "c"\
    ]\
\}\
\
/* 21 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307b"),\
    "id" : "1984",\
    "shortName" : "pkuco",\
    "name" : "
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'d7\'e9\'b3\'c9
\f0  Computer Organization",\
    "url" : "https://www.coursera.org/course/pkuco",\
    "about" : [ \
        "<p>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'bf\'c9\'d2\'d4\'b7\'c3\'ce\'ca
\f0 <a href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/07/25/538020_hd.mp4\\" target=\\"_blank\\">
\f1 \'d5\'e2\'c0\'ef
\f0 </a>
\f1 \'a1\'a3
\f0 </p><p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'b5\'c4\'d6\'d8\'b5\'e3\'d4\'da\'d3\'da\'bc\'c6\'cb\'e3\'bb\'fa\'c4\'da\'b2\'bf\'b5\'c4\'d6\'f7\'d2\'aa\'b2\'bf\'bc\'fe\'d2\'d4\'bc\'b0\'b8\'f7\'b2\'bf\'bc\'fe\'d6\'ae\'bc\'e4\'b5\'c4\'c1\'aa\'cf\'b5\'a3\'ac\'d6\'f7\'d2\'aa\'c4\'da\'c8\'dd\'b0\'fc\'c0\'a8\'a3\'ba\'b7\'eb
\f0 \'b7
\f1 \'c5\'b5\'d2\'c0\'c2\'fc\'bc\'c6\'cb\'e3\'bb\'fa\'bd\'e1\'b9\'b9\'b5\'c4\'d2\'aa\'b5\'e3\'a3\'ac\'bc\'c6\'cb\'e3\'bb\'fa\'d6\'b4\'d0\'d0\'d6\'b8\'c1\'ee\'b5\'c4\'b9\'a4\'d7\'f7\'b9\'fd\'b3\'cc\'a3\'ac\'b5\'b1\'c7\'b0\'c1\'f7\'d0\'d0\'b5\'c4\'d6\'b8\'c1\'ee\'cf\'b5\'cd\'b3\'b5\'c4\'b7\'d6\'ce\'f6\'b6\'d4\'b1\'c8\'a3\'ac\'b8\'df\'bc\'b6\'d3\'ef\'d1\'d4\'a1\'a2\'bb\'e3\'b1\'e0\'d3\'ef\'d1\'d4\'ba\'cd\'bb\'fa\'c6\'f7\'d3\'ef\'d1\'d4\'d6\'ae\'bc\'e4\'b5\'c4\'b9\'d8\'cf\'b5\'a3\'ac\'bc\'c6\'cb\'e3\'bb\'fa\'b2\'c9\'d3\'c3\'b5\'c4\'d6\'f7\'d2\'aa\'cb\'e3\'ca\'f5\'ba\'cd\'c2\'df\'bc\'ad\'d4\'cb\'cb\'e3\'b7\'bd\'b7\'a8\'bc\'b0\'c6\'e4\'ca\'b5\'cf\'d6\'a3\'ac\'ce\'a2\'b4\'a6\'c0\'ed\'c6\'f7\'a1\'a2\'b4\'e6\'b4\'a2\'cf\'b5\'cd\'b3\'ba\'cd\'ca\'e4\'c8\'eb\'ca\'e4\'b3\'f6\'cf\'b5\'cd\'b3\'b5\'c4\'bb\'f9\'b1\'be\'d4\'ad\'c0\'ed\'ba\'cd\'b9\'d8\'bc\'fc\'bc\'bc\'ca\'f5\'b5\'c8\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'c7\'bf\'b5\'f7\'bc\'c6\'cb\'e3\'bb\'fa\'c8\'ed\'bc\'fe\'ba\'cd\'d3\'b2\'bc\'fe\'b5\'c4\'cf\'ce\'bd\'d3\'bb\'a5\'b6\'af\'a3\'ac\'d7\'a2\'d6\'d8\'bb\'f9\'d3\'da\'d5\'e6\'ca\'b5\'cf\'b5\'cd\'b3\'b7\'d6\'ce\'f6\'bb\'f9\'b1\'be\'b8\'c5\'c4\'ee\'a3\'ac\'ca\'c7\'bc\'c6\'cb\'e3\'bb\'fa\'bc\'b0\'cf\'e0\'b9\'d8\'d7\'a8\'d2\'b5\'b1\'be\'bf\'c6\'c9\'fa\'c1\'cb\'bd\'e2\'ba\'cd\'d5\'c6\'ce\'d5\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'d5\'fb\'cc\'e5\'bf\'f2\'bc\'dc\'b5\'c4\'bb\'f9\'b4\'a1\'d0\'d4\'bf\'ce\'b3\'cc\'a1\'a3
\f0 </p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "computer architecture", \
        "computer architecture"\
    ]\
\}\
\
/* 22 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3084"),\
    "id" : "1865",\
    "shortName" : "cprogramming",\
    "name" : "
\f1 \'d3\'8b\'cb\'e3\'99\'43\'b3\'cc\'ca\'bd\'d4\'4f\'d3\'8b
\f0  (Computer Programming)",\
    "url" : "https://www.coursera.org/course/cprogramming",\
    "about" : [ \
        "This course will introduce computer programming in C. This freshman CS course will assume no prior experience about computer science. We will cover basic operations about computers, then move on to how to write computer programs in a language called C. Various C concepts will be introduced."\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "c"\
    ]\
\}\
\
/* 23 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308f"),\
    "id" : "66",\
    "shortName" : "programming2",\
    "name" : "Learn to Program: Crafting Quality Code",\
    "url" : "https://www.coursera.org/course/programming2",\
    "about" : [ \
        "<div>Most programs are used for years and are worked on by many people. Having programs that are easy to understand is essential, in the same way that a well-organized essay is far easier to follow than a disorganized one. We\'92ll show you an approach that helps to break down problems into smaller tasks that are easier to both solve and read.</div>\\n<div>&nbsp;</div>\\n<div>This design approach also makes it more straightforward to find and fix flaws. You'll be introduced to the tools that professional programmers use; they're called \\"testing\\" and \\"debugging\\".</div>\\n<div>&nbsp;</div>\\n<div>For most complex problems, there are many programs that solve them. Some are inherently slower than others. You'll learn how to read two programs and compare them for efficiency.</div>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "python"\
    ]\
\}\
\
/* 24 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3056"),\
    "id" : "2341",\
    "shortName" : "codeyourself",\
    "name" : "Code Yourself! An Introduction to Programming",\
    "url" : "https://www.coursera.org/course/codeyourself",\
    "about" : [ \
        "<p dir=\\"ltr\\">Computer programs are everywhere: from coffee machines and MP3 players, to spaceships and medical robots. But just like astronomy is more than simply using telescopes, Computer Science is more than simply using computers. It\'92s about programming computers to tell them precisely what to do. Coding is an invaluable skill that helps people think computationally, and hence effectively solve problems within and outside computer science. It is also creative and fun, allowing you, for instance, to build computer games to play with your friends.</p><p dir=\\"ltr\\">This course will introduce you to computer programming with <a target=\\"_blank\\" href=\\"http://scratch.mit.edu/\\">Scratch</a>, one of the easiest to use programming languages. You will create computer programs by plugging graphical coding blocks together, for example to create animations, build games and construct interactive stories. </p><p dir=\\"ltr\\">But this course is much more than an introduction to Scratch. It will teach you how to think like a programmer, a computer scientist, a software engineer! It will introduce you to the fundamental principles of computing, and prompt you to think around topics like algorithm design, user interaction, code reusability and generalisation of solutions. </p><p dir=\\"ltr\\">You will learn all this through in-depth, hands-on examples, interviews with computing experts, fun quizzes and creative projects. By the end of this course you will be equipped with a solid understanding of the foundations of computing, allowing you to move to different programming languages or take a more advanced programming course in the future.</p><p dir=\\"ltr\\"><img alt=\\"ScratchCat-Small\\" style=\\"width:35%\\" src=\\"https://d396qusza40orc.cloudfront.net/codeyourself/ScratchCat-Small.png\\"><br></p><p dir=\\"ltr\\">NOTE: This course is also given in Spanish:&nbsp;<a href=\\"https://www.coursera.org/course/aprogramar\\">https://www.coursera.org/course/aprogramar</a></p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "c", \
        "c++"\
    ]\
\}\
\
/* 25 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b305f"),\
    "id" : "1330",\
    "shortName" : "spatialcomputing",\
    "name" : "From GPS and Google Maps to Spatial Computing",\
    "url" : "https://www.coursera.org/course/spatialcomputing",\
    "about" : [ \
        "<p>From Google Maps to consumer global positioning system (GPS) devices, spatial technology shapes many lives in both ordinary and extraordinary ways. Thanks to spatial computing, a hiker in Yellowstone and a taxi driver in Manhattan can know precisely where\\n    they are, discover nearby points of interest and learn how to reach their destinations. Spatial computing technology is what powers the Foursquare check-in, the maps app on your smartphone, the devices used by scientists to track endangered species,\\n    the routing directions that help you get from point A to point B, the precision agriculture technology that is revolutionizing farming, and the augmented reality devices like Google Glass that may soon mediate our interaction with the real world.</p>\\n<p>This course introduces the fundamental ideas underlying spatial computing services, systems, and sciences. Topics covered will include the nature of geospatial information, proper statistical frameworks for working with geospatial data, key algorithms\\n    and data structures, spatial data mining, and cartography/geovisualization. We will also address applied topics such as where to find spatial data, how to use powerful open source software to analyze and map spatial data, and frameworks for building\\n    location-based services.\\n    <br>\\n</p>\\n<p>\\n    <br><b>Three Ways to Enjoy this Course:</b>\\n    <br>\\n</p>\\n<p>This course is designed to support three different types of students and educational goals:\\n    <br>\\n</p>\\n<p><i>Curiosity Track</i>: Most of us interact with spatial technologies every day. This track is for students who wish to learn about one or two spatial computing topics, but not commit to an entire course. Curiosity track students are not interested in\\n    a certificate of accomplishment.\\n    <br>\\n</p>\\n<p><i>Concepts Track</i>: This track is for students who want to learn about spatial computing concepts in order to make informed choices, but who are not programmers and do not have extensive experience with statistical methods. For example, concepts track\\n    students will learn about Tobler\'92s First Law of geography and map projections, but will not delve into the quantifications of either. Students who complete the concepts track with sufficiently high scores will receive a Statement of Accomplishment.\\n    <br>\\n</p>\\n<p><i>Technical Track</i>: This track builds on the concepts track, but adds math and programming. For example, we will cover spatial statistical indicators like Moran\'92s I and Ripley\'92s K when discussing Tobler\'92s First Law and will have students calculate\\n    the distance between two points using two different coordinate systems and open-source APIs. Students who complete the technical track with sufficiently high scores will receive a Distinguished Statement of Accomplishment.\\n    <br>\\n</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "data mining", \
        "sql"\
    ]\
\}\
\
/* 26 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3054"),\
    "id" : "1024",\
    "shortName" : "pkuic",\
    "name" : "Introduction to Computing 
\f1 \'bc\'c6\'cb\'e3\'b8\'c5\'c2\'db
\f0 A",\
    "url" : "https://www.coursera.org/course/pkuic",\
    "about" : [ \
        "<p>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'bf\'c9\'d2\'d4\'b7\'c3\'ce\'ca
\f0 <a href=\\"http://video.study.163.com/edu-video/nos/mp4/2013/11/20/303418_sd.mp4\\" target=\\"_blank\\">
\f1 \'d5\'e2\'c0\'ef
\f0 </a>
\f1 \'a1\'a3
\f0 </p>\\n<p><b></b>\'a0\'a0\'a0 
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'b5\'c4
\f0 <b>
\f1 \'c4\'da\'c8\'dd
\f0 </b>
\f1 \'d6\'f7\'d2\'aa
\f0 <b>
\f1 \'b7\'d6\'ce\'aa\'c1\'bd\'b8\'f6\'b2\'bf\'b7\'d6
\f0 </b>
\f1 \'a3\'ba\'a3\'a8
\f0 1
\f1 \'a3\'a9
\f0 <b>
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'bb\'f9\'b4\'a1\'d6\'aa\'ca\'b6
\f0 </b>
\f1 \'a3\'ac\'d4\'bc\'d5\'bc\'bf\'ce\'ca\'b1\'c1\'bf\'b5\'c4
\f0 <b>15%</b>
\f1 \'a3\'bb\'a3\'a8
\f0 2
\f1 \'a3\'a9
\f0 <b>C
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'bb\'f9\'b4\'a1
\f0 </b>
\f1 \'a3\'ac\'d4\'bc\'d5\'bc\'bf\'ce\'ca\'b1\'c1\'bf\'b5\'c4
\f0 <b>85%</b>
\f1 \'a3\'bb
\f0 </p>\\n<p>\'a0\'a0\'a0 
\f1 \'d4\'da\'bc\'c6\'cb\'e3\'bb\'fa\'bb\'f9\'b4\'a1\'d6\'aa\'ca\'b6\'b2\'bf\'b7\'d6\'a3\'ac\'ce\'d2\'c3\'c7\'bd\'ab\'ce\'aa\'b4\'f3\'bc\'d2
\f0 <b>
\f1 \'bd\'e2\'b4\'f0\'d2\'bb\'d0\'a9\'d3\'eb\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'cf\'e0\'b9\'d8\'b5\'c4\'bb\'f9\'b4\'a1\'ce\'ca\'cc\'e2
\f0 </b>
\f1 \'a3\'ac\'c0\'fd\'c8\'e7
\f0 <b>
\f1 \'a3\'ac
\f0 \'93
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'ce\'aa\'ca\'b2\'c3\'b4\'c4\'dc\'b9\'bb\'bd\'f8\'d0\'d0\'bc\'c6\'cb\'e3\'a3\'bf
\f0 \'94
\f1 \'a3\'ac
\f0 \'93
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'d4\'da\'bc\'c6\'cb\'e3\'bb\'fa\'d6\'d0\'ca\'c7\'c8\'e7\'ba\'ce\'d4\'cb\'d0\'d0\'b5\'c4\'a3\'bf
\f0 \'94
\f1 \'a3\'ac
\f0 \'93
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'b5\'c4\'b7\'a2\'d5\'b9\'b9\'e6\'c2\'c9\'ca\'c7\'ca\'b2\'c3\'b4\'a3\'bf
\f0 \'94
\f1 \'a3\'ac
\f0 \'93
\f1 \'cf\'c2\'d2\'bb\'b4\'fa\'b5\'c4\'bc\'c6\'cb\'e3\'bb\'fa\'bd\'ab\'bb\'e1\'ca\'c7\'ca\'b2\'c3\'b4\'d1\'f9\'d7\'d3\'a3\'bf
\f0 \'94</b>
\f1 \'b5\'c8\'b5\'c8\'a1\'a3\'ce\'d2\'c3\'c7\'cf\'a3\'cd\'fb\'cd\'a8\'b9\'fd\'b6\'d4\'d5\'e2\'d0\'a9\'ce\'ca\'cc\'e2\'b5\'c4\'bd\'e2\'b4\'f0\'a3\'ac\'b4\'ef\'b5\'bd\'c1\'bd\'b8\'f6\'c4\'bf\'b5\'c4\'a3\'ba
\f0 A 
\f1 \'c5\'e0\'d1\'f8\'c6\'f0\'b4\'f3\'bc\'d2\'b6\'d4\'bc\'c6\'cb\'e3\'bb\'fa\'bf\'c6\'d1\'a7\'b5\'c4\'d0\'cb\'c8\'a4\'a3\'bb
\f0 B 
\f1 \'b0\'ef\'d6\'fa\'b4\'f3\'bc\'d2\'bd\'a8\'c1\'a2\'c6\'f0\'d1\'a7\'cf\'b0\'bc\'c6\'cb\'e3\'bb\'fa\'bf\'c6\'d1\'a7\'cb\'f9\'d0\'e8\'d2\'aa\'b5\'c4
\f0 \'93
\f1 \'b1\'b3\'be\'b0\'d6\'aa\'ca\'b6\'bf\'f2\'bc\'dc
\f0 \'94
\f1 \'a1\'a3
\f0 </p>\\n<p>\'a0\'a0\'a0 
\f1 \'d4\'da
\f0 C
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'bb\'f9\'b4\'a1\'b2\'bf\'b7\'d6\'a3\'ac\'ce\'d2\'c3\'c7\'bd\'ab
\f0 <b>
\f1 \'d2\'d4
\f0 \'93C 
\f1 \'d3\'ef\'d1\'d4
\f0 \'94
\f1 \'ce\'aa\'d6\'f7\'d2\'aa\'d1\'a7\'cf\'b0\'b6\'d4\'cf\'f3\'a3\'ac\'d2\'d4\'b5\'e4\'d0\'cd\'b5\'c4
\f0 C++
\f1 \'b1\'e0\'b3\'cc\'bb\'b7\'be\'b3\'a3\'a8\'c8\'e7
\f0 Visual Studio C++, Eclipse
\f1 \'b5\'c8\'a3\'a9\'ce\'aa\'b9\'a4\'be\'df\'a3\'ac\'d1\'a7\'cf\'b0\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b5\'c4\'cf\'e0\'b9\'d8\'d6\'aa\'ca\'b6
\f0 </b>
\f1 \'a3\'ac\'b2\'a2\'c5\'e0\'d1\'f8\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b5\'c4\'bb\'f9\'b1\'be\'bc\'bc\'c4\'dc\'a1\'a3\'cd\'a8\'cb\'d7\'bd\'b2\'a3\'ac\'d4\'da\'d5\'e2\'b8\'f6\'b2\'bf\'b7\'d6\'a3\'ac\'ce\'d2\'c3\'c7\'bd\'ab\'bd\'cc\'bb\'e1\'b4\'f3\'bc\'d2
\f0 \'93
\f1 \'c8\'e7\'ba\'ce\'ca\'b9\'d3\'c3
\f0 C
\f1 \'d3\'ef\'d1\'d4\'b1\'e0\'d0\'b4\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'a3\'ac\'c9\'f5\'d6\'c1\'b1\'e0\'d0\'b4\'be\'df\'d3\'d0\'d2\'bb\'b6\'a8\'bc\'bc\'ca\'f5\'c4\'d1\'b6\'c8\'b5\'c4\'b3\'cc\'d0\'f2
\f0 \'94
\f1 \'a1\'a3
\f0 </p>\\n<p>\'a0\'a0\'a0 
\f1 \'b6\'d4\'d3\'da\'b5\'da\'d2\'bb\'b4\'ce\'d1\'a7\'cf\'b0\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b5\'c4\'cd\'ac\'d1\'a7\'b6\'f8\'d1\'d4\'a3\'ac\'cd\'a8\'b3\'a3\'bb\'e1\'be\'f5\'b5\'c3\'d1\'a7\'cf\'b0\'b9\'fd\'b3\'cc\'b1\'c8\'bd\'cf\'c0\'a7\'c4\'d1\'a1\'a3\'d4\'da\'d5\'e2\'c0\'ef\'a3\'ac\'ce\'d2\'c3\'c7\'cc\'d8\'b1\'f0\'cc\'e1\'ca\'be\'b4\'f3\'bc\'d2\'a3\'ba
\f0 \'93
\f1 \'b6\'d4\'d3\'da\'c4\'d1\'d1\'a7\'b5\'c4\'b6\'ab\'ce\'f7\'a3\'ac\'b8\'fc\'d2\'aa\'d1\'ad\'d0\'f2\'bd\'a5\'bd\'f8\'a3\'ac\'b8\'fc\'d2\'aa\'d7\'f1\'d1\'ad\'d1\'a7\'cf\'b0\'b9\'e6\'c2\'c9
\f0 \'97\'97
\f1 \'cf\'c8\'b4\'f2\'ba\'c3\'bb\'f9\'b4\'a1\'a3\'ac\'d6\'f0\'b2\'bd\'bd\'f8\'bd\'d7\'a3\'a1
\f0 \'94
\f1 \'ce\'aa\'b4\'cb\'a3\'ac
\f0 <b>
\f1 \'ce\'d2\'c3\'c7\'b0\'d1
\f0 \'93
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'bb\'f9\'b4\'a1
\f0 \'94
\f1 \'b2\'bf\'b7\'d6\'b5\'c4\'d1\'a7\'cf\'b0\'bb\'ae\'b7\'d6\'ce\'aa\'cb\'c4\'b8\'f6\'b5\'fc\'b4\'fa\'d6\'dc\'c6\'da
\f0 </b>
\f1 \'a3\'ba
\f0 </p>\\n<p><b>\'a0\'a0\'a0\'a0\'a0\'a0\'a0 
\f1 \'d6\'dc\'c6\'da\'d2\'bb
\f0 </b>
\f1 \'a3\'ba
\f0  
\f1 \'b8\'d0\'d0\'d4\'c8\'cf\'ca\'b6\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'a3\'bb
\f0 \\n    <br><b>\'a0\'a0\'a0\'a0\'a0\'a0\'a0 
\f1 \'d6\'dc\'c6\'da\'b6\'fe
\f0 </b>
\f1 \'a3\'ba
\f0  
\f1 \'c0\'ed\'d0\'d4\'c8\'cf\'ca\'b6\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'d3\'ef\'d1\'d4\'a3\'bb
\f0 \'a0\\n    <br><b>\'a0\'a0\'a0\'a0\'a0\'a0\'a0 
\f1 \'d6\'dc\'c6\'da\'c8\'fd
\f0 </b>
\f1 \'a3\'ba
\f0  
\f1 \'d1\'a7\'bb\'e1\'ca\'b9\'d3\'c3
\f0 \'97\'97
\f1 \'ba\'af\'ca\'fd\'a3\'bb
\f0 \\n    <br><b>\'a0\'a0\'a0\'a0\'a0\'a0\'a0 
\f1 \'d6\'dc\'c6\'da\'cb\'c4
\f0 </b>
\f1 \'a3\'ba
\f0  
\f1 \'d1\'a7\'cf\'b0\'ca\'b9\'d3\'c3
\f0 C
\f1 \'b3\'cc\'d0\'f2\'d6\'d0\'b5\'c4\'b8\'b4\'d4\'d3\'b3\'c9\'b7\'d6\'a3\'a8\'d6\'b8\'d5\'eb\'a1\'a2\'bd\'e1\'b9\'b9\'cc\'e5\'a1\'a2\'c1\'b4\'b1\'ed\'a1\'a2\'ce\'c4\'bc\'fe\'b5\'c8\'a3\'a9\'a3\'bb
\f0 </p>\\n<p>\'a0\'a0\'a0 
\f1 \'d6\'ae\'cb\'f9\'d2\'d4\'b3\'c6\'ce\'aa
\f0 \'93
\f1 \'b5\'fc\'b4\'fa\'d6\'dc\'c6\'da
\f0 \'94
\f1 \'a3\'ac\'ca\'c7\'d2\'f2\'ce\'aa
\f0 <b>
\f1 \'ce\'d2\'c3\'c7\'cf\'a3\'cd\'fb\'d4\'da\'c3\'bf\'b8\'f6\'d6\'dc\'c6\'da\'d6\'d0\'a3\'ac\'cd\'ac\'d1\'a7\'c3\'c7\'b6\'bc\'c4\'dc\'b9\'bb\'b1\'e0\'d0\'b4\'b3\'f6\'cd\'ea\'d5\'fb\'a1\'a2\'bf\'c9\'d4\'cb\'d0\'d0\'a1\'a2\'c4\'dc\'bd\'e2\'be\'f6\'ce\'ca\'cc\'e2\'b5\'c4\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'a3\'ac\'b6\'f8\'b2\'bb\'ca\'c7\'bd\'f6\'bd\'f6\'d1\'a7\'cf\'b0\'bc\'c6\'cb\'e3\'bb\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'d3\'ef\'d1\'d4\'b5\'c4\'c4\'b3\'b8\'f6\'b2\'bf\'b7\'d6\'a3\'a1
\f0 </b>
\f1 \'cb\'f9\'d2\'d4\'a3\'ac\'d1\'a7\'cf\'b0\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b5\'c4\'b9\'fd\'b3\'cc\'a3\'ac\'d3\'a6\'b8\'c3\'ca\'c7\'d2\'bb\'b8\'f6
\f0 <b>\'93
\f1 \'d4\'da\'ca\'b5\'d5\'bd\'d6\'d0\'bd\'f8\'bd\'d7
\f0 \'94
\f1 \'b5\'c4\'b9\'fd\'b3\'cc\'a3\'ac\'b6\'f8\'b2\'bb\'ca\'c7\'d2\'bb\'b8\'f6
\f0 \'93
\f1 \'d6\'aa\'ca\'b6\'b6\'d1\'c6\'f6
\f0 \'94
\f1 \'b5\'c4\'b9\'fd\'b3\'cc
\f0 </b>
\f1 \'a1\'a3\'cf\'a3\'cd\'fb\'d5\'e2\'b8\'f6\'b5\'fc\'b4\'fa\'bd\'f8\'bd\'d7\'b5\'c4\'d1\'a7\'cf\'b0\'b9\'fd\'b3\'cc\'bf\'c9\'d2\'d4\'b0\'ef\'d6\'fa\'b4\'f3\'bc\'d2\'cb\'b3\'c0\'fb\'b4\'ef\'b3\'c9\'d1\'a7\'cf\'b0\'c4\'bf\'b1\'ea\'a1\'a3
\f0 </p><p>
\f1 \'b8\'c3\'bf\'ce\'b3\'cc\'ca\'c7
\f0 \'93
\f1 \'b1\'b1\'b4\'f3
\f0 -
\f1 \'b5\'c2\'b5\'be\'cd\'f8\'c2\'e7\'b9\'ab\'bf\'aa\'bf\'ce\'b3\'cc
\f0 \'94
\f1 \'d6\'d0\'b5\'c4\'d2\'bb\'c3\'c5\'a3\'ac\'d3\'c9\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'d3\'eb\'b5\'c2\'b5\'be\'bd\'cc\'d3\'fd\'c1\'aa\'ba\'cf\'cc\'e1\'b9\'a9\'a1\'a3
\f0 \'a0\\n    <br>\\n</p>"\
    ],\
    "__v" : 0\
\}\
\
/* 27 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3062"),\
    "id" : "179",\
    "shortName" : "netsysbio",\
    "name" : "Network Analysis in Systems Biology",\
    "url" : "https://www.coursera.org/course/netsysbio",\
    "about" : [ \
        "<div>The course Network Analysis in Systems Biology provides an introduction to Big Data analysis in systems biology including statistical methods used to identify differentially expressed genes, performing various types of enrichment analyses, and applying clustering algorithms. You will also learn how to construct, analyze and visualize functional association networks that can be created from many resources, including gene regulatory networks connecting transcription factors to their target genes, protein-protein interaction networks, cell signaling pathways and networks, drug-target and drug-drug similarity networks and other functional association networks. Methods to process raw data from genome-wide mRNA expression (microarrays and RNA-seq) will be presented. Processed data will be clustered, and gene-set enrichment analyses methods will be covered. The course is mostly about practical tutorials for analyzing various high content experimental datasets, but it also contains theoretical discussions about the mathematics behind the methods and tools. The course is mostly appropriate for beginning graduate students and advanced undergraduates majoring in fields such as biology but also math, physics, chemistry, computer science, biomedical and electrical engineering. The course will be useful for researchers who encounter large datasets in their own research, typically genome-wide. The course will teach how to use existing software tools such as those developed by the&nbsp;<a href=\\"http://icahn.mssm.edu/research/labs/maayan-laboratory\\" target=\\"_blank\\">Ma\'92ayan Laboratory at Mount Sinai</a>, but also other freely available tools. In addition, you will have the opportunity to participate in crowdsourcing micro- and mega-task projects. The ultimate aim of the course is to enable you to utilize the methods you learn here for analyzing your own data for your own projects, as well as think about the problems we face in the field of computational systems biology.</div>"\
    ],\
    "__v" : 0\
\}\
\
/* 28 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3069"),\
    "id" : "233",\
    "shortName" : "programdesign",\
    "name" : "Introduction to Systematic Program Design - Part 1",\
    "url" : "https://www.coursera.org/course/programdesign",\
    "about" : [ \
        "<p>Phones, diesel engines, animated newspapers, medical devices, games, political\\n    campaigns, medical research, mining, transportation systems, ... and so\\n    on, and on, and on... every day more of the world around us is at least\\n    partly run by computer programs. This means that being able to design programs\\n    - or at least be able to work with people who design programs - is becoming\\n    a more and more valuable skill.</p>\\n<p>To build your own programs you need to know two things: how to use the\\n    specific programming language and libraries needed, and the more general\\n    skill of how to design a program.</p>\\n<p>This course presents a <b>design method</b> that will enable you to approach\\n    the design of complex programs systematically. The method will work for\\n    programs in this course as well as hard to design programs you develop\\n    in the future.</p>\\n<p>Using this method you will learn how to model the information in a problem\\n    domain, how to structure program data to mirror that information and how\\n    to further structure the data to lead to a well organized program. You\\n    will also learn to distinguish those parts of a program that are naturally\\n    data driven, from those that should use an alternative algorithmic approach.\\n    The method uses unit-tests to both produce a better developed design, and\\n    to test your program as you develop it.</p>\\n<p>In the first course -- Part 1 -- we use a simple\\n    teaching language to cover the core of the design method. In Part 1 we cover various forms of data; simple interactive programs like games and animations; storing information in and rendering trees; and finally exploring search programs: programs that solve puzzles like Sudoku boards.&nbsp;</p><p>A second phase of the course, to be offered later, &nbsp;will consist of parallel tracks, with each track using a different popular\\n    programming language and focusing on a different kind of problem. This\\n    will help you bring the design method to whatever language and problem\\n    domain interests you.<br></p>"\
    ],\
    "__v" : 0,\
    "level" : 2\
\}\
\
/* 29 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3073"),\
    "id" : "948",\
    "shortName" : "webapplications",\
    "name" : "Web Application Architectures",\
    "url" : "https://www.coursera.org/course/webapplications",\
    "about" : [ \
        "<b>This course explores the development of web application architectures from an engineering perspective.</b>&nbsp; We will consider the fundamental design patterns and philosophies associated with modern web application architectures, along with their major components. &nbsp;By the end of this course, I expect you to be able to:<br><ul><li><b></b><b></b><b></b><b></b><b>Design, develop and deploy a modern web application. </b>&nbsp;This course is <i>not</i> about how to build a pretty web page, it's about how to build and deploy the full stack of protocols and technologies associated with a complete web app. &nbsp;That said, it is not possible for you to become an expert in this area in a few weeks. My goal, rather, is to put you on the right path by providing a solid foundation and framework for understanding web applications, allowing you to dig deeper and learn more on your own. The next bullet points describe how we're going to do this.</li><li><b>Understand the major architectural components in web apps, and how they fit together.</b> &nbsp;Modern web apps are complex. &nbsp;A typical application has a database along with numerous scripts on one end of the web stack, a web server in the middle that delivers information over the Internet, and a user's browser on the other end of the web stack. &nbsp;Even getting started in trying to understand these components can be overwhelming. Consider just the programming languages involved in a typical web stack: from the database (SQL), to the web server (scripting language), to the browser (JavaScript, HTML, CSS), we're dealing with five different programming languages, not to mention the protocols they're operating over\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\'96&nbsp;and you need to know a little about them too! We'll introduce a number of software design patterns throughout the course that are aimed at helping you to manage this complexity.</li><li><b>Use Ruby on Rails.</b> &nbsp;We're going to learn about web apps through the Ruby on Rails framework.&nbsp;\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\nRails is a framework for creating web\\napplications that is built on top of the Ruby programming language.&nbsp;I believe this is one of the best frameworks\\nfor learning about web applications, and it's also proving highly successful as\\na platform for commercial offerings.&nbsp;\\nThat said, there are many other frameworks available, and the concepts\\nyou will learn using Rails are transferable to these other frameworks.</li><li>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<b>Better understand modern software engineering\\npractice.&nbsp; </b>We\'92ll be using the latest tools and practices in\\nsoftware development, source code control, testing, and application\\ndeployment.&nbsp;This will include exposure\\nto agile development practices, the numerous tools that software engineers are expected to know how to use, and the cloud-based resources that are\\nbecoming increasingly important in web applications.&nbsp; &nbsp;&nbsp;&nbsp;&nbsp;</li></ul>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "ruby", \
        "html"\
    ]\
\}\
\
/* 30 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b307f"),\
    "id" : "1374",\
    "shortName" : "aoo",\
    "name" : "
\f1 \'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'bc\'bc\'ca\'f5\'b8\'df\'bc\'b6\'bf\'ce\'b3\'cc\'a3\'a8
\f0 The Advanced Object-Oriented Technology
\f1 \'a3\'a9
\f0 ",\
    "url" : "https://www.coursera.org/course/aoo",\
    "about" : [ \
        "<p>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'bf\'c9\'d2\'d4\'b7\'c3\'ce\'ca
\f0 <a href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/01/23/332113_hd.mp4\\" target=\\"_blank\\">
\f1 \'d5\'e2\'c0\'ef
\f0 </a>
\f1 \'a1\'a3
\f0 </p>\\n<ul>\\n    <li>\\n\\n<p>
\f1 \'a1\'be\'bf\'ce\'b3\'cc\'bc\'f2\'bd\'e9\'a1\'bf\'b5\'da\'b6\'fe\'b4\'ce
\f0 MOOC
\f1 \'bf\'aa\'bf\'ce\'bd\'e9\'c9\'dc
\f0 </p>\\n\\n<p><i>
\f1 \'c8\'e7\'b9\'fb\'bd\'ab\'c8\'ed\'bc\'fe\'bf\'aa\'b7\'a2\'c8\'cb\'d4\'b1\'bf\'b4\'d7\'f7\'d0\'d0\'d7\'df\'bd\'ad\'ba\'fe\'b5\'c4\'ce\'e4\'cf\'c0\'a3\'ac\'c4\'c7\'c3\'b4\'b8\'f7\'d6\'d6\'c8\'ed\'bc\'fe\'bf\'aa\'b7\'a2\'bc\'bc\'ca\'f5\'be\'cd\'ca\'c7\'ce\'e4\'cf\'c0\'c0\'b5\'d2\'d4\'b0\'f8\'c9\'ed\'b5\'c4\'ce\'e4\'ca\'f5\'c3\'d8\'bc\'ae\'a1\'a3\'d3\'d0\'b5\'c4\'c3\'d8\'bc\'ae\'d2\'d4\'d2\'d7\'d1\'a7\'c1\'e9\'c7\'c9\'bc\'fb\'b3\'a4\'a3\'ac\'c1\'b7\'cf\'b0\'d5\'df\'ba\'dc\'bf\'ec\'d5\'c6\'ce\'d5\'a3\'ac\'b2\'a2\'d3\'d0\'c1\'a2\'b8\'cd\'bc\'fb\'d3\'b0\'b5\'c4\'b9\'a6\'d0\'a7\'a3\'ac\'b5\'ab\'ca\'a7\'d6\'ae\'ba\'f1\'d6\'d8\'b3\'d6\'be\'c3\'a3\'bb\'d3\'d0\'b5\'c4\'c3\'d8\'bc\'ae\'b3\'f5\'d1\'a7\'d5\'a7\'c1\'b7\'b6\'d9\'cf\'d4\'c0\'a7\'c4\'d1\'a3\'ac\'cb\'e4\'da\'a4\'cb\'bc\'bf\'e0\'bd\'e2\'c8\'d4\'b2\'bb\'b5\'c3\'d2\'aa\'c1\'ec\'a3\'ac\'d0\'e8\'bc\'e1\'b3\'d6\'b2\'bb\'b6\'cf\'b5\'c4\'c4\'da\'b9\'a6\'d0\'de\'c1\'b6\'b7\'bd\'b3\'c9\'d5\'fd\'b9\'fb\'a3\'ac\'c8\'b4\'ca\'c7\'b3\'c9\'ce\'aa\'ce\'e4\'c1\'d6\'b4\'f3\'cf\'c0\'b1\'d8\'b1\'b8\'b5\'c4\'d6\'c1\'b1\'a6\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'d3\'d0\'d0\'a9\'c0\'e0\'cb\'c6\'d3\'da\'ba\'f3\'d5\'df\'a1\'a3
\f0 </i></p>\\n\\n<p>
\f1 \'a1\'b6\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'bc\'bc\'ca\'f5\'b8\'df\'bc\'b6\'bf\'ce\'b3\'cc\'a1\'b7\'c9\'ee\'c8\'eb\'a1\'a2\'cf\'b5\'cd\'b3\'a1\'a2\'cd\'ea\'d5\'fb\'b5\'d8\'bd\'b2\'bd\'e2\'b5\'b1\'bd\'f1\'d6\'f7\'c1\'f7\'b5\'c4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'c8\'ed\'bc\'fe\'bf\'aa\'b7\'a2\'b7\'bd\'b7\'a8\'b5\'c4\'b7\'d6\'ce\'f6\'a1\'a2\'c9\'e8\'bc\'c6\'a1\'a2\'ca\'b5\'cf\'d6\'bc\'b0\'d6\'d8\'b9\'b9\'b7\'bd\'b7\'a8\'a3\'ac\'c9\'ee\'c8\'eb\'bd\'b2\'bd\'e2
\f0 UML
\f1 \'d3\'ef\'d1\'d4\'b5\'c4\'b8\'df\'bc\'b6\'bc\'bc\'ca\'f5\'cf\'b8\'bd\'da\'a3\'ac\'d2\'d4\'bc\'b0\'bd\'fc\'c4\'ea\'c0\'b4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b7\'bd\'b7\'a8\'d7\'ee\'d0\'c2\'b5\'c4\'b7\'a2\'d5\'b9\'c7\'f7\'ca\'c6\'a1\'a3\'bf\'ce\'b3\'cc\'bc\'af\'b0\'d9\'bc\'d2\'d6\'ae\'cb\'f9\'d1\'d4\'a3\'ac\'b2\'a2\'bd\'e1\'ba\'cf\'d6\'f7\'bd\'b2\'d5\'df\'d7\'ee\'d0\'c2\'b5\'c4\'d1\'d0\'be\'bf\'b3\'c9\'b9\'fb\'a3\'ac\'b2\'a2\'cd\'a8\'b9\'fd\'b4\'f3\'c1\'bf\'a1\'a2\'b7\'e1\'b8\'bb\'a1\'a2\'cd\'ea\'d5\'fb\'a1\'a2\'b2\'bb\'cd\'ac\'c1\'ec\'d3\'f2\'a1\'a2\'d3\'a6\'d3\'c3\'b2\'bb\'cd\'ac\'bc\'bc\'ca\'f5\'b5\'c4\'b0\'b8\'c0\'fd\'bd\'ab\'c6\'e4\'d6\'d0\'b5\'c4\'b9\'d8\'bc\'fc\'d6\'aa\'ca\'b6\'b5\'e3\'b4\'ae\'c1\'aa\'c6\'f0\'c0\'b4\'a3\'ac\'b1\'e3\'d3\'da\'c0\'ed\'bd\'e2\'ba\'cd\'d3\'a6\'d3\'c3\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'b2\'a2\'b2\'bb\'be\'d0\'cf\'de\'d3\'da\'c4\'b3\'d2\'bb\'cc\'d8\'b6\'a8\'b5\'c4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b5\'c4\'b1\'e0\'b3\'cc\'d3\'ef\'d1\'d4\'b5\'c4\'b1\'e0\'b3\'cc\'bc\'bc\'c7\'c9\'a3\'ac\'b5\'ab\'c8\'b4\'b0\'fc\'ba\'ac\'c1\'cb\'bb\'f9\'d3\'da\'b5\'b1\'c7\'b0\'d6\'f7\'c1\'f7\'b5\'c4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b1\'e0\'b3\'cc\'d3\'ef\'d1\'d4\'b5\'c4\'b6\'e0\'cf\'ee\'cd\'ea\'d5\'fb\'b0\'b8\'c0\'fd\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'d2\'fd\'b5\'bc\'d1\'a1\'bf\'ce\'cd\'ac\'d1\'a7\'b4\'d3\'b8\'fc\'ce\'aa\'b3\'e9\'cf\'f3\'ba\'cd\'b9\'b2\'d0\'d4\'b5\'c4\'c4\'a3\'d0\'cd\'bd\'c7\'b6\'c8\'c3\'e8\'ca\'f6\'cf\'d6\'ca\'b5\'ca\'c0\'bd\'e7\'ba\'cd\'c8\'ed\'bc\'fe\'ca\'c0\'bd\'e7
\f0 ,
\f1 \'bc\'b4\'b9\'b9\'bd\'a8\'b7\'d6\'ce\'f6\'d3\'eb\'c9\'e8\'bc\'c6\'c4\'a3\'d0\'cd\'a3\'ac\'d6\'ae\'ba\'f3\'d4\'d9\'bd\'ab\'c6\'e4\'c2\'e4\'ca\'b5\'b5\'bd\'c8\'ed\'bc\'fe\'b1\'e0\'b3\'cc\'ca\'b5\'cf\'d6\'a1\'a3\'d5\'e2\'d6\'d6\'b9\'a4\'b3\'cc\'bb\'af\'b5\'c4\'c0\'ed\'c4\'ee\'b6\'d4\'d3\'da\'bf\'aa\'b7\'a2\'b4\'f3\'d0\'cd\'a1\'a2\'b8\'b4\'d4\'d3\'a1\'a2\'c0\'a7\'c4\'d1\'a1\'a2\'d8\'fc\'b9\'d8\'c8\'ed\'bc\'fe\'cf\'b5\'cd\'b3\'ca\'c7\'b7\'c7\'b3\'a3\'b1\'d8\'d2\'aa\'b5\'c4\'a3\'ac\'d2\'b2\'ca\'c7\'d7\'f7\'ce\'aa\'b8\'df\'bc\'b6\'b3\'cc\'d0\'f2\'d4\'b1\'a1\'a2\'cf\'b5\'cd\'b3\'b7\'d6\'ce\'f6\'ca\'a6\'a1\'a2\'c8\'ed\'bc\'fe\'bc\'dc\'b9\'b9\'ca\'a6\'b5\'c8\'b8\'df\'bc\'b6\'c8\'ed\'bc\'fe\'bc\'bc\'ca\'f5\'d6\'b0\'ce\'bb\'cb\'f9\'b1\'d8\'d0\'e8\'be\'df\'d3\'d0\'b5\'c4\'cb\'d8\'d6\'ca\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'d7\'f7\'ce\'aa\'d2\'bb\'c3\'c5\'c3\'e6\'cf\'f2\'b9\'e3\'b4\'f3\'ca\'dc\'d6\'da\'b5\'c4\'d6\'d0\'ce\'c4
\f0 MOOC
\f1 \'bf\'ce\'b3\'cc\'a3\'ac\'b1\'be\'b4\'ce\'bf\'ce\'b3\'cc\'c1\'a6\'c7\'f3\'cf\'f2\'b2\'bb\'cd\'ac\'d0\'e8\'c7\'f3\'ba\'cd\'b1\'b3\'be\'b0\'b5\'c4\'c5\'f3\'d3\'d1\'b3\'ca\'cf\'d6\'d6\'d0\'bb\'aa\'ce\'c4\'bb\'af\'b7\'d5\'ce\'a7\'a1\'a2\'c9\'fa\'b6\'af\'d3\'d0\'c8\'a4\'b5\'c4\'b0\'b8\'c0\'fd\'a1\'a2\'bf\'e7\'d7\'a8\'d2\'b5\'b5\'c4\'b9\'e3\'c0\'ab\'b5\'c4\'ca\'d3\'d2\'b0\'a1\'a2\'d2\'d4\'bc\'b0\'c9\'ee\'c8\'eb\'ca\'b5\'d3\'c3\'b5\'c4\'bc\'bc\'ca\'f5\'d7\'db\'ba\'cf\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'cd\'ac\'ca\'b1\'d7\'f7\'ce\'aa\'d2\'bb\'c3\'c5\'b4\'ab\'ca\'da\'c8\'ed\'bc\'fe\'d7\'a8\'c3\'c5\'d6\'aa\'ca\'b6\'b5\'c4
\f0 MOOC
\f1 \'bf\'ce\'b3\'cc\'a3\'ac\'b1\'be\'b4\'ce\'bf\'ce\'b3\'cc\'bd\'ab\'ce\'aa\'be\'df\'d3\'d0\'b1\'e0\'b3\'cc\'c4\'dc\'c1\'a6\'b5\'c4\'cd\'ac\'d1\'a7\'b4\'f8\'c0\'b4\'d3\'d0\'c8\'a4\'b5\'c4\'c8\'ed\'bc\'fe\'bf\'aa\'b7\'a2\'cf\'ee\'c4\'bf\'d7\'f7\'d2\'b5\'a3\'ac\'d4\'da\'ca\'b5\'bc\'ca\'b5\'c4\'c8\'ed\'bc\'fe\'bf\'aa\'b7\'a2\'d6\'d0\'b8\'d0\'ca\'dc\'d1\'a7\'d2\'d4\'d6\'c2\'d3\'c3\'b5\'c4\'bf\'ec\'c0\'d6\'a3\'ac\'cc\'e5\'bb\'e1\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b7\'bd\'b7\'a8\'d1\'a7\'b5\'c4\'c9\'ee\'bf\'cc\'c4\'da\'ba\'ad\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'b1\'be\'b4\'ce\'bf\'ce\'b3\'cc\'c8\'d4\'bd\'ab\'d1\'fb\'c7\'eb\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'c1\'ec\'d3\'f2\'d6\'f8\'c3\'fb\'d1\'a7\'d5\'df\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'d0\'c5\'cf\'a2\'bf\'c6\'d1\'a7\'bc\'bc\'ca\'f5\'d1\'a7\'d4\'ba\'c9\'db\'ce\'ac\'d6\'d2\'bd\'cc\'ca\'da\'ba\'cd\'c2\'e9\'d6\'be\'d2\'e3\'b8\'b1\'bd\'cc\'ca\'da\'bd\'b2\'bd\'e2\'c4\'b3\'d0\'a9\'d5\'c2\'bd\'da\'a3\'ac\'b2\'a2\'b6\'d4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b7\'bd\'b7\'a8\'d1\'a7\'d6\'d0\'b5\'c4\'c4\'b3\'d0\'a9\'b9\'d8\'bc\'fc\'ce\'ca\'cc\'e2\'bd\'f8\'d0\'d0\'cc\'d6\'c2\'db\'a1\'a3
\f0 </p>\\n\\n</li>\\n\\n</ul>"\
    ],\
    "__v" : 0\
\}\
\
/* 31 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3077"),\
    "id" : "1382",\
    "shortName" : "hardwaresec",\
    "name" : "Hardware Security",\
    "url" : "https://www.coursera.org/course/hardwaresec",\
    "about" : [ \
        "<span><p>Hardware is the root of computation and communication. It is the enabler of any software, algorithm, or communication protocols. All the computation will eventually be carried out by hardware, namely the processor or the circuits.<br></p><p>In this course, we will study security and trust from the hardware perspective. We will start with a short survey of the roles of hardware in security and trust. With all types of dedicated hardware/circuits, known as co-processors, being developed to speed up application specific computations, hardware\'92s role changes from the enabler to an enhancer. Nowadays, hardware becomes the enforcer for secure systems because it is used to ensure that only the authenticated user and software can access the processor. However, current hardware design flow does not have security as a key design objective. Consequently, we will conduct several case studies where hardware turns into the weakest link in secure systems. </p><p> </p><p>Then we will review the fundamentals of digital logic design and use this as an example to analyze the source of security vulnerabilities and demonstrate how these vulnerabilities can become legitimate security threats. We conclude with the basic principles and practical methods of design for security and trust, as well as a study of the associated design cost. &nbsp;</p><p>Next, we introduce physical attacks to popular digital systems such as smart cards and FPGA-based systems. We will focus on side-channel attacks, which have been demonstrated many times to be able to successfully reveal the secret cryptographic keys stored in the secure systems. These attacks include power analysis, timing attacks, and electromagnetic attacks. Standard countermeasures to these attacks will also be introduced.</p><p> </p><p>Finally we will learn the new hardware security primitives that can help us to build secure systems. We will see how the trust platform module (TPM) works; what is a silicon physical unclonable function (PUF) and why it is useful for system security; what is a hardware Trojan horse and the security threats it brings to the system; why counterfeiting becomes a serious problem for hardware design intellectual property protection.</p><p> </p><p>Upon completing the course, students will understand the vulnerabilities in current digital system design flow and the physical attacks to these systems. They will learn that security starts from hardware design and be familiar with the tools and skills to build secure and trusted hardware. </p><div><br></div></span>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "security"\
    ]\
\}\
\
/* 32 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3076"),\
    "id" : "471",\
    "shortName" : "bioinformatics",\
    "name" : "Bioinformatics Algorithms (Part 1) ",\
    "url" : "https://www.coursera.org/course/bioinformatics",\
    "about" : [ \
        "<p>The sequencing of the&nbsp;human genome fueled a computational revolution\\n    in biology. As a result, modern biology produces as many new&nbsp;algorithms\\n    as any other fundamental realm of&nbsp;science. &nbsp;Accordingly, the newly formed&nbsp;links\\n    between computer science and biology affect the way we teach applied algorithms to computer\\n    scientists.</p><p>This course has now been split into three smaller pieces:</p><ul><li><a href=\\"http://coursera.org/course/hiddenmessages\\" target=\\"_blank\\" title=\\"Link: http://coursera.org/course/hiddenmessages\\">Finding Hidden Messages in DNA</a>: This course begins a series of classes illustrating the power of computing in modern biology. Please join us on the frontier of bioinformatics to look for hidden messages in DNA without ever needing to put on a lab coat. After warming up our algorithmic muscles, we will learn how randomized algorithms can be used to solve problems in bioinformatics.<br></li><li><a href=\\"http://coursera.org/course/assembly\\" target=\\"_blank\\" title=\\"Link: http://coursera.org/course/assembly\\">Assembling Genomes and Sequencing Antibiotics</a>: Biologists still cannot read the nucleotides of an entire genome or the amino acids of an antibiotic as you would read a book from beginning to end. However, they can read short pieces of DNA and weigh small antibiotic fragments. In this course, we will see how graph theory and brute force algorithms can be used to reconstruct genomes and antibiotics.<br></li><li><a href=\\"http://coursera.org/course/comparinggenomes\\" target=\\"_blank\\" title=\\"Link: http://coursera.org/course/comparinggenomes\\">Comparing Genes, Proteins, and Genomes</a>: After sequencing genomes, we would like to compare them. We will see that dynamic programming is a powerful algorithmic tool when we compare two genes or two proteins. When we \\"zoom out\\" to compare entire genomes, we will employ combinatorial algorithms.</li></ul>\\n<p>Each course parallels two chapters from a&nbsp;<a href=\\"http://bioinformaticsalgorithms.com\\" target=\\"_blank\\" title=\\"Link: http://bioinformaticsalgorithms.com\\">textbook</a> covering a single biological question and slowly builds the algorithmic knowledge required to address this challenge. &nbsp;Along the way, coding challenges and exercises (many of which ask you to apply your skills to real&nbsp;genetic data) will be directly integrated into the text at the exact moment they are needed.<br></p>"\
    ],\
    "__v" : 0\
\}\
\
/* 33 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3087"),\
    "id" : "419",\
    "shortName" : "cic",\
    "name" : "Creativity, Innovation, and Change | 
\f1 \'b4\'b4\'d2\'e2\'a3\'ac\'b4\'b4\'d0\'c2
\f0 , 
\f1 \'d3\'eb
\f0  
\f1 \'b1\'e4\'b8\'ef
\f0 ",\
    "url" : "https://www.coursera.org/course/cic",\
    "about" : [ \
        "<p dir=\\"ltr\\"> In 2013, over 130,000 people from more than 190 countries came together in this  MOOC to explore creativity, innovation, and change. </p>\\n\\n\\n\\n\\n\\n <p dir=\\"ltr\\">What did we DO? <br></p><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n<p></p>\\n<p dir=\\"ltr\\">We discovered creative uniqueness through Creative Diversity.</p><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n <p></p><p dir=\\"ltr\\">We used Intelligent Fast Failure to build innovative skills.</p><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n<p></p><p dir=\\"ltr\\">And we applied CENTER principles to drive personal change. <br></p><p dir=\\"ltr\\"></p><br>That was CIC 1.0, and it was a BLAST! <br><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n<p></p><br><p dir=\\"ltr\\"> <img src=\\"http://i.imgur.com/K8nZM67.jpg\\" height=\\"80\\" width=\\"150\\" align=\\"left\\" hspace=\\"2\\">Now we\'92re back - and even better than before - with some new faces and fresh ideas to help you develop your creative potential, so you can enhance and transform your business, your community, and your personal life. <br></p><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n<p></p>\\n<p></p>\\n<p dir=\\"ltr\\">This is CIC 2.0 \'85 and we\'92re ready to ROCK!</p><p dir=\\"ltr\\"></p><p dir=\\"ltr\\">\\n\\n</p>\\n\\n<p></p>\\n<br>\\nLike our Facebook Page <a href=\\"http://on.fb.me/13iAQRM\\">here</a><br>\\nJoin our Google+ community <a target=\\"_blank\\" href=\\"http://bit.ly/14XEbVS\\">here</a><br><br>\\n\\n<p>2013
\f1 \'c4\'ea\'a3\'ac\'c0\'b4\'d7\'d4
\f0 190
\f1 \'b6\'e0\'b8\'f6\'b9\'fa\'bc\'d2\'b3\'ac\'b9\'fd
\f0 13
\f1 \'cd\'f2\'c8\'cb\'b2\'ce\'d3\'eb\'b5\'bd\'ce\'d2\'c3\'c7\'b5\'c4
\f0 MOOC
\f1 \'bf\'ce\'b3\'cc\'c0\'b4\'cc\'bd\'be\'bf\'b4\'b4\'d2\'e2\'a3\'ac\'b4\'b4\'d0\'c2\'a3\'ac\'d3\'eb\'b1\'e4\'b8\'ef\'b5\'c4\'b0\'c2\'c3\'d8\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'ce\'d2\'c3\'c7\'d7\'f6\'c1\'cb\'ca\'b2\'c3\'b4\'a3\'bf
\f0 </p>\\n\\n<p>
\f1 \'ce\'d2\'c3\'c7\'cd\'a8\'b9\'fd
\f0 \'93
\f1 \'b4\'b4\'d4\'ec\'b6\'e0\'d4\'aa\'bb\'af
\f0 \'93
\f1 \'c4\'a3\'d0\'cd\'b7\'a2\'cf\'d6\'c1\'cb\'b4\'b4\'d4\'ec\'c1\'a6\'b5\'c4\'cc\'d8\'b5\'e3
\f0 </p>\\n\\n<p>
\f1 \'ce\'d2\'c3\'c7\'d4\'cb\'d3\'c3
\f0 \'93
\f1 \'bf\'ec\'cb\'d9\'ca\'a7\'b0\'dc\'d6\'c7\'c4\'dc\'d3\'c5\'bb\'af
\f0 \'94
\f1 \'c0\'ed\'c2\'db\'b4\'b4\'bd\'a8\'b4\'b4\'d0\'c2\'d0\'d4\'bc\'bc\'c7\'c9
\f0 </p>\\n\\n<p>
\f1 \'ce\'d2\'c3\'c7\'b2\'c9\'d3\'c3
\f0 CENTER
\f1 \'c4\'a3\'d0\'cd\'cd\'c6\'b6\'af\'b8\'f6\'c8\'cb\'b5\'c4\'b8\'c4\'b1\'e4
\f0 </p>\\n\\n<p>&nbsp;</p>\\n\\n<p>
\f1 \'d2\'d4\'c9\'cf\'ca\'c7\'b5\'da\'d2\'bb\'b4\'fa\'b4\'b4\'d2\'e2\'a3\'ac\'b4\'b4\'d0\'c2\'a3\'ac\'d3\'eb\'b1\'e4\'b8\'ef\'bf\'ce\'b3\'cc\'a3\'ac
\f0  
\f1 \'ce\'d2\'c3\'c7\'b6\'d4\'cb\'fc\'b2\'a2\'b2\'bb\'c2\'fa\'d2\'e2\'a1\'a3
\f0 </p>\\n\\n<p>
\f1 \'c8\'e7\'bd\'f1\'ce\'d2\'c3\'c7\'bb\'d8\'c0\'b4\'c1\'cb\'a3\'ac\'bb\'b9\'b4\'f8\'c0\'b4\'c1\'cb\'d0\'c2\'cf\'ca\'c3\'e6\'bf\'d7\'d2\'d4\'bc\'b0\'c8\'ab\'d0\'c2\'b9\'db\'b5\'e3\'a3\'ac\'c0\'b4\'b0\'ef\'d6\'fa\'c4\'e3\'c5\'e0\'d1\'f8\'b4\'b4\'d0\'c2\'cb\'bc\'ce\'ac\'a3\'ac\'c8\'c3\'c4\'e3\'bf\'c9\'d2\'d4\'bd\'ab\'d6\'ae\'d7\'aa\'bb\'af\'d4\'cb\'d3\'c3\'b5\'bd\'c4\'e3\'b5\'c4\'ca\'c2\'d2\'b5\'a3\'ac\'bc\'af\'cc\'e5\'a3\'ac\'d2\'d4\'bc\'b0\'b8\'f6\'c8\'cb\'c9\'fa\'bb\'ee\'d6\'d0\'a1\'a3\'d5\'e2\'d2\'bb\'b4\'ce\'b5\'c4\'bb\'d8\'b9\'e9\'d6\'bb\'bb\'e1\'b8\'fc\'ba\'c3\'a1\'a3
\f0 </p>\\n\\n<p>&nbsp;</p>\\n\\n<p>
\f1 \'d5\'e2\'be\'cd\'ca\'c7\'c4\'e3\'c3\'c7\'cf\'d6\'d4\'da\'bf\'b4\'b5\'bd\'b5\'c4\'b4\'b4\'d2\'e2\'a3\'ac\'b4\'b4\'d0\'c2\'a3\'ac\'d3\'eb\'b1\'e4\'b8\'ef
\f0 2.0
\f1 \'a3\'ac\'c8\'c3\'ce\'d2\'c3\'c7\'d2\'bb\'c6\'f0\'b3\'c9\'be\'cd\'bb\'d4\'bb\'cd\'a3\'a1
\f0 </p>\\n\\n<br>"\
    ],\
    "__v" : 0\
\}\
\
/* 34 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308c"),\
    "id" : "2625",\
    "shortName" : "mobilecloudprogram",\
    "name" : "Programming Cloud Services for Android Handheld Systems: Spring",\
    "url" : "https://www.coursera.org/course/mobilecloudprogram",\
    "about" : [ \
        "<p dir=\\"ltr\\">This MOOC describes by example how to connect Android mobile devices to clouds via the use of object-oriented design techniques, Java programming language features,&nbsp;<a href=\\"http://www.eclipse.org/jetty/\\">Jetty</a>&nbsp;middleware,&nbsp;<a href=\\"http://www.oracle.com/technetwork/java/index-jsp-135475.html\\">Java Servlets</a>, the&nbsp;<a href=\\"http://projects.spring.io/spring-framework/\\">Java Spring Framework</a>, and&nbsp;<a href=\\"http://en.wikipedia.org/wiki/Cloud_computing\\" title=\\"Link: http://en.wikipedia.org/wiki/Cloud_computing\\">cloud computing platforms</a>, such as&nbsp;<a href=\\"https://developers.google.com/appengine/\\">Google App Engine</a>. Although there will be 10 weeks of lecture material, the required core of the course is six weeks long and can be completed flexibly within the ten week schedule to provide flexibility for students during the summer.</p><p dir=\\"ltr\\">An extended case study project will be used throughout the required core of the MOOC to showcase architectures for communicating with the cloud using HTTP, server-side processing of mobile data using servlets and the Java Spring Framework, and scalable storage of data using no-SQL databases and other platforms. Due to the importance of building secure and scalable mobile/cloud platforms, this MOOC will not only show you how to program handheld systems that talk to the cloud, but how to do so securely, scalably, and efficiently. Security and scalability topics will be woven into discussions of cloud service creation so that students learn, from the start, how to create robust cloud services for mobile devices.</p><p dir=\\"ltr\\">Four weeks of optional lecture material will also be provided for students who would like to gain a deeper understanding of the patterns and frameworks for building cloud infrastructure building. This material will be presented in the context of the open-source&nbsp;<a href=\\"http://www.dre.vanderbilt.edu/JAWS/\\">JAWS</a>&nbsp;web server, which is implemented in C++ as part of the&nbsp;<a href=\\"http://www.dre.vanderbilt.edu/ACE/\\">ACE</a>&nbsp;open-source object-oriented concurrent and networked programming toolkit.</p><p dir=\\"ltr\\">Although the cloud service topics in this course will be taught in the context of connecting mobile devices to the cloud, the concepts are broader and will give students the ability to create the cloud services to support large-scale web applications, such as social networking applications; cloud services for embedded systems, such as the Internet of Things and Industrial Internet; and wearable computing devices, such as Google Glass.</p><p dir=\\"ltr\\"><strong>The Mobile Cloud Computing with Android (MoCCA) Specialization</strong></p><p dir=\\"ltr\\">This is the <strong>5th course</strong>&nbsp;of the six-course&nbsp;<a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>. It has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, and includes a final \'93capstone\'94 project for those who earn Verified Certificates across all six courses.</p><p dir=\\"ltr\\"><strong>Note:&nbsp;</strong>We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe. In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers.</p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. For example, new sessions of my two introductory courses will be launched on a monthly basis, so that you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.</p><p dir=\\"ltr\\"><strong>For previous MoCCA students:</strong>&nbsp;If you have already earned a Verified Certificate in the previous version of this course, \\"Pattern-Oriented Software Architectures: Programming Mobile Services for Android Handheld Systems\'94 offered in May 2014, you do not need to retake this course to continue towards the Specialization certificate and final project in 2015. Please consult the&nbsp;<a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a>&nbsp;or contact the&nbsp;<a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a>&nbsp;if you are not sure whether you qualify.</p><p dir=\\"ltr\\">This MOOC and five others, taught by Dr. Adam Porter from the University of Maryland and Dr. Jules White from Vanderbilt University, have been designed to complement each other as part of the first trans-institution sequence of MOOCs taught on the Coursera platform, structured as follows:</p><ul><li><p dir=\\"ltr\\">The first two courses by Dr. Adam Porter, of the University of Maryland, are&nbsp;<a href=\\"https://www.coursera.org/course/androidpart1\\">Programming Mobile Applications for Android Handheld Systems Part 1</a>&nbsp;and&nbsp;<a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>. They focus on the design and programming of user-facing applications. &nbsp;</p></li><li><p dir=\\"ltr\\">The third and fourth courses by Dr. Douglas Schmidt, of Vanderbilt University, are&nbsp;<a href=\\"https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a>&nbsp;and&nbsp;<a href=\\"https://www.coursera.org/course/posacommunication\\">Communication</a>. They focus on middleware systems programming topics, such as synchronous and asynchronous concurrency models, background service processing, structured data management, local inter-process communication and networking, and integration with cloud-based services. &nbsp;</p></li><li><p dir=\\"ltr\\">The fifth and sixth courses by Dr. Jules White, of Vanderbilt University, are&nbsp;<a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a>&nbsp;and&nbsp;<a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Security</a>. &nbsp;They focus on how to connect Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2.</p></li><li><p dir=\\"ltr\\">The final \'93capstone\'94 project will require students to develop a complex mobile cloud computing application from the ground up.</p></li></ul><p dir=\\"ltr\\">Some of the programming assignments and the iRemember integrative project for these MOOCs will be coordinated. &nbsp;</p>If you just want to take some of the MOOCs in this sequence or take them all in different order you\'92re certainly welcome to do so, and you\'92ll still learn a lot. However, if you take all the MOOCs in this sequence in the order presented you\'92ll gain a deeper, end-to-end understanding of handheld systems, their applications and services, as well as their integration into the cloud."\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "cloud computing", \
        "android", \
        "mobile development", \
        "data mining"\
    ]\
\}\
\
/* 35 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3093"),\
    "id" : "2633",\
    "shortName" : "bd2klincs",\
    "name" : "Big Data Science with the BD2K-LINCS Data Coordination and Integration Center",\
    "url" : "https://www.coursera.org/course/bd2klincs",\
    "about" : [ \
        "<div>The <a href=\\"http://www.lincsproject.org/\\" target=\\"_blank\\">Library of Integrative Network-based Cellular Signatures</a> (LINCS) is an <a href=\\"http://commonfund.nih.gov/LINCS/index\\" target=\\"_blank\\">NIH Common Fund project</a> that was recently expanded to its second phase. The idea is to perturb different types of human cells with many different types of perturbations such as: drugs and other small molecules; genetic manipulations such as knockdown or overexpression of genes, manipulation of the extracellular microenvironment conditions, i.e., growing cells on different surfaces, and more. These perturbations are applied to various types of human cells including induced pluripotent stem cells from patients, differentiated into various lineages such as neuron or cardiomyocytes. Then, to better understand the molecular networks that are affected by these perturbations, changes in levels of many different variables are measured including: mRNA, protein, and metabolites, as well as cellular phenotypic changes such as changes in cell morphology. In most cases, the data that is collected is genome-wide and from across different regulatory layers.&nbsp;</div><div><br>The <a href=\\"http://www.lincs-dcic.org\\" target=\\"_blank\\">BD2K-LINCS Data Coordination and Integration Center</a> (DCIC) is commissioned to organize, analyze, visualize and integrate this with other publicly available relevant resources. In this course we will introduce the various Centers that collect data for LINCS, describing the experimental data procedures and the various data types. We will then cover the design and collection of meta-data and how meta-data is linked to ontologies. We will then describe data processing and data normalization methods to clean and harmonize LINCS data. This will follow a discussion about how the data is served as RESTful APIs and JSON, and for this we will cover concepts from client-server computing. Most importantly, the course will focus on various methods of analysis including: unsupervised clustering, gene-set enrichment analyses, Bayesian integration, network visualization, and supervised machine learning applications to LINCS data and other relevant Big Data. The course will be taught by members of the <a href=\\"http://icahn.mssm.edu/labs/maayan\\" target=\\"_blank\\">Ma'ayan Lab</a> at the Icahn School of Medicine Mount Sinai, <a href=\\"http://eh3.uc.edu/people/MarioM.html\\" target=\\"_blank\\">Medvedovic Lab</a> at the University of Cincinnati, <a href=\\"http://ccs.miami.edu/?p=1103\\" target=\\"_blank\\">Schurer Lab</a> at the University of Miami, and other <a href=\\"http://www.lincs-dcic.info/#/team\\" target=\\"_blank\\">members of the BD2K-LINCS Team</a> as well as members of other <a href=\\"http://bd2k.nih.gov/\\" target=\\"_blank\\">BD2K</a> and <a href=\\"http://commonfund.nih.gov/LINCS/index\\" target=\\"_blank\\">LINCS</a> NIH funded centers.</div>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "data mining"\
    ]\
\}\
\
/* 36 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3080"),\
    "id" : "2859",\
    "shortName" : "comparinggenomes",\
    "name" : "Comparing Genes, Proteins, and Genomes (Bioinformatics III)",\
    "url" : "https://www.coursera.org/course/comparinggenomes",\
    "about" : [ \
        "DNA mutations can broadly be divided into two categories. Point mutations, in which a single nucleotide (A, C, G, T) is altered, inserted, or deleted, are comparable to erosion slowly changing the shape of a boulder. Much of human differentiation is attributable to the accumulation of point mutations.<br><br>The other type of mutation is extremely rare and can cause dramatic effects on the scale of species evolution. &nbsp;In genome rearrangements, huge blocks of DNA are heaved around, often from one chromosome to another. These mutations are comparable to earthquakes, which hoist up mountains and wrench apart continents.<br><br>When we compare two relatively short pieces of DNA that have not been affected by genome rearrangements (say, two genes taken from individuals from the same species), our goal is to identify a \\"path of least resistance\\" connecting these two genes via point mutations. &nbsp;We can find such a path using a powerful algorithmic paradigm called <strong>dynamic programming</strong>.<br><br>On the other hand, when we zoom out to the compare entire genomes taken from different species that diverged millions of years ago (such as humans and mice), the effects of genome rearrangements become more pronounced. To determine how far diverged these genomes are, we will need completely different <strong>combinatorial algorithms</strong><strong>&nbsp;</strong>that will help us answer&nbsp;questions about the patterns of genome rearrangements. For example, in order to move around large blocks of DNA, a genome rearrangement must \\"break\\" the genome in at least two places. We know that there are fault lines on the earth's surface where earthquakes are more likely; are there analogous \\"fragile regions\\" in the human genome where breakage has been more likely to occur during a genome rearrangement?"\
    ],\
    "__v" : 0\
\}\
\
/* 37 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309c"),\
    "id" : "16",\
    "shortName" : "compilers",\
    "name" : "Compilers",\
    "url" : "https://www.coursera.org/course/compilers",\
    "about" : [ \
        "<p>This course will discuss the major ideas used today in the implementation of programming language compilers, including lexical analysis, parsing, syntax-directed translation, abstract syntax trees, types and type checking, intermediate languages, dataflow analysis, program optimization, code generation, and runtime systems. As a result, you will learn how a program written in a high-level language designed for humans is systematically translated into a program written in low-level assembly more suited to machines. Along the way we will also touch on how programming languages are designed, programming language semantics, and why there are so many different kinds of programming languages.</p>\\n<p>The course lectures will be presented in short videos. To help you master the material, there will be in-lecture questions to answer, quizzes, and two exams: a midterm and a final. There will also be homework in the form of exercises that ask you to show a sequence of logical steps needed to derive a specific result, such as the sequence of steps a type checker would perform to type check a piece of code, or the sequence of steps a parser would perform to parse an input string. This checking technology is the result of ongoing research at Stanford into developing innovative tools for education, and we're excited to be the first course ever to make it available to students.</p>\\nAn optional course project is to write a complete compiler for COOL, the Classroom Object Oriented Language. COOL has the essential features of a realistic programming language, but is small and simple enough that it can be implemented in a few thousand lines of code. Students who choose to do the project can implement it in either C++ or Java.<br>I hope you enjoy the course!\\n<p><strong>Why Study Compilers?</strong></p>\\nEverything that computers do is the result of some program, and all of the millions of programs in the world are written in one of the many thousands of programming languages that have been developed over the last 60 years. Designing and implementing a programming language turns out to be difficult; some of the best minds in computer science have thought about the problems involved and contributed beautiful and deep results. Learning something about compilers will show you the interplay of theory and practice in computer science, especially how powerful general ideas combined with engineering insight can lead to practical solutions to very hard problems. Knowing how a compiler works will also make you a better programmer and increase your ability to learn new programming languages quickly.\\n<div></div>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "computer architecture"\
    ]\
\}\
\
/* 38 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3086"),\
    "id" : "2624",\
    "shortName" : "posacommunication",\
    "name" : "Programming Mobile Services for Android Handheld Systems: Communication",\
    "url" : "https://www.coursera.org/course/posacommunication",\
    "about" : [ \
        "<span><p dir=\\"ltr\\">This MOOC describes by example how to apply patterns and frameworks to alleviate the complexity of developing concurrent software for mobile devices via the use of object-oriented design techniques. A <a href=\\"http://en.wikipedia.org/wiki/Software_design_pattern\\">pattern</a> describes a reusable solution to a common problem that arises within a particular context. A <a href=\\"http://en.wikipedia.org/wiki/Software_framework\\">framework</a> is an integrated set of components that collaborate to provide a reusable architecture for a family of related apps or services. &nbsp;Frameworks can also be viewed as concrete realizations of patterns that facilitate direct reuse of detailed design and source code.</p><p dir=\\"ltr\\">This MOOC will cover fundamental techniques, patterns, and frameworks related to communicating with local and remote services. In particular, this MOOC course will cover Android mechanisms for interacting with local&nbsp;bound and started services via&nbsp;Intents, Messengers, and the&nbsp;Android Interface Definition Language (AIDL).&nbsp; It will also focus on interacting with&nbsp;remote web services using HTTP and data marshalling with JSON. Remote interaction models, ranging from request on demand, polling, push, and sockets will be discussed. Students that complete this MOOC will have a solid understanding of how to build Android applications and local services that can interact with remote services, handle data marshaling, and perform error handling. Hands-on programming projects will require students to develop Android applications that interact with REST-based services.</p><p dir=\\"ltr\\"><strong>The Mobile Cloud Computing with Android (MoCCA) Specialization</strong></p><p dir=\\"ltr\\">This is the fourth course of the six-course <a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>. It has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, and includes a final \'93capstone\'94 project for those who earn Verified Certificates across all six courses.</p><p dir=\\"ltr\\">Note: We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe. In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers.</p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. For example, new sessions of my two introductory courses will be launched on a monthly basis, so that you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.</p><p dir=\\"ltr\\">For previous MoCCA students: If you have already earned a Verified Certificate in the previous version of this course, \\"Pattern-Oriented Software Architectures: Programming Mobile Services for Android Handheld Systems\'94 offered in May 2014, you do not need to retake this course to continue towards the Specialization certificate and final project in 2015. Please consult the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a> or contact the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a> if you are not sure whether you qualify.</p><p dir=\\"ltr\\">This MOOC and five others, taught by Dr. Adam Porter from the University of Maryland and Dr. Jules White from Vanderbilt University, have been designed to complement each other as part of the first trans-institution sequence of MOOCs taught on the Coursera platform, structured as follows:</p><ul><li><p dir=\\"ltr\\">The first two courses by Dr. Adam Porter, of the University of Maryland, are <a href=\\"https://www.coursera.org/course/androidpart1\\">Programming Mobile Applications for Android Handheld Systems Part 1</a> and <a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>. They focus on the design and programming of user-facing applications. &nbsp;</p></li><li><p dir=\\"ltr\\">The third and fourth courses by Dr. Douglas Schmidt, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a> and <a href=\\"https://www.coursera.org/course/posacommunication\\">Communication</a>. They focus on middleware systems programming topics, such as synchronous and asynchronous concurrency models, background service processing, structured data management, local inter-process communication and networking, and integration with cloud-based services. &nbsp;</p></li><li><p dir=\\"ltr\\">The fifth and sixth courses by Dr. Jules White, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a> and <a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Security</a>. &nbsp;They focus on how to connect Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2. </p></li><li><p dir=\\"ltr\\">The final \'93capstone\'94 project will require students to develop a complex mobile cloud computing application from the ground up.</p></li></ul><p dir=\\"ltr\\">Some of the programming assignments for these MOOCs will be coordinated. &nbsp;</p>If you just want to take some of the MOOCs in this sequence or take them all in different order you\'92re certainly welcome to do so, and you\'92ll still learn a lot. However, if you take all the MOOCs in this sequence in the order presented you\'92ll gain a deeper, end-to-end understanding of handheld systems, their applications and services, as well as their integration into the cloud.</span>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "android", \
        "mobile development"\
    ]\
\}\
\
/* 39 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a6"),\
    "id" : "1822",\
    "shortName" : "osvirtsecurity",\
    "name" : "
\f1 \'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'d3\'eb\'d0\'e9\'c4\'e2\'bb\'af\'b0\'b2\'c8\'ab
\f0 ",\
    "url" : "https://www.coursera.org/course/osvirtsecurity",\
    "about" : [ \
        "<p>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'bf\'c9\'d2\'d4\'b7\'c3\'ce\'ca
\f0 <a title=\\"Link: http://video.study.163.com/edu-video/nos/mp4/2014/07/25/527141_hd.mp4\\" target=\\"_blank\\" href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/07/25/527141_hd.mp4\\">
\f1 \'d5\'e2\'c0\'ef
\f0 </a>
\f1 \'a1\'a3
\f0 </p>\\n\\n<br>
\f1 \'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'ca\'c7\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'b5\'c4\'bb\'f9\'b4\'a1\'c8\'ed\'bc\'fe\'a3\'ac\'b6\'f8\'cf\'b5\'cd\'b3\'d0\'e9\'c4\'e2\'bb\'af\'d2\'d1\'b3\'c9\'ce\'aa\'d4\'c6\'bc\'c6\'cb\'e3\'c6\'bd\'cc\'a8\'b5\'c4\'ba\'cb\'d0\'c4\'bc\'bc\'ca\'f5\'a3\'ac\'c3\'bb\'d3\'d0\'cb\'fc\'c3\'c7\'cc\'e1\'b9\'a9\'b5\'c4\'b0\'b2\'c8\'ab\'d0\'d4\'a3\'ac\'d5\'e2\'d0\'a9\'bc\'c6\'cb\'e3\'bb\'fa\'cf\'b5\'cd\'b3\'bc\'b0\'c6\'e4\'c9\'cf\'ca\'fd\'be\'dd\'b5\'c4\'b0\'b2\'c8\'ab\'d0\'d4\'b6\'bc\'bd\'ab\'ce\'de\'b7\'a8\'b1\'a3\'d5\'cf\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'bd\'ab\'b4\'d3\'c0\'ed\'c2\'db\'d3\'eb\'b9\'a4\'b3\'cc\'ca\'b5\'bc\'f9\'cf\'e0\'bd\'e1\'ba\'cf\'b5\'c4\'bd\'c7\'b6\'c8\'a3\'ac\'bd\'e9\'c9\'dc\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3
\f0 (Linux)
\f1 \'d3\'eb\'cf\'b5\'cd\'b3\'d0\'e9\'c4\'e2\'bb\'af
\f0 (Xen)
\f1 \'b0\'b2\'c8\'ab\'cf\'e0\'b9\'d8\'c0\'ed\'c2\'db\'a1\'a2\'bc\'bc\'ca\'f5\'ba\'cd\'b7\'bd\'b7\'a8\'a3\'ac\'b0\'fc\'c0\'a8\'a3\'ba\'b0\'b2\'c8\'ab\'b8\'c5\'c4\'ee\'a1\'a2\'b0\'b2\'c8\'ab\'bb\'fa\'d6\'c6\'a1\'a2\'b0\'b2\'c8\'ab\'c4\'a3\'d0\'cd\'a1\'a2\'b0\'b2\'c8\'ab\'cc\'e5\'cf\'b5\'bd\'e1\'b9\'b9\'a1\'a2\'b0\'b2\'c8\'ab\'bf\'aa\'b7\'a2\'b7\'bd\'b7\'a8\'a1\'a2\'b0\'b2\'c8\'ab\'b1\'ea\'d7\'bc\'d3\'eb\'c6\'c0\'b2\'e2\'b7\'bd\'b7\'a8\'b5\'c8\'a3\'ac\'b0\'ef\'d6\'fa\'c4\'e3\'c9\'ee\'c8\'eb\'d1\'a7\'cf\'b0\'ba\'cd\'c0\'ed\'bd\'e2\'b8\'c3\'c1\'ec\'d3\'f2\'b5\'c4\'d6\'aa\'ca\'b6\'cc\'e5\'cf\'b5\'a1\'a2\'ca\'b5\'bc\'f9\'bc\'bc\'ca\'f5\'ba\'cd\'b7\'bd\'b7\'a8\'a1\'a3
\f0 <br><br>
\f1 \'d5\'e2\'ca\'c7\'d2\'bb\'c3\'c5\'ca\'ca\'ba\'cf\'b1\'be\'bf\'c6\'c9\'fa\'a1\'a2\'d2\'d4\'bc\'b0\'d1\'d0\'be\'bf\'c9\'fa\'b5\'c4\'bf\'ce\'b3\'cc\'a3\'ac\'ca\'ca\'ba\'cf\'bc\'c6\'cb\'e3\'bb\'fa\'a1\'a2\'c8\'ed\'bc\'fe\'b9\'a4\'b3\'cc\'ba\'cd\'d0\'c5\'cf\'a2\'b0\'b2\'c8\'ab\'c0\'e0\'d7\'a8\'d2\'b5\'a3\'bb\'cd\'ac\'ca\'b1\'d2\'b2\'bf\'c9\'b9\'a9\'d3\'d0\'d0\'cb\'c8\'a4\'b5\'c4\'cf\'e0\'b9\'d8\'d1\'d0\'be\'bf\'c8\'cb\'d4\'b1\'a1\'a2\'b9\'a4\'b3\'cc\'bc\'bc\'ca\'f5\'c8\'cb\'d4\'b1\'a1\'a2\'b9\'dc\'c0\'ed\'c8\'cb\'d4\'b1\'ba\'cd\'b0\'ae\'ba\'c3\'d5\'df\'b5\'c8\'d1\'a7\'cf\'b0\'ba\'cd\'bd\'e8\'bc\'f8\'a1\'a3
\f0 <br><br><p>
\f1 \'bf\'ce\'b3\'cc\'b5\'c4\'c4\'da\'c8\'dd\'d6\'f7\'d2\'aa\'bb\'f9\'d3\'da\'bd\'cc\'b2\'c4
\f0 <a target=\\"_blank\\" href=\\"http://www.amazon.cn/%E9%AB%98%E7%AD%89%E9%99%A2%E6%A0%A1%E4%BF%A1%E6%81%AF%E5%AE%89%E5%85%A8%E4%B8%93%E4%B8%9A%E8%A7%84%E5%88%92%E6%95%99%E6%9D%90-%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%E5%AE%89%E5%85%A8%E8%AE%BE%E8%AE%A1-%E6%B2%88%E6%99%B4%E9%9C%93/dp/B00FIY49GO/ref=sr_1_1?ie=UTF8&amp;qid=1404639920&amp;sr=8-1&amp;keywords=%E6%93%8D%E4%BD%9C%E7%B3%BB%E7%BB%9F%E5%AE%89%E5%85%A8%E8%AE%BE%E8%AE%A1\\">
\f1 \'a1\'b6\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'b0\'b2\'c8\'ab\'c9\'e8\'bc\'c6\'a1\'b7\'a3\'a8\'bb\'fa\'d0\'b5\'b9\'a4\'d2\'b5\'b3\'f6\'b0\'e6\'c9\'e7\'a3\'ac
\f0 2013.9
\f1 \'a3\'a9
\f0 </a>
\f1 \'a1\'a3
\f0 </p><a title=\\"Link: http://www.intel.com/content/www/us/en/education/university/intel-labs-security-curriculum-list.html\\" target=\\"_blank\\" href=\\"http://www.intel.com/content/www/us/en/education/university/intel-labs-security-curriculum-list.html\\">
\f1 \'b8\'c3\'bf\'ce\'b3\'cc\'ca\'c7\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'be\'ab\'c6\'b7\'bf\'ce\'b3\'cc\'a3\'ac
\f0 </a><a title=\\"Link: http://www.intel.com/content/www/us/en/education/university/intel-labs-security-curriculum-list.html\\" target=\\"_blank\\" href=\\"http://www.intel.com/content/www/us/en/education/university/intel-labs-security-curriculum-list.html\\">Intel </a><a title=\\"null\\" target=\\"_blank\\" href=\\"http://www.intel.com/content/www/us/en/education/university/security-program/curricula.html\\">UPO
\f1 \'d7\'ca\'d6\'fa\'b5\'c4\'b9\'fa\'c4\'da\'ca\'d7\'c5\'fa\'bc\'c6\'cb\'e3\'bb\'fa\'b0\'b2\'c8\'ab\'c0\'e0\'bf\'ce\'b3\'cc\'d6\'ae\'d2\'bb
\f0 </a>.<br><br>"\
    ],\
    "__v" : 0\
\}\
\
/* 40 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b308b"),\
    "id" : "1376",\
    "shortName" : "pkupop",\
    "name" : "
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'ca\'b5\'cf\'b0
\f0  / Practice on Programming",\
    "url" : "https://www.coursera.org/course/pkupop",\
    "about" : [ \
        "<div>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'bf\'c9\'d2\'d4\'b7\'c3\'ce\'ca
\f0 <a href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/01/22/331991_hd.mp4 \\" target=\\"_blank\\">
\f1 \'d5\'e2\'c0\'ef
\f0 </a>
\f1 \'a1\'a3
\f0 \\n    <br>\\n    <br>
\f1 \'d4\'da\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'d0\'c5\'cf\'a2\'bf\'c6\'d1\'a7\'bc\'bc\'ca\'f5\'d1\'a7\'d4\'ba\'a3\'ac\'b1\'be\'bf\'c6\'c9\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'c0\'e0\'bb\'f9\'b4\'a1\'bf\'ce\'b3\'cc\'cc\'e5\'cf\'b5\'b0\'fc\'ba\'ac\'c1\'cb\'cb\'c4\'c3\'c5\'bf\'ce\'a3\'ac\'b0\'b4\'d0\'de\'bf\'ce\'cb\'b3\'d0\'f2\'b7\'d6\'b1\'f0\'ce\'aa\'a3\'ba
\f0 <b>
\f1 \'bc\'c6\'cb\'e3\'b8\'c5\'c2\'db\'a1\'a2\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'ca\'b5\'cf\'b0\'a1\'a2\'ca\'fd\'be\'dd\'bd\'e1\'b9\'b9\'d3\'eb\'cb\'e3\'b7\'a8\'a1\'a2\'cb\'e3\'b7\'a8\'b7\'d6\'ce\'f6\'d3\'eb\'c9\'e8\'bc\'c6
\f0 </b>
\f1 \'a1\'a3\'c6\'e4\'d6\'d0
\f0 \'93
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'ca\'b5\'cf\'b0
\f0 \'94
\f1 \'bf\'ce\'b3\'cc\'ca\'c7\'d2\'bb\'c3\'c5\'c1\'ac\'bd\'d3
\f0 \'93
\f1 \'bc\'c6\'cb\'e3\'b8\'c5\'c2\'db
\f0 \'94
\f1 \'ba\'cd
\f0 \'93
\f1 \'ca\'fd\'be\'dd\'bd\'e1\'b9\'b9\'d3\'eb\'cb\'e3\'b7\'a8
\f0 \'94
\f1 \'a1\'a2\'b3\'d0\'c9\'cf\'c6\'f4\'cf\'c2\'b5\'c4\'bf\'ce\'b3\'cc\'a1\'a3
\f0 </div>\\n<div>\\n    <br>\\n</div>\\n<div>
\f1 \'bf\'ce\'b3\'cc\'b5\'c4\'d6\'f7\'d2\'aa\'c4\'da\'c8\'dd\'d6\'f7\'d2\'aa\'b7\'d6\'ce\'aa\'c1\'bd\'b8\'f6\'b7\'bd\'c3\'e6\'a3\'ba
\f0 (1) <b>C++
\f1 \'d3\'ef\'d1\'d4
\f0 </b>
\f1 \'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b5\'c4\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'a3\'ac\'d4\'bc\'d5\'bc\'bf\'ce\'ca\'b1\'c1\'bf\'b5\'c4
\f0 65%
\f1 \'a3\'bb
\f0 (2) 
\f1 \'bb\'f9\'b1\'be
\f0 <b>
\f1 \'cb\'e3\'b7\'a8\'cb\'bc\'cf\'eb
\f0 </b>
\f1 \'a3\'ac\'d4\'bc\'d5\'bc\'bf\'ce\'ca\'b1\'c1\'bf\'b5\'c4
\f0 35%
\f1 \'a1\'a3
\f0 </div>\\n<div>\\n    <br>\\n</div>\\n<div>
\f1 \'d4\'da\'b5\'da\'d2\'bb\'b2\'bf\'b7\'d6\'d6\'d0\'a3\'ac\'bd\'b2\'ca\'da
\f0 C++
\f1 \'d3\'ef\'d1\'d4\'d6\'d0\'ba\'cd\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'d3\'d0\'b9\'d8\'b5\'c4\'b8\'c5\'c4\'ee\'ba\'cd\'d3\'ef\'b7\'a8\'a3\'ac\'c8\'e7\'c0\'e0\'ba\'cd\'b6\'d4\'cf\'f3\'a1\'a2\'d4\'cb\'cb\'e3\'b7\'fb\'d6\'d8\'d4\'d8\'a1\'a2\'bc\'cc\'b3\'d0\'ba\'cd\'b6\'e0\'cc\'ac\'a1\'a2\'c0\'e0\'c4\'a3\'b0\'e5\'ba\'cd\'cb\'e3\'b7\'a8\'c4\'a3\'b0\'e5\'a1\'a2\'b1\'ea\'d7\'bc\'c4\'a3\'b0\'e5\'bf\'e2\'b5\'c8\'a1\'a3\'c4\'bf\'b1\'ea\'ca\'c7\'ca\'b9\'b5\'c3\'d1\'a7\'c9\'fa\'c4\'dc\'b9\'bb\'d3\'c3
\f0 C++
\f1 \'d3\'ef\'d1\'d4\'a3\'ac\'d2\'d4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b5\'c4\'b7\'bd\'b7\'a8\'b1\'e0\'d0\'b4\'bf\'c9\'ce\'ac\'bb\'a4\'d0\'d4\'a1\'a2\'bf\'c9\'c0\'a9\'b3\'e4\'d0\'d4\'ba\'c3\'b5\'c4\'a3\'ac\'bd\'cf\'b4\'f3\'b9\'e6\'c4\'a3\'b5\'c4\'b3\'cc\'d0\'f2\'a3\'ac\'b3\'f5\'b2\'bd\'c1\'ec\'bb\'e1\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b7\'bd\'b7\'a8\'b5\'c4\'d3\'c5\'ca\'c6\'cb\'f9\'d4\'da\'a1\'a3
\f0 \\n    <br>\\n    <br>\\n</div>\\n<div>
\f1 \'d4\'da\'b5\'da\'b6\'fe\'b2\'bf\'b7\'d6\'d6\'d0\'a3\'ac\'bd\'b2\'ca\'da\'d2\'bb\'d0\'a9\'bb\'f9\'b1\'be\'b5\'c4\'cb\'e3\'b7\'a8\'cb\'bc\'cf\'eb\'a3\'a8\'c8\'e7\'c3\'b6\'be\'d9\'a1\'a2\'b5\'dd\'b9\'e9\'a1\'a2\'cb\'d1\'cb\'f7\'a1\'a2\'b6\'af\'cc\'ac\'b9\'e6\'bb\'ae\'b5\'c8\'a3\'a9\'a3\'ac\'b2\'a2\'bd\'f8\'d0\'d0\'b4\'f3\'c1\'bf\'b5\'c4\'b8\'df\'c7\'bf\'b6\'c8\'b5\'c4\'b1\'e0\'b3\'cc\'d1\'b5\'c1\'b7\'a1\'a3\'d1\'b5\'c1\'b7\'b5\'c4\'b7\'bd\'ca\'bd\'ca\'c7\'d4\'da
\f0 \'93
\f1 \'d4\'da\'cf\'df\'b3\'cc\'d0\'f2\'c6\'c0\'b2\'e2\'c6\'bd\'cc\'a8
\f0 \'94
\f1 \'c9\'cf\'cc\'e1\'bd\'bb\'b3\'cc\'d0\'f2\'a3\'ac\'cf\'b5\'cd\'b3\'c1\'a2\'bc\'b4\'c5\'d0\'b6\'a8\'b3\'cc\'d0\'f2\'ca\'c7\'b7\'f1\'d5\'fd\'c8\'b7\'a1\'a3\'b4\'cb\'d6\'d6\'d0\'ce\'ca\'bd\'c4\'dc\'b9\'bb\'d3\'d0\'d0\'a7\'b4\'d9\'ca\'b9\'d1\'a7\'c9\'fa\'c8\'ab\'c3\'e6\'cf\'b8\'d6\'c2\'b5\'d8\'cb\'bc\'bf\'bc\'ce\'ca\'cc\'e2\'a3\'ac\'cc\'e1\'b8\'df\'b1\'e0\'b3\'cc\'b5\'c4\'d7\'bc\'c8\'b7\'d0\'d4\'a3\'ac\'d4\'f6\'c7\'bf\'b3\'cc\'d0\'f2\'b2\'e9\'b4\'ed\'a1\'a2\'b5\'f7\'ca\'d4\'b5\'c4\'c4\'dc\'c1\'a6\'a1\'a3\'cd\'a8\'b9\'fd\'d1\'b5\'c1\'b7\'a3\'ac\'d1\'a7\'c9\'fa\'c4\'dc\'b9\'bb\'b4\'f2\'cf\'c2\'bd\'cf\'ce\'aa\'bc\'e1\'ca\'b5\'b5\'c4\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'bb\'f9\'b4\'a1\'a3\'ac\'ce\'aa\'bd\'f8\'d2\'bb\'b2\'bd\'d1\'a7\'cf\'b0\'c6\'e4\'cb\'fb\'bc\'c6\'cb\'e3\'bb\'fa\'d7\'a8\'d2\'b5\'bf\'ce\'b3\'cc\'a3\'ac\'bb\'f2\'d4\'da\'c6\'e4\'cb\'fb\'d7\'a8\'d2\'b5\'c1\'ec\'d3\'f2\'d4\'cb\'d3\'c3\'bc\'c6\'cb\'e3\'bb\'fa\'b1\'e0\'b3\'cc\'bd\'e2\'be\'f6\'ce\'ca\'cc\'e2\'a3\'ac\'b4\'b4\'d4\'ec\'c1\'bc\'ba\'c3\'b5\'c4\'cc\'f5\'bc\'fe\'a1\'a3
\f0 </div>\\n<div>\\n    <br>\\n</div>\\n<div>
\f1 \'c1\'ed\'cd\'e2\'a3\'ac\'b1\'be\'bf\'ce\'b3\'cc\'bd\'ab
\f0 ACM
\f1 \'b9\'fa\'bc\'ca\'b4\'f3\'d1\'a7\'c9\'fa\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'be\'ba\'c8\'fc\'d6\'d0\'d2\'bb\'d0\'a9\'d3\'c5\'d0\'e3\'b5\'c4\'bb\'f9\'b4\'a1\'cc\'e2\'d2\'fd\'c8\'eb\'bf\'ce\'b3\'cc\'bd\'cc\'d1\'a7\'a3\'ac\'d4\'f6\'bc\'d3\'c4\'da\'c8\'dd\'b5\'c4\'c8\'a4\'ce\'b6\'d0\'d4\'a3\'ac\'b2\'a2\'cc\'e1\'b8\'df\'d1\'a7\'c9\'fa\'d1\'a7\'cf\'b0\'b5\'c4\'bb\'fd\'bc\'ab\'d0\'d4\'ba\'cd\'b3\'c9\'be\'cd\'b8\'d0\'a1\'a3
\f0 </div>"\
    ],\
    "__v" : 0,\
    "level" : 2\
\}\
\
/* 41 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30aa"),\
    "id" : "2623",\
    "shortName" : "posaconcurrency",\
    "name" : "Programming Mobile Services for Android Handheld Systems: Concurrency",\
    "url" : "https://www.coursera.org/course/posaconcurrency",\
    "about" : [ \
        "<p dir=\\"ltr\\">This MOOC describes by example how to apply patterns and frameworks to alleviate the complexity of developing concurrent software for mobile devices via the use of object-oriented design techniques. A <a href=\\"http://en.wikipedia.org/wiki/Software_design_pattern\\">pattern</a> describes a reusable solution to a common problem that arises within a particular context. A <a href=\\"http://en.wikipedia.org/wiki/Software_framework\\">framework</a> is an integrated set of components that collaborate to provide a reusable architecture for a family of related apps or services. &nbsp;Frameworks can also be viewed as concrete realizations of patterns that facilitate direct reuse of detailed design and source code.</p><p dir=\\"ltr\\">This MOOC will cover Android's Handlers, Messages, and Runnables (HaMeR) framework and its AsyncTask framework, which simplify the development of Android applications that can run long-duration operations in background threads and then publish the results of these operations to the User Interface thread, which then performs short-duration user-facing operations. &nbsp;Some coverage of Java threads will be included to provide background on concurrent programming. Hands-on programming projects will require students to apply these two concurrency frameworks to representative Android applications.</p><p dir=\\"ltr\\"><strong>The Mobile Cloud Computing with Android (MoCCA) Specialization</strong></p><p dir=\\"ltr\\">This is the third course of the six-course <a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>. It has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, and includes a final \'93capstone\'94 project for those who earn Verified Certificates across all six courses.</p><p dir=\\"ltr\\">Note: We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe. In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers.</p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. For example, new sessions of my two introductory courses will be launched on a monthly basis, so that you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.</p><p dir=\\"ltr\\">For previous MoCCA students: If you have already earned a Verified Certificate in the previous version of this course, \\"Pattern-Oriented Software Architectures: Programming Mobile Services for Android Handheld Systems\'94 offered in May 2014, you do not need to retake this course to continue towards the Specialization certificate and final project in 2015. Please consult the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a> or contact the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a> if you are not sure whether you qualify.</p><p dir=\\"ltr\\">This MOOC and five others, taught by Dr. Adam Porter from the University of Maryland and Dr. Jules White from Vanderbilt University, have been designed to complement each other as part of the first trans-institution sequence of MOOCs taught on the Coursera platform, structured as follows:</p><ul><li><p dir=\\"ltr\\">The first two courses by Dr. Adam Porter, of the University of Maryland, are <a href=\\"https://www.coursera.org/course/androidpart1\\">Programming Mobile Applications for Android Handheld Systems Part 1</a> and <a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>. They focus on the design and programming of user-facing applications. &nbsp;</p></li><li><p dir=\\"ltr\\">The third and fourth courses by Dr. Douglas Schmidt, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a> and <a href=\\"https://www.coursera.org/course/posacommunication\\">Communication</a>. They focus on middleware systems programming topics, such as synchronous and asynchronous concurrency models, background service processing, structured data management, local inter-process communication and networking, and integration with cloud-based services. &nbsp;</p></li><li><p dir=\\"ltr\\">The fifth and sixth courses by Dr. Jules White, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a> and <a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Security</a>. &nbsp;They focus on how to connect Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2. </p></li><li><p dir=\\"ltr\\">The final \'93capstone\'94 project will require students to develop a complex mobile cloud computing application from the ground up.</p></li></ul><p dir=\\"ltr\\">Some of the programming assignments for these MOOCs will be coordinated. &nbsp;</p><p dir=\\"ltr\\">If you just want to take some of the MOOCs in this sequence or take them all in different order you\'92re certainly welcome to do so, and you\'92ll still learn a lot. However, if you take all the MOOCs in this sequence in the order presented you\'92ll gain a deeper, end-to-end understanding of handheld systems, their applications and services, as well as their integration into the cloud.<br></p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "android", \
        "mobile development"\
    ]\
\}\
\
/* 42 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a2"),\
    "id" : "2626",\
    "shortName" : "mobilecloudsecurity",\
    "name" : "Programming Cloud Services for Android Handheld Systems: Security",\
    "url" : "https://www.coursera.org/course/mobilecloudsecurity",\
    "about" : [ \
        "<span>A key challenge of mobile platforms is that the apps installed on a device increase the number of potential security vulnerabilities. Mistakes in app development or cloud services can lead to vulnerabilities that cause users data to be stolen, charges to user accounts, and spread of malware to a user\'92s friends. Ensuring that mobile cloud application developers are aware of potential vulnerabilities and avoid introducing them into their code is an essential part of building a more secure app ecosystem.<p dir=\\"ltr\\"></p>The course is designed to help students understand how to write more secure mobile cloud applications for Android. Students will be introduced to specific vulnerabilities that have affected well-known apps and be given a wide view of app threats on Android. Developers will also be introduced to the secure coding techniques that can be used to help prevent the introduction of app and cloud service vulnerabilities.<p dir=\\"ltr\\"><strong>The Mobile Cloud Computing with Android (MoCCA) Specialization</strong></p><p dir=\\"ltr\\">This is the <strong>6th course</strong> of the six-course <a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>. It has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, and includes a final \'93capstone\'94 project for those who earn Verified Certificates across all six courses.</p><p dir=\\"ltr\\"><strong>Note: </strong>We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe. In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers.</p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. For example, new sessions of my two introductory courses will be launched on a monthly basis, so that you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.</p><p dir=\\"ltr\\"><strong>For previous MoCCA students:</strong> If you have already earned a Verified Certificate in the previous version of this course, \\"Pattern-Oriented Software Architectures: Programming Mobile Services for Android Handheld Systems\'94 offered in May 2014, you do not need to retake this course to continue towards the Specialization certificate and final project in 2015. Please consult the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a> or contact the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a> if you are not sure whether you qualify.</p><p dir=\\"ltr\\">This MOOC and five others, taught by Dr. Adam Porter from the University of Maryland and Dr. Jules White from Vanderbilt University, have been designed to complement each other as part of the first trans-institution sequence of MOOCs taught on the Coursera platform, structured as follows:</p><ul><li><p dir=\\"ltr\\">The first two courses by Dr. Adam Porter, of the University of Maryland, are <a href=\\"https://www.coursera.org/course/androidpart1\\">Programming Mobile Applications for Android Handheld Systems Part 1</a> and <a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>. They focus on the design and programming of user-facing applications. &nbsp;</p></li><li><p dir=\\"ltr\\">The third and fourth courses by Dr. Douglas Schmidt, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/posaconcurrency\\" title=\\"Link: https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a> and <a href=\\"https://www.coursera.org/course/posacommunication\\">Communication</a>. They focus on middleware systems programming topics, such as synchronous and asynchronous concurrency models, background service processing, structured data management, local inter-process communication and networking, and integration with cloud-based services. &nbsp;</p></li><li><p dir=\\"ltr\\">The fifth and sixth courses by Dr. Jules White, of Vanderbilt University, are <a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a> and <a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Security</a>. &nbsp;They focus on how to connect Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2. </p></li><li><p dir=\\"ltr\\">The final \'93capstone\'94 project will require students to develop a complex mobile cloud computing application from the ground up.</p></li></ul><p dir=\\"ltr\\">Some of the programming assignments and the iRemember integrative project for these MOOCs will be coordinated. &nbsp;</p>If you just want to take some of the MOOCs in this sequence or take them all in different order you\'92re certainly welcome to do so, and you\'92ll still learn a lot. However, if you take all the MOOCs in this sequence in the order presented you\'92ll gain a deeper, end-to-end understanding of handheld systems, their applications and services, as well as their integration into the cloud.</span>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "android", \
        "mobile development", \
        "cloud computing"\
    ]\
\}\
\
/* 43 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b3090"),\
    "id" : "1381",\
    "shortName" : "softwaresec",\
    "name" : "Software Security ",\
    "url" : "https://www.coursera.org/course/softwaresec",\
    "about" : [ \
        "<span><p>Software is everywhere: in laptops and desktops, mobile phones, the power grid ... even our cars and thermostats. Software is increasingly the vehicle that drives our economy and our personal lives. But software\'92s pervasiveness, and its importance, make it a target: at the root of many security compromises is vulnerable software.<br></p><p>In this course we will look at how to build software that is secure.</p><p>To start, we must know what we are up against. As such, we will examine the most prevalent software design and implementation defects.&nbsp;</p><p>We will examine vulnerabilities like buffer overruns and use-after-frees that are present in programs written in low-level programming languages like C and C++, and see how these vulnerabilities can be exploited by a clever attacker. We will also look attacks on applications that are part of the worldwide web -- attacks with names like SQL injection, cross-site scripting, and session hijacking. We will also mention side-channel attacks (such as those based on the size of messages or the time taken to process a request), attacks on the human user (like phishing), and failures of design (like the use of insecure defaults). Examples of these attacks will be taken from the headlines.</p></span><p>Having examined these defects and their role in security compromises, we will look at how to prevent them entirely, or mitigate their effects, by improving the software's design and implementation. We will see that security must appear at all phases in the development lifecycle, including requirements development, system design, implementation, and testing/validation.</p><span><p>Finally, we will look at state-of-the-art tools and techniques for testing and otherwise verifying that software is secure. We will consider how security testing differs from functional testing (it's harder!). We will look at the art of penetration testing, which is the activity of trying to find and exploit weaknesses in a system prior to its deployment. We will also look at an emerging class of program analysis tools that can automatically identify flaws in programs by analyzing their code.<br></p><p>At the conclusion of the course, the student will know how to \\"build security in\\" rather than consider it as an afterthought, and will have a plethora of skills, applicable at each phase of the development cycle, that can be used to strengthen the security of software systems.</p></span>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "security", \
        "cyber security"\
    ]\
\}\
\
/* 44 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b0"),\
    "id" : "2430",\
    "shortName" : "aprogramar",\
    "name" : "\'a1A Programar! Una introducci\'f3n a la programaci\'f3n",\
    "url" : "https://www.coursera.org/course/aprogramar",\
    "about" : [ \
        "<p dir=\\"ltr\\">Los programas de computadora est\'e1n en todas partes: desde m\'e1quinas de caf\'e9 y reproductores MP3 hasta naves espaciales y robots para aplicaciones m\'e9dicas. Pero as\'ed como la astronom\'eda es m\'e1s que usar telescopios, la ciencia de la computaci\'f3n es m\'e1s que usar computadoras, es programarlas para decirles exactamente qu\'e9 deben hacer. Programar es una habilidad muy \'fatil que te ayudar\'e1 a pensar en forma computacional, para resolver problemas de computaci\'f3n y de tu vida cotidiana. Adem\'e1s, es una actividad creativa y divertida que te permitir\'e1, por ejemplo, construir juegos de computadora para disfrutarlos junto a tus amigos y amigas.<br></p><p dir=\\"ltr\\">Este curso te acercar\'e1 a la programaci\'f3n de computadoras utilizando <a target=\\"_blank\\" href=\\"http://scratch.mit.edu\\">Scratch</a>, uno de los&nbsp; lenguajes de programaci\'f3n m\'e1s f\'e1ciles de usar. Moviendo y encastrando bloques podr\'e1s crear programas tales como animaciones, juegos e historias interactivas.<br></p><p dir=\\"ltr\\">Pero \'a1A Programar! es mucho m\'e1s que una introducci\'f3n a Scratch. \'a1Te ense\'f1ar\'e1 a pensar como programador/a, como cient\'edfico/a de la computaci\'f3n, como ingeniero/a de software! Te presentar\'e1 los principios fundamentales de la computaci\'f3n, llev\'e1ndote a reflexionar en torno a temas tales como el dise\'f1o de algoritmos, la interacci\'f3n con el usuario/a, la reutilizaci\'f3n del c\'f3digo y el modelado de problemas. Aprender\'e1s todo esto a trav\'e9s de ejemplos pr\'e1cticos detallados, entrevistas con personas expertas en computaci\'f3n, divertidos cuestionarios y proyectos creativos. Al final del curso tendr\'e1s un s\'f3lido conocimiento de los fundamentos de la computaci\'f3n, que te permitir\'e1 avanzar hacia otros lenguajes de programaci\'f3n o tomar cursos de programaci\'f3n m\'e1s avanzados.</p><p dir=\\"ltr\\"><img alt=\\"ScratchCat-Small\\" style=\\"width:35%\\" src=\\"https://d396qusza40orc.cloudfront.net/codeyourself/ScratchCat-Small.png\\"></p><p></p>NOTA: Este curso tambi\'e9n se imparte en ingl\'e9s:&nbsp;<a href=\\"https://www.coursera.org/course/codeyourself\\">https://www.coursera.org/course/codeyourself</a>"\
    ],\
    "__v" : 0\
\}\
\
/* 45 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30a3"),\
    "id" : "2775",\
    "shortName" : "pkujava",\
    "name" : " Java
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6
\f0 ",\
    "url" : "https://www.coursera.org/course/pkujava",\
    "about" : [ \
        "&nbsp; &nbsp; &nbsp; 
\f1 \'a1\'b6
\f0 Java
\f1 \'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'a1\'b7\'ca\'c7\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'d0\'c5\'cf\'a2\'bf\'c6\'d1\'a7\'bc\'bc\'ca\'f5\'d1\'a7\'d4\'ba\'b5\'c4\'d1\'a1\'d0\'de\'bf\'ce\'b3\'cc\'a1\'a3
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'d1\'a1\'d0\'de\'b8\'c3\'bf\'ce\'b5\'c4\'cd\'ac\'d1\'a7\'d2\'bb\'b0\'e3\'d2\'d1\'be\'ad\'be\'df\'d3\'d0\'c1\'cb
\f0 C
\f1 \'d3\'ef\'d1\'d4\'b3\'cc\'d0\'f2\'c9\'e8\'bc\'c6\'b5\'c4\'bb\'f9\'b4\'a1\'a1\'a3\'b1\'be\'bf\'ce\'b3\'cc\'ca\'c7\'d4\'da\'d2\'d1\'d3\'d0\'b5\'c4\'bb\'f9\'b4\'a1\'c9\'cf\'c8\'c3\'d1\'a7\'cf\'b0\'d5\'df\'c4\'dc\'b9\'bb\'d2\'d4
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'b1\'e0\'d0\'b4\'be\'df\'d3\'d0\'d2\'bb\'b6\'a8\'b9\'e6\'c4\'a3\'a1\'a2\'d7\'db\'ba\'cf\'d0\'d4\'b5\'c4\'d3\'a6\'d3\'c3\'b3\'cc\'d0\'f2\'a1\'a3\'b6\'d4\'ba\'f3\'c3\'e6\'b5\'c4\'b2\'d9\'d7\'f7\'cf\'b5\'cd\'b3\'a1\'a2\'b1\'e0\'d2\'eb\'d4\'ad\'c0\'ed\'b5\'c8\'bf\'ce\'b3\'cc\'c0\'b4\'cb\'b5\'a3\'ac\'b8\'c3\'bf\'ce\'b3\'cc\'ca\'c7\'d2\'bb\'b8\'f6\'b3\'d0\'c9\'cf\'c6\'f4\'cf\'c2\'b5\'c4\'bf\'ce\'b3\'cc\'a1\'a3
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'b4\'d3\'bf\'ce\'ca\'b1\'c4\'da\'c8\'dd\'b6\'f8\'d1\'d4\'a3\'ac\'d6\'f7\'d2\'aa\'d3\'d0\'c8\'fd\'b2\'bf\'b7\'d6\'a3\'ba
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'b5\'da\'d2\'bb\'b2\'bf\'b7\'d6\'ca\'c7
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'b2\'bf\'b7\'d6\'a3\'ac\'b0\'fc\'c0\'a8
\f0 Java
\f1 \'b8\'c5\'ca\'f6\'a3\'ac\'bc\'f2\'b5\'a5\'b5\'c4
\f0 Java
\f1 \'b3\'cc\'d0\'f2\'a3\'ac\'b1\'e4\'c1\'bf\'a1\'a2\'d3\'ef\'be\'e4\'a1\'a2\'ca\'fd\'d7\'e9\'a3\'ac\'c0\'e0\'a1\'a2\'b0\'fc\'a1\'a2\'bd\'d3\'bf\'da\'a3\'ac\'c9\'ee\'c8\'eb\'c0\'ed\'bd\'e2
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'a3\'ac\'d2\'ec\'b3\'a3\'b4\'a6\'c0\'ed\'b5\'c8\'a1\'a3\'d5\'e2\'b2\'bf\'b7\'d6\'c4\'da\'c8\'dd\'b5\'c4\'c4\'bf\'b5\'c4\'ca\'c7\'d5\'c6\'ce\'d5
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'b5\'c4\'d3\'ef\'b7\'a8\'a3\'ac\'c4\'dc\'b9\'bb\'bd\'cf\'ce\'aa\'c9\'ee\'c8\'eb\'c0\'ed\'bd\'e2
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'bb\'fa\'d6\'c6\'a3\'ac\'d5\'c6\'ce\'d5
\f0 Java
\f1 \'d3\'ef\'d1\'d4\'c3\'e6\'cf\'f2\'b6\'d4\'cf\'f3\'b5\'c4\'cc\'d8\'b5\'e3\'a1\'a3
\f0 &nbsp;<br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'b5\'da\'b6\'fe\'b2\'bf\'b7\'d6\'ca\'c7
\f0 Java
\f1 \'b5\'c4\'c0\'e0\'bf\'e2\'bc\'b0\'d3\'a6\'d3\'c3\'a3\'ac\'b0\'fc\'c0\'a8\'b9\'a4\'be\'df\'c0\'e0\'bc\'b0\'b3\'a3\'d3\'c3\'cb\'e3\'b7\'a8\'a1\'a2\'b6\'e0\'cf\'df\'b3\'cc\'a1\'a2\'c1\'f7\'a1\'a2\'ce\'c4\'bc\'fe\'bc\'b0\'bb\'f9\'d3\'da\'ce\'c4\'b1\'be\'b5\'c4\'d3\'a6\'d3\'c3\'a1\'a2\'cd\'bc\'d0\'ce\'d3\'c3\'bb\'a7\'bd\'e7\'c3\'e6\'a1\'a2\'cd\'f8\'c2\'e7\'a1\'a2\'b6\'e0\'c3\'bd\'cc\'e5\'ba\'cd\'ca\'fd\'be\'dd\'bf\'e2\'b1\'e0\'b3\'cc\'b5\'c8\'a3\'ac\'d5\'e2\'b2\'bf\'b7\'d6\'b5\'c4\'c4\'bf\'b1\'ea\'ca\'c7\'d5\'c6\'ce\'d5
\f0 JavaSE
\f1 \'d6\'d0\'bb\'f9\'b1\'be\'b5\'c4
\f0 API
\f1 \'a3\'ac\'d5\'c6\'ce\'d5\'d4\'da\'bc\'af\'ba\'cf\'a1\'a2\'cf\'df\'b3\'cc\'a1\'a2\'ca\'e4\'c8\'eb\'ca\'e4\'b3\'f6\'a1\'a2\'cd\'bc\'d0\'ce\'d3\'c3\'bb\'a7\'bd\'e7\'c3\'e6\'a1\'a2\'cd\'f8\'c2\'e7\'b5\'c8\'b7\'bd\'c3\'e6\'b5\'c4\'d3\'a6\'d3\'c3\'a1\'a3
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'b5\'da\'c8\'fd\'b2\'bf\'b7\'d6\'ca\'c7\'b9\'d8\'d3\'da\'c8\'e7\'ba\'ce\'d0\'b4\'b3\'f6\'b3\'f6\'b8\'df\'d6\'ca\'c1\'bf\'b5\'c4\'b4\'fa\'c2\'eb\'a3\'ac\'b0\'fc\'c0\'a8\'bc\'af\'b3\'c9\'bf\'aa\'b7\'a2\'bb\'b7\'be\'b3\'b5\'c4\'ca\'b9\'d3\'c3\'a3\'ac\'b5\'a5\'d4\'aa\'b2\'e2\'ca\'d4\'a1\'a2\'c8\'d5\'d6\'be\'a1\'a2\'d6\'ca\'c1\'bf\'b9\'dc\'c0\'ed\'b9\'a4\'be\'df\'b5\'c4\'ca\'b9\'d3\'c3\'a3\'ac\'d5\'c6\'ce\'d5\'d6\'d8\'b9\'b9\'ba\'cd\'c9\'e8\'bc\'c6\'c4\'a3\'ca\'bd\'a3\'ac\'d5\'e2\'b2\'bf\'b7\'d6\'b5\'c4\'c4\'bf\'b1\'ea\'ca\'c7\'d7\'db\'ba\'cf\'d3\'a6\'d3\'c3\'b1\'be\'bf\'ce\'b3\'cc\'b5\'c4\'d6\'aa\'ca\'b6\'a3\'ac\'c4\'dc\'b9\'bb\'b1\'e0\'d0\'b4\'d3\'d0\'d2\'bb\'b6\'a8\'b9\'e6\'c4\'a3\'b5\'c4\'d3\'a6\'d3\'c3\'b3\'cc\'d0\'f2\'a3\'ac\'d1\'f8\'b3\'c9\'c1\'bc\'ba\'c3\'b5\'c4\'b1\'e0\'b3\'cc\'cf\'b0\'b9\'df\'a3\'ac\'c4\'dc\'b9\'bb\'b1\'e0\'d0\'b4\'b8\'df\'b4\'fa\'c2\'eb\'b5\'c4\'d6\'ca\'c1\'bf\'a1\'a3
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'bf\'ce\'b3\'cc\'d2\'bb\'b7\'bd\'c3\'e6\'d6\'d8\'ca\'d3\'d3\'ef\'d1\'d4\'b5\'c4\'bb\'f9\'b4\'a1\'ba\'cd\'d4\'ad\'c0\'ed\'a3\'ac\'c1\'ed\'d2\'bb\'b7\'bd\'c3\'e6\'d7\'a2\'d2\'e2\'ca\'b5\'bc\'ca\'b1\'e0\'b3\'cc\'c4\'dc\'c1\'a6\'b5\'c4\'c5\'e0\'d1\'f8\'a1\'a3
\f0 <br>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 
\f1 \'bf\'ce\'b3\'cc\'d3\'d0\'d2\'bb\'d0\'a9\'d0\'a1\'b5\'c4\'d7\'f7\'d2\'b5\'a3\'ac\'d4\'da\'bf\'ce\'b3\'cc\'bd\'e1\'ca\'f8\'bb\'b9\'d2\'aa\'c7\'f3\'bf\'aa\'b7\'a2\'d3\'d0\'d2\'bb\'b6\'a8\'b9\'a4\'d7\'f7\'c1\'bf\'a1\'a2\'d3\'d0\'d6\'d0\'b5\'c8\'c4\'d1\'b6\'c8\'b5\'c4\'cf\'ee\'c4\'bf\'a1\'a3
\f0 "\
    ],\
    "__v" : 0\
\}\
\
/* 46 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b309f"),\
    "id" : "2599",\
    "shortName" : "androidpart1",\
    "name" : "Programming Mobile Applications for Android Handheld Systems: Part 1",\
    "url" : "https://www.coursera.org/course/androidpart1",\
    "about" : [ \
        "<p><span>This course has been developed in two parts (<a href=\\"https://www.coursera.org/course/androidpart1\\">Part 1</a> and <a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>), which will cover the fundamental programming principles, software architecture and user experience considerations underlying handheld software applications and their development environments.&nbsp;</span></p><p>Course completers will be able to build their own Android applications and experienced engineers to master a powerful set of development skills.<br></p><p dir=\\"ltr\\">Part 1 of this course will focus on the core components of the Android platform that underly all Android applications:</p><ul><li>setting up your Android Development Environment<br></li><li>working with screen configurations and multiple screen sizes<br></li><li>working with the all-important Activity Class and its lifecycle<br></li><li>being able implement intents and permissions<br></li><li>running multiple activities with the Fragment Class<br></li><li>creating user interfaces to make your apps run smoothly for your users.<br></li></ul><p dir=\\"ltr\\">Part 2 will focus on advanced components and concepts provided by the Android platform:</p><ul><li>notifying users about important events<br></li><li>handling concurrency</li><li>acquiring data over the network&nbsp;<br></li><li>leveraging multimedia and graphics<br></li><li>incorporating touch and gestures into your apps</li><li>working with sensors</li></ul><p>To bring these concepts alive, the course will involve in-\'addepth, hands-\'adon examples of applications implemented with the Android Platform. Students will apply what they learn, also using the Android Platform, in laboratory projects and in a large course project defined in collaboration with MoMA, the Museum of Modern Art in New York.<br></p><p dir=\\"ltr\\"><strong>The Mobile Cloud Computing with Android (MoCCA) Specialization: New and Improved</strong></p><p dir=\\"ltr\\">We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe.&nbsp;</p><p dir=\\"ltr\\">In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers. This time, we'll be working with Google again to provide you with an incredible Android learning experience.<br></p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. Now, you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.<br></p><p dir=\\"ltr\\"><strong>Note: </strong>To participate in the final project, you must earn Verified Certificates for all courses in the sequence.&nbsp;Learners who purchase Full Access to the entire series will also receive&nbsp;two years of unlimited retries while these courses are offered.</p><p><strong>For previous MoCCA students:</strong> If you have <u><strong>already</strong></u> completed my previous version of this course, \\"Programming Mobile Applications for Android Handheld Systems\'94 offered in January and September 2014, you do <u><strong>not</strong></u> need to retake this course to continue towards the Specialization certificate and final project in 2015.&nbsp;</p><p>Please consult the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a> or contact the <a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a> if you are not sure whether you qualify.<br></p><p><strong>What is the MoCCA Specialization?</strong><br></p><p dir=\\"ltr\\">This course has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, called the <a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>.&nbsp;</p><p dir=\\"ltr\\">The other four courses are led respectively by Drs. Douglas Schmidt and Jules White of Vanderbilt University, and some of the programming assignments and the course project for these courses will be coordinated.</p><p dir=\\"ltr\\"></p><ul><li><span><strong>Course 3:</strong> </span><a href=\\"https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a><br></li><li><span><strong>Course 4:</strong> </span><a href=\\"https://www.coursera.org/course/posacommunication\\">Programming Mobile Services for Android Handheld Systems: Communication</a><br></li><li>Dr. Douglas Schmidt, Associate Chair of Computer Science and Engineering and Professor of Computer Science, Vanderbilt University<br></li></ul><p></p><p>The third and fourth courses in the sequence focus on systems programming topics, such as middleware services and background processing. <strong><br></strong></p><p dir=\\"ltr\\"></p><ul><li><span><strong>Course 5:</strong> </span><a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a><br></li><li><span><strong>Course 6:</strong> </span><a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Programming Cloud Services for Android Handheld Systems: Security</a><br></li><li>Dr. C. Jules White, Assistant Professor of Computer Science, Vanderbilt University<br></li></ul><p></p><p>The fifth and sixth courses in the sequence will focus on connecting Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2.</p><p>Although each of these courses stands alone, those who do choose to complete the entire MoCCA sequence will gain a much more detailed, end-to-end understanding of handheld systems and their applications.</p>"\
    ],\
    "__v" : 0,\
    "level" : 1,\
    "skills" : [ \
        "android", \
        "mobile development"\
    ]\
\}\
\
/* 47 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b1"),\
    "id" : "2600",\
    "shortName" : "androidpart2",\
    "name" : "Programming Mobile Applications for Android Handheld Systems: Part 2",\
    "url" : "https://www.coursera.org/course/androidpart2",\
    "about" : [ \
        "<p>This course has been developed in two parts (<a href=\\"https://www.coursera.org/course/androidpart1\\">Part 1</a>&nbsp;and&nbsp;<a href=\\"https://www.coursera.org/course/androidpart2\\">Part 2</a>), which will cover the fundamental programming principles, software architecture and user experience considerations underlying handheld software applications and their development environments, enabling course completers to build their own Android applications and experienced engineers to master a powerful set of development skills.<br></p><p dir=\\"ltr\\">Most students will need to have taken Part 1 before attempting Part 2. While Part 1 focuses on the basic Android Platform and components, Part 2 will focus on more advanced components and concepts provided by the Android platform:</p><ul><li>notifying users about important events<br></li><li>handling concurrency</li><li>acquiring data over the network&nbsp;<br></li><li>leveraging multimedia and graphics<br></li><li>incorporating touch and gestures into your apps</li><li>working with sensors<br></li></ul><p>To bring these concepts alive, the course will involve in-\'addepth, hands-\'adon examples of applications implemented with the Android Platform. Students will apply what they learn, also using the Android Platform, in laboratory projects and in a large course project.<br></p><p dir=\\"ltr\\"><strong>Mobile Cloud Computing with Android (MoCCA) Specialization: New and Improved</strong></p><p dir=\\"ltr\\">We are proud to announce that the MoCCA specialization has already reached hundreds of thousands of learners around the globe.&nbsp;</p><p dir=\\"ltr\\">In its last iteration, we worked with Google to provide Nexus tablets, feedback from the Google App team, and the potential to be featured in the Google Play store to top course completers.</p><p dir=\\"ltr\\">This time around, we are providing more flexibility for all of you busy learners. We are running the Programming Mobile Applications courses in more digestible one-month-long sections, each with a meaningful mini-project at the end. Additionally, we will be re-offering the courses more frequently. Now, you can find a convenient time to join us or pick up where you left off if you didn\'92t quite finish before.</p><p dir=\\"ltr\\"><strong>Note:&nbsp;</strong>To participate in the final project, you must earn Verified Certificates for all courses in the sequence.&nbsp;Learners who purchase Full Access to the entire series will also receive&nbsp;two years of unlimited retries while these courses are offered.</p><p><strong>For previous MoCCA students:</strong>&nbsp;If you have&nbsp;<u><strong>already</strong></u>&nbsp;completed my previous version of this course, \\"Programming Mobile Applications for Android Handheld Systems\'94 offered in January and September 2014, you do&nbsp;<u><strong>not</strong></u>&nbsp;need to retake this course to continue towards the Specialization certificate and final project in 2015.&nbsp;</p><p>Please consult the&nbsp;<a href=\\"https://courserahelp.zendesk.com/hc/en-us/articles/201223289-Specializations\\">Specializations Help Center</a>&nbsp;or contact the&nbsp;<a href=\\"https://courserahelp.zendesk.com/hc/en-us/requests/new?ticket_form_id=19009\\">Coursera support team</a>&nbsp;if you are not sure whether you qualify.<br></p><p><strong>What is the MoCCA Specialization?</strong><br></p><p dir=\\"ltr\\">This course has been designed as part of a Coursera Specialization designed to help learners create complex, cloud-based Android Applications, called the&nbsp;<a href=\\"https://www.coursera.org/specialization/mobilecloudcomputing/2\\">Mobile Cloud Computing with Android (MoCCA) Specialization</a>.&nbsp;</p><p dir=\\"ltr\\">The other four courses are led respectively by Drs. Douglas Schmidt and Jules White of Vanderbilt University, and some of the programming assignments and the course project for these courses will be coordinated.</p><p dir=\\"ltr\\"></p><ul><li><strong>Course 3:</strong>&nbsp;<a href=\\"https://www.coursera.org/course/posaconcurrency\\">Programming Mobile Services for Android Handheld Systems: Concurrency</a><br></li><li><strong>Course 4:</strong>&nbsp;<a href=\\"https://www.coursera.org/course/posacommunication\\">Programming Mobile Services for Android Handheld Systems: Communication</a><br></li><li>Dr. Douglas Schmidt, Associate Chair of Computer Science and Engineering and Professor of Computer Science, Vanderbilt University<br></li></ul><p></p><p>The third and fourth courses in the sequence focus on systems programming topics, such as middleware services and background processing.&nbsp;<strong><br></strong></p><p dir=\\"ltr\\"></p><ul><li><strong>Course 5:</strong>&nbsp;<a href=\\"https://www.coursera.org/course/mobilecloudprogram\\">Programming Cloud Services for Android Handheld Systems: Spring</a><br></li><li><strong>Course 6:</strong>&nbsp;<a href=\\"https://www.coursera.org/course/mobilecloudsecurity\\">Programming Cloud Services for Android Handheld Systems: Security</a><br></li><li>Dr. C. Jules White, Assistant Professor of Computer Science, Vanderbilt University<br></li></ul><p></p><p>The fifth and sixth courses in the sequence will focus on connecting Android mobile devices to cloud computing and data storage resources, essentially turning a device into an extension of powerful cloud-based services on popular cloud computing platforms, such as Google App Engine and Amazon EC2.</p><p>Although each of these courses stands alone, those who do choose to complete the entire MoCCA sequence will gain a much more detailed, end-to-end understanding of handheld systems and their applications.</p>"\
    ],\
    "__v" : 0,\
    "level" : 2,\
    "skills" : [ \
        "android", \
        "mobile development"\
    ]\
\}\
\
/* 48 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30ae"),\
    "id" : "1989",\
    "shortName" : "catmooc",\
    "name" : "
\f1 \'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'d4\'ad\'c0\'ed\'d3\'eb\'ca\'b5\'bc\'f9
\f0  Principles and Practice of Computer-Aided Translation",\
    "url" : "https://www.coursera.org/course/catmooc",\
    "about" : [ \
        "<p>If you are having difficulty viewing this video in mainland China, you can also find it&nbsp;<a href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/01/21/331978_hd.mp4\\" target=\\"_blank\\">here</a>.</p><p>
\f1 \'bf\'ce\'b3\'cc\'bd\'e9\'c9\'dc\'ca\'d3\'c6\'b5\'d2\'b2\'bf\'c9\'d2\'d4
\f0 <a href=\\"http://video.study.163.com/edu-video/nos/mp4/2014/01/21/331978_hd.mp4\\" target=\\"_blank\\">
\f1 \'b7\'c3\'ce\'ca\'d6\'d0\'b9\'fa\'cd\'f8\'d5\'be
\f0 </a>
\f1 \'b9\'db\'bf\'b4\'a1\'a3
\f0 </p><p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'ca\'ca\'d3\'c3\'d3\'da\'b7\'ad\'d2\'eb\'cb\'b6\'ca\'bf\'d7\'a8\'d2\'b5\'d1\'d0\'be\'bf\'c9\'fa\'a1\'a2\'cd\'e2\'d3\'ef\'d7\'a8\'d2\'b5\'b8\'df\'c4\'ea\'bc\'b6\'b1\'be\'bf\'c6\'c9\'fa\'a1\'a2\'b7\'ad\'d2\'eb\'b9\'a4\'d7\'f7\'d5\'df\'d2\'d4\'bc\'b0\'cd\'e2\'d3\'ef\'b0\'ae\'ba\'c3\'d5\'df\'b5\'c8\'a1\'a3
\f0 </p><p>
\f1 \'cf\'d6\'b4\'fa\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'d0\'d0\'d2\'b5\'d2\'aa\'c7\'f3\'b4\'d3\'d2\'b5\'c8\'cb\'d4\'b1\'b1\'d8\'d0\'eb\'be\'df\'d3\'d0\'c0\'fb\'d3\'c3\'bc\'c6\'cb\'e3\'bb\'fa\'bc\'b0\'cd\'f8\'c2\'e7\'c0\'b4\'ca\'b9\'d3\'c3\'b8\'f7\'c0\'e0\'bc\'bc\'ca\'f5\'b8\'a8\'d6\'fa\'b9\'a4\'be\'df\'b0\'ef\'d6\'fa\'c6\'e4\'b9\'a4\'d7\'f7\'b5\'c4\'c4\'dc\'c1\'a6\'a3\'ac\'b6\'f8\'b2\'bb\'ca\'c7\'bd\'f6\'bd\'f6\'d1\'a7\'bb\'e1\'bc\'b8\'bf\'ee\'cf\'c1\'d2\'e5\'b5\'c4\'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'c8\'ed\'bc\'fe\'a1\'a3
\f0 </p><p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'d6\'f7\'d2\'aa\'bd\'b2\'ca\'da\'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'bc\'bc\'ca\'f5\'b5\'c4\'bb\'f9\'b4\'a1\'b8\'c5\'c4\'ee\'a3\'ac\'d1\'a7\'cf\'b0\'b6\'e0\'d6\'d6\'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'b9\'a4\'be\'df\'b5\'c4\'ca\'b9\'d3\'c3\'b7\'bd\'b7\'a8\'a3\'ac\'b6\'cd\'c1\'b6\'d1\'a7\'c9\'fa\'d4\'da\'bc\'bc\'ca\'f5\'bb\'b7\'be\'b3\'cf\'c2\'b4\'d3\'ca\'c2\'b7\'ad\'d2\'eb\'b9\'a4\'d7\'f7\'b5\'c8\'b8\'f7\'c0\'e0\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'b9\'a4\'d7\'f7\'b5\'c4\'c4\'dc\'c1\'a6\'a3\'ac\'b0\'ef\'d6\'fa\'d1\'a7\'c9\'fa\'c0\'ed\'bd\'e2\'d0\'c5\'cf\'a2\'bb\'af\'ca\'b1\'b4\'fa\'b5\'c4\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'b9\'a4\'d7\'f7\'a1\'a3
\f0 </p><p>
\f1 \'bf\'ce\'b3\'cc\'cd\'ea\'d5\'fb\'ba\'ad\'b8\'c7\'cf\'d6\'b4\'fa\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'b5\'c4\'bb\'f9\'b1\'be\'c7\'e9\'bf\'f6\'bd\'e9\'c9\'dc\'a1\'a2\'b7\'ad\'d2\'eb\'bc\'bc\'ca\'f5\'bb\'f9\'b1\'be\'b8\'c5\'c4\'ee\'a1\'a2\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'cf\'ee\'c4\'bf\'d6\'b4\'d0\'d0\'b9\'fd\'b3\'cc\'b5\'c4\'d0\'c5\'cf\'a2\'bb\'b7\'be\'b3\'d3\'eb\'d0\'c5\'cf\'a2\'bc\'bc\'ca\'f5\'a1\'a2\'c8\'e7\'ba\'ce\'c0\'fb\'d3\'c3\'b5\'e7\'d7\'d3\'b4\'c7\'b5\'e4\'a1\'a2\'cd\'f8\'c2\'e7\'d7\'ca\'d4\'b4\'bc\'b0\'d3\'ef\'c1\'cf\'bf\'e2\'b9\'a4\'be\'df\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'b9\'a4\'d7\'f7\'a1\'a2\'cf\'c1\'d2\'e5\'ba\'cd\'b9\'e3\'d2\'e5\'b5\'c4\'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'b9\'a4\'be\'df\'d4\'ad\'c0\'ed\'bc\'b0\'ca\'b5\'d5\'bd\'d1\'dd\'c1\'b7\'a1\'a2\'b7\'ad\'d2\'eb\'c4\'da\'c8\'dd\'d6\'ca\'c1\'bf\'c6\'c0\'b6\'a8\'a1\'a2\'b6\'e0\'c8\'cb\'d0\'ad\'cd\'ac\'b7\'ad\'d2\'eb\'cf\'ee\'c4\'bf\'a1\'a2\'b7\'ad\'d2\'eb\'b9\'dc\'c0\'ed\'b5\'c8\'b6\'e0\'b7\'bd\'c3\'e6\'b5\'c4\'c4\'da\'c8\'dd\'a1\'a3\'d7\'f7\'ce\'aa\'b7\'ad\'d2\'eb\'c0\'e0\'d7\'a8\'d2\'b5\'d1\'a7\'c9\'fa\'b5\'c4\'b1\'d8\'d0\'de\'bf\'ce\'b3\'cc\'a3\'ac\'b1\'be\'bf\'ce\'b3\'cc\'ca\'ca\'ba\'cf\'d3\'ef\'d1\'d4\'c0\'e0\'d7\'a8\'d2\'b5\'d1\'a7\'c9\'fa\'d1\'a7\'cf\'b0\'a1\'a3\'cd\'a8\'b9\'fd\'bf\'ce\'b3\'cc\'b5\'c4\'d1\'a7\'cf\'b0\'a3\'ac\'d3\'d0\'d6\'fa\'d3\'da\'d1\'a7\'cf\'b0\'d5\'df\'c1\'cb\'bd\'e2\'cf\'d6\'b4\'fa\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'d0\'d0\'d2\'b5\'a3\'ac\'d4\'f6\'c7\'bf\'b8\'f7\'c0\'e0\'bc\'c6\'cb\'e3\'bb\'fa\'b8\'a8\'d6\'fa\'b7\'ad\'d2\'eb\'b9\'a4\'be\'df\'b5\'c4\'ca\'b9\'d3\'c3\'bc\'bc\'c4\'dc\'a3\'ac\'cc\'e1\'b8\'df\'b0\'fc\'c0\'a8\'b7\'ad\'d2\'eb\'b9\'a4\'d7\'f7\'d4\'da\'c4\'da\'b5\'c4\'b8\'f7\'c0\'e0\'d3\'ef\'d1\'d4\'b7\'fe\'ce\'f1\'b9\'a4\'d7\'f7\'b5\'c4\'d0\'a7\'c2\'ca\'a1\'a3
\f0 </p><p>
\f1 \'b8\'c3\'bf\'ce\'b3\'cc\'ca\'c7
\f0 \'93
\f1 \'b1\'b1\'b4\'f3
\f0 -
\f1 \'b5\'c2\'b5\'be\'cd\'f8\'c2\'e7\'b9\'ab\'bf\'aa\'bf\'ce\'b3\'cc
\f0 \'94
\f1 \'d6\'d0\'b5\'c4\'d2\'bb\'c3\'c5\'a3\'ac\'d3\'c9\'b1\'b1\'be\'a9\'b4\'f3\'d1\'a7\'d3\'eb\'b5\'c2\'b5\'be\'bd\'cc\'d3\'fd\'c1\'aa\'ba\'cf\'cc\'e1\'b9\'a9\'a1\'a3
\f0 </p><p>
\f1 \'b1\'be\'bf\'ce\'b3\'cc\'cd\'ac\'ca\'b1\'ca\'dc\'b5\'bd
\f0 \'93
\f1 \'d3\'ef\'d1\'d4\'c4\'dc\'c1\'a6\'d0\'ad\'cd\'ac\'b4\'b4\'d0\'c2\'bc\'c6\'bb\'ae
\f0 \'94
\f1 \'d7\'ca\'d6\'fa\'ba\'cd\'d6\'a7\'b3\'d6\'a1\'a3
\f0 </p>\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n\\n<p>This course is suitable for postgraduate students who major in Translation and Interpreting, undergraduate students majoring in foreign language, translators and language enthusiasts.</p><p>Those who work in modern language service industry are required to be capable of using computers and Internet to aid their translation job by adapting a variety of efficient tools, rather than just using word processor tools and several basic computer-aided translation software.</p><p>This course teaches the basic concepts of computer-aided translation technology, helps students learn to use a variety of computer-aided translation tools, enhances their ability to engage in various kinds of language service in such a technical environment, and helps them understand what the modern language service industry looks like.</p><p>This course covers introduction to modern language services industry, basic principles and concepts of translation technology, information technology used in the process of language translation, how to use electronic dictionaries, Internet resources and corpus tools, practice of different computer-aided translation tools, translation quality assessment, basic concepts of machine translation, globalization, localization and so on. As a compulsory course for students majoring in Translation and Interpreting, this course is also suitable for students with or without language major background. By learning this course, students can better understand modern language service industry and their work efficiency will be improved for them to better deliver translation service.</p><p>The course is one of the PKU-DeTao MOOCs, which is a joint effort by Peking University and DeTao Masters Academy.</p>"\
    ],\
    "__v" : 0\
\}\
\
/* 49 */\
\{\
    "_id" : ObjectId("554d2ceeccd29f0c2b7b30b3"),\
    "id" : "131",\
    "shortName" : "androidapps101",\
    "name" : "Creative, Serious and Playful Science of Android Apps",\
    "url" : "https://www.coursera.org/course/androidapps101",\
    "about" : [ \
        "<img src=\\"https://d396qusza40orc.cloudfront.net/androidapps101/images/android1.jpg\\" style=\\"float:right; margin:0 0 0 5px; width:270px;\\" alt=\\"\\">\\n<p>This course is a <strong>novice-friendly and delightful introduction</strong> to computer science and to programming Android apps for smartphones and tablets. <strong>No prior programming knowledge is necessary.</strong> In this course you will have fun learning to <strong>create an app for modern Android devices</strong>, such as the Nexus tablet.</p>\\n<p>You will <strong>use the programming tools</strong> that Android software developers use to build your own useful app during this course. Along the way, we will introduce <strong>fundamental computer science principles and programming ideas</strong> that power today\'92s smartphone and tablet apps.</p>\\n<p>We will also peek beyond the borders of Android programming to the world of computer science. Meet computer science undergraduates, see one of the first <strong>vacuum tube computers</strong>, the first <strong>transistor</strong>, and now-modern <strong>scientific research</strong> on the Blue Waters supercomputer\'97all at Illinois.</p>\\n\\n<p><strong>Android Developer Track: Weeks 1\'965</strong> (required for passing the course):<br>\\nThis portion of the course is intended to give you a <strong>slow and gentle introduction to the basics</strong> of Android application development such as downloading, installing, and setting up the tools you will use in this course. You will also <strong>create your first Android app</strong> and share the results of your experience with your classmates\'97all while writing hardly any code at all! </p><p>\\n</p><p><strong>Computer Science and Programming Track: Weeks 6\'968</strong> (optional):<br>\\nDuring this latter portion of the course, you can <strong>delve deeper into computer science fundamentals</strong> and beginner programming techniques. Together we will explore this content while <strong>developing another really cool project</strong> to share.</p>"\
    ],\
    "__v" : 0,\
    "level" : 3,\
    "skills" : [ \
        "android", \
        "mobile development"\
    ]\
\}}